{
  "schedule": {
    "version": "2019-12-13 00:44; chaos-west 1.0; open-infra 3; chaoszone 0.1",
    "conference": {
      "acronym": "36C3",
      "title": "36. Chaos Communication Congress",
      "start": "2019-12-26",
      "end": "2019-12-30",
      "daysCount": 5,
      "timeslot_duration": "00:15",
      "days": [
        {
          "index": 1,
          "date": "2019-12-26",
          "day_start": "2019-12-26T06:00:00+01:00",
          "day_end": "2019-12-27T04:00:00+01:00",
          "rooms": {
            "Lecture room 11": [],
            "Seminar room 14-15": [],
            "Seminar room 13": [],
            "Lecture room M1": [],
            "Lecture room M2": [],
            "Lecture room M3": [],
            "Kidspace": [],
            "CCL Saal 3": [],
            "Chaos West Bühne": [],
            "ChaosZone": [],
            "OIO Stage": []
          }
        },
        {
          "index": 2,
          "date": "2019-12-27",
          "day_start": "2019-12-27T06:00:00+01:00",
          "day_end": "2019-12-28T04:00:00+01:00",
          "rooms": {
            "Lecture room 11": [],
            "Seminar room 14-15": [],
            "Seminar room 13": [],
            "Lecture room M1": [],
            "Lecture room M2": [],
            "Lecture room M3": [],
            "Kidspace": [],
            "CCL Saal 3": [],
            "Chaos West Bühne": [],
            "ChaosZone": [],
            "OIO Stage": [
              {
                "id": 376,
                "guid": "989bacb7-b112-5f02-afc3-6c112aab3435",
                "logo": "",
                "date": "2019-12-27T10:00:00+01:00",
                "start": "10:00",
                "duration": "01:00",
                "room": "OIO Stage",
                "slug": "RSGMFF",
                "url": "https://talks.oio.social/36c3-oio/talk/RSGMFF/",
                "title": "Generalprobe Stage",
                "subtitle": "",
                "track": null,
                "type": "Talk 45 minutes + 10 minutes Q&A",
                "language": "de",
                "abstract": "Finales Trockenschwimmen auf der Bühne mit Licht, Ton, Video, Streaming",
                "description": "Speaker wird noch gesucht für Powerpoint-Karaoke oder \"Autocomplete Texting\" (requires audience)",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 6,
                    "code": "HFER8G",
                    "public_name": "Adorfer",
                    "biography": "In \"[Tier][1][netzen][2]\" aufgewachsen, vom \"[Knastfunk][3]\" sozialisiert, \r\nhat mal mit [waffle][4] und [KA9Q][5] angefangen und den Einstieg zu TCP/IP über [AX.25][6] gefunden.\r\nErste Begegnung mit Mesh-Funknetzen: \"PublicDomain87\" (FoeBUDe.V./Bunker Ulmenwall/Bielefeld/1998): \"[DIRC -- kostenloses Telefonnetz\" mit Winrich Hoseit, Köln][7])\r\n\r\n  [1]: http://de.wikipedia.org/wiki/FidoNet\r\n  [2]: http://de.wikipedia.org/wiki/Janus_%28Protokoll%29\r\n  [3]: http://de.wikipedia.org/wiki/CB-Funk\r\n  [4]: http://en.wikipedia.org/wiki/Waffle_%28BBS_software%29\r\n  [5]: http://en.wikipedia.org/wiki/KA9Q\r\n  [6]: http://en.wikipedia.org/wiki/AX.25\r\n  [7]: http://www.spiegel.de/spiegel/print/d-8778738.html",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 379,
                "guid": "a01886bc-c6f6-5598-bdef-59d89b73def5",
                "logo": "",
                "date": "2019-12-27T13:00:00+01:00",
                "start": "13:00",
                "duration": "00:55",
                "room": "OIO Stage",
                "slug": "DQ3DBL",
                "url": "https://talks.oio.social/36c3-oio/talk/DQ3DBL/",
                "title": "Opening Session",
                "subtitle": "",
                "track": null,
                "type": "Talk 45 minutes + 10 minutes Q&A",
                "language": "de",
                "abstract": "Eröffnung des OIO, der Bühne und Vorstellung aller Assemblies auf dem OIO",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 139,
                    "code": "GDG8D9",
                    "public_name": "Peter",
                    "biography": null,
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 365,
                "guid": "1cc57eb1-b131-5ea5-b970-d4af83ceb573",
                "logo": "",
                "date": "2019-12-27T16:10:00+01:00",
                "start": "16:10",
                "duration": "00:25",
                "room": "OIO Stage",
                "slug": "JDASEQ",
                "url": "https://talks.oio.social/36c3-oio/talk/JDASEQ/",
                "title": "Hamnet – introduction into a wireless backbone",
                "subtitle": "",
                "track": null,
                "type": "Talk 20 minutes + 5 minutes Q&A",
                "language": "en",
                "abstract": "We take a quick dive into the Highspeed Amateurradio Multimedia NETwork the wireless backbone of the European Amatuerradio Community. It’s uses mostly commercial hardware on it’s own frequencies beneath the 2,4 and 5 GHz wifi bands. The net is routed with it’s own ipv4 private network consisting of multiple 44.xxx.000.000/16 blocs.",
                "description": "A short overview on what the Hamnet is and how it came to be. Not forgetting all the challenges of technical and legal kind that come with running and building the Net.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 135,
                    "code": "YXFCTE",
                    "public_name": "Lars Rokita",
                    "biography": "Physics student who likes to tinker around with high frequency stuff. Call DL4APT",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 358,
                "guid": "031fc5c8-09c3-5490-ad8e-3858d391763b",
                "logo": "",
                "date": "2019-12-27T16:45:00+01:00",
                "start": "16:45",
                "duration": "00:55",
                "room": "OIO Stage",
                "slug": "GWFPXV",
                "url": "https://talks.oio.social/36c3-oio/talk/GWFPXV/",
                "title": "Observations on societal and technological changes in the DPRK",
                "subtitle": "",
                "track": null,
                "type": "Talk 45 minutes + 10 minutes Q&A",
                "language": "en",
                "abstract": "The Democratic People's Republic of Korea (North Korea) is a hot topic in the media. The peninsula is changing rapidly, but how is that reflected in life on the ground? What is it like to live in Pyongyang? Are the externally reported societal changes and developments in technology also visible in everyday life? This talk will describe modern urban life in Pyongyang, and the recent forces driving change.",
                "description": "The talk will particularly focus on observations around the state of youth mindset towards change and technology. For example, what are the future elites' attitudes towards entrepreneurship in an officially communist country? What small signals of changing attitudes can we observe that might influence the opening of the county? Presenting the realities of this environment leads us to the demo of consumer technology, and presented that opportunities for both societal change and technological development might be broader than we often see. We will present this deep dive to North Korea from the perspective of two foreigners who have been spending months at a time in Pyongyang and have been studying it since 2012.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 131,
                    "code": "9LVDDR",
                    "public_name": "Jukka-Pekka Heikkilä",
                    "biography": "A scholar, co-creator, culture hacker and entrepreneurship educator specialized in extreme settings.\r\n\r\nJukka-Pekka has taught entrepreneurship courses and organized startup and science diplomacy events in Pyongyang between 2012 - 2017. He is a co-founder of WTSUP! Beirut aims to foster equality and volunteerism culture in the Middle East and a founder of Burning Stories research project that aims to study the transformation of Burning Man participants and its impact on society. From academic affiliations, Jukka-Pekka is a Newton Fellow of the Royal Society (UK) and British Academy, an Academy of Finland post-doctoral Fellow based in Aalto University, Finland, and a visiting scholar at Stanford University. In Finland, he works as a board member with The Shortcut, a sister organisation of Slush and an initiative that aims to integrate immigrants to the Finnish society via tech entrepreneurship education.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 343,
                "guid": "e0cc4db9-1ca6-5ded-a3db-1625a22f27dd",
                "logo": "/media/36c3-oio/images/C33LPX/qaul-sing-blau_512_X3u9MVw.png",
                "date": "2019-12-27T17:50:00+01:00",
                "start": "17:50",
                "duration": "00:25",
                "room": "OIO Stage",
                "slug": "C33LPX",
                "url": "https://talks.oio.social/36c3-oio/talk/C33LPX/",
                "title": "Refactoring qaul.net in Rust (Internet independent mesh communication App)",
                "subtitle": "",
                "track": null,
                "type": "Talk 20 minutes + 5 minutes Q&A",
                "language": "en",
                "abstract": "Concepts, goals, implementations and the lessons learned from rewriting qaul.net decentralized messenger in rust.",
                "description": "qaul.net is a Internet independent wifi mesh communication app with fully decentralized messaging, file sharing and voice chat. At the moment we are rewriting the entire application in rust, implementing our experience of 8 years off the grid peer2peer mesh communication, with a mobile first approach and a network agnostic routing protocoll wich can do synchronous as well as delay tolerant messaging. \r\n\r\nWe are currently rewriting qaul.net 2.0 in rust with a new network agnostic routing protocol, identity based routing and delay tolerant messaging. The talk will show our learnings and the journey ahead of us at the alpha stage of the rewrite.\r\n\r\n* Homepage: https://qaul.net\r\n* Code Repository: https://git.open-communication.net/qaul/qaul.net",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 120,
                    "code": "G78ZPE",
                    "public_name": "Mathias Jud",
                    "biography": "Mathias Jud is a berlin based artist. Since over twenty years, he works together with Christoph Wachter.\r\nTheir art works include open-source projects that uncover forms of censorship of the Internet, undermine the concentration of political power and even resolve the dependency on infrastructure.\r\n\r\nhttps://www.wachter-jud.net/",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 361,
                "guid": "61ab92a1-92e5-56ff-9fa8-bb1156c73988",
                "logo": "",
                "date": "2019-12-27T18:30:00+01:00",
                "start": "18:30",
                "duration": "00:45",
                "room": "OIO Stage",
                "slug": "XHLTUD",
                "url": "https://talks.oio.social/36c3-oio/talk/XHLTUD/",
                "title": "re:claimID - Self-sovereign, Decentralised Identity Management and Personal Data Sharing [YBTI/wefixthenet session]",
                "subtitle": "",
                "track": null,
                "type": "Talk 45 minutes + 10 minutes Q&A",
                "language": "en",
                "abstract": "In this talk we present re:claimID, a decentralized, self-sovereign identity\r\nmanagement system. re:claimID allows users to reclaim authority over their\r\nidentities and personal data. The system is built on top if a\r\nstate-of-the-art, decentralized directory service: The GNU Name System.\r\nBuilt-in cryptographic mechanisms allow users to selectively disclose\r\npersonal data and the directory service ensures that this data is accessible\r\nto authorized parties even if the user is offline. Through OpenID Connect,\r\nintegration and use of re:claimID is straight-forward and authorization\r\nflows are familiar. In this talk, we present the current state of re:claimID\r\nas well as a future roadmap.",
                "description": "Today, users are often required to share personal data, like email\r\naddresses, to use services on the web. As part of normal service operation,\r\nsuch as notifications or billing, services require access to -- ideally\r\nfresh and correct -- user data. Sharing attributes in the Web today is often\r\ndone via centralized service providers to reduce data redundancy and to give\r\nservices access to current, up-to-date information even if the user is\r\ncurrently offline. Abuse of this power is theoretically limited by local\r\nlaws and regulations. But, the past has shown that even well-meaning\r\nidentity providers struggle to keep user data safe as they become major\r\ntargets for hackers and nation state actors while striving for monetizing\r\nanonymized statistics from these data. We advocate for a new, decentralized\r\nway for users to manage their identities for the following reasons:\r\n\r\n*       The current state of omniscient identity providers is a significant\r\nthreat to the users' privacy.\r\n\r\n*       Users must completely trust the service provider with respect to\r\nprotecting the integrity and confidentiality of their identity in their\r\ninterest.\r\n\r\n*       The service provider itself is facing substantial liability risks\r\ngiven the responsibility of securely managing potentially sensitive personal\r\ndata of millions of users.\r\n\r\n \r\n\r\nWe present re:claimID, a decentralized identity service with the following\r\nproperties:\r\n\r\n*       Self-sovereign: You manage your identities and attributes locally on\r\nyour computer. No need to trust a third party service with your data.\r\n\r\n*       Decentralized: You can share your identity attributes securely over\r\na decentralized name system. This allows your friends to access your shared\r\ndata without the need of a trusted third party. \r\n\r\n*       Standard-compliant: You can use OpenID Connect to integrate reclaim\r\nin your web sites.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 128,
                    "code": "MCE83P",
                    "public_name": "dvn",
                    "biography": "p2p communications and privacy researcher and developer\r\n\r\nCurrently organizing a \"youbroketheinternet/wefixthenet\" session at 36c3, representing GNUnet.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 370,
                "guid": "6f9aaed7-537d-50b6-a5e8-25ef1f65583d",
                "logo": "",
                "date": "2019-12-27T20:50:00+01:00",
                "start": "20:50",
                "duration": "00:25",
                "room": "OIO Stage",
                "slug": "VSV8Y8",
                "url": "https://talks.oio.social/36c3-oio/talk/VSV8Y8/",
                "title": "SaveTheInternet - Die Urheberrechtsreform als Zündfunke demokratischer Teilhabe",
                "subtitle": "",
                "track": null,
                "type": "Talk 20 minutes + 5 minutes Q&A",
                "language": "de",
                "abstract": "Eine kurze Erzählung von den Anfängen der Protestbewegung bis heute und darüber hinaus. Wenn eine spontan gebildete Menge an Menschen beginnt die Werkzeuge der Demokratie zu nutzen ist das vorläufige Ergebnis eine der größten Petitionen weltweit und über 200.000 kreativ Protestierende auf den Straßen Europas. War es das schon oder kommt da noch etwas? Welche Auswirkungen haben demokratische Werkzeuge wie Petitionen und Demonstrationen? Kann man die nächsten Proteste voraussehen oder wie entstehen Wellen der Aufmerksamkeit? Hat sich eine neue Empörung zum ersten oder zum letzen Mal aufgetan? Von vernetzen Livestreams während der Proteste bis zu Community Aktionen wie Meme-Events und Briefraids.",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 137,
                    "code": "PCJYPA",
                    "public_name": "segal",
                    "biography": "Ich reiche Vorträge für about:freedom hier ein.",
                    "answers": []
                  },
                  {
                    "id": 144,
                    "code": "KQYUCW",
                    "public_name": "w4sserfall",
                    "biography": null,
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 363,
                "guid": "a3f9136b-fa32-504d-a762-438d5141ac74",
                "logo": "",
                "date": "2019-12-27T21:20:00+01:00",
                "start": "21:20",
                "duration": "00:55",
                "room": "OIO Stage",
                "slug": "VPUTHL",
                "url": "https://talks.oio.social/36c3-oio/talk/VPUTHL/",
                "title": "Treating IS - Humanitäre Prinzipien im Konflikt",
                "subtitle": "",
                "track": null,
                "type": "Talk 45 minutes + 10 minutes Q&A",
                "language": "de",
                "abstract": "Frank Dörner von Ärzte ohne Grenzen und Sebastian Jünemann von CADUS diskutieren die jüngsten Angriffe auf humanitäre Prinzipien in verschiedenen Kontexten, wie beispielsweise während der medizinischen Nothilfe in Nordost-Syrien.",
                "description": "Eigentlich sollte es klar sein: Menschen die medizinische Hilfe benötigen sollen sie auch bekommen, Punkt. Doch in Medienkommentaren wird der humanitären Hilfsorganisation CADUS, die ein Feldkrankenhaus im Camp Al Hol in Nordost-Syrien betreibt, längst nicht nur Respekt ausgesprochen. Manche Kommentator*innen schlagen vor, humanitäre Prinzipien auszusetzen sobald es sich bei den Hilfesuchenden um mutmaßliche Angehörige des sogenannten Islamischen Staates (IS) handelt. Schließlich, so die Argumentation, missachte diese Organisation systematisch eben solche Prinzipien. \r\n\r\nIn vielen Konflikten werden humanitäre Grundsätze heute zunehmend missachtet. Helfende werden zu Feinden erklärt und damit legitime Ziele für jedwede Aggression. Krankenhäuser und Ambulanzen können gezielt angegriffen werden, ohne dass es Konsequenzen hat. Afghanistan, Syrien, Yemen – die Liste ist lang. Und aus der jüngsten Geschichte der Seenotrettung wissen wir: auch von staatlichen Stellen werden immer wieder humanitäre Grundsätze mit Füßen getreten. \r\n\r\nFrank Dörner von Ärzte ohne Grenzen und Sebastian Jünemann von CADUS geben einen Einblick was es bedeutet, in gesellschaftlich und politisch stark umstrittenen Kontexten Hilfe zu leisten, in denen humanitäre Prinzipien immer wieder aus verschiedensten Richtungen angegriffen werden.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 133,
                    "code": "M7YNCY",
                    "public_name": "Sebastian Jünemann",
                    "biography": "Gründer der unabhängigen humanitären Hilfsorganisation CADUS e.V., die in Zusammenarbeit mit lokalen Partner*innen medizinische und technische Nothilfe leistet. CADUS ist hauptsächlich in Nordost-Syrien und im Nord-Irak tätig. Im Berliner Crisis Response Makerspace der Organisation werden open source Lösungen für Herausforderungen in der humanitären Hilfe entwickelt.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              }
            ],
            "Chaos-West Bühne": [
              {
                "id": 264,
                "guid": "8909a42b-c36a-58b3-af07-39f671ac9351",
                "logo": "",
                "date": "2019-12-27T10:45:00+01:00",
                "start": "10:45",
                "duration": "00:15",
                "room": "Chaos-West Bühne",
                "slug": "U3SAXX",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/U3SAXX/",
                "title": "Chaos-West Stage: Opening",
                "subtitle": "",
                "track": null,
                "type": "Einfacher Slot",
                "language": "de",
                "abstract": null,
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 85,
                    "code": "XVCJLF",
                    "public_name": "Chaos-West",
                    "biography": null,
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 262,
                "guid": "3a62d6f9-26d7-5bad-ba07-a064e395a97b",
                "logo": "",
                "date": "2019-12-27T11:00:00+01:00",
                "start": "11:00",
                "duration": "00:30",
                "room": "Chaos-West Bühne",
                "slug": "JRZ3HF",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/JRZ3HF/",
                "title": "36C3 Opening - STREAM",
                "subtitle": "",
                "track": null,
                "type": "Einfacher Slot",
                "language": "de",
                "abstract": null,
                "description": "",
                "recording_license": "",
                "do_not_record": true,
                "persons": [
                  {
                    "id": 85,
                    "code": "XVCJLF",
                    "public_name": "Chaos-West",
                    "biography": null,
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 188,
                "guid": "51a9f476-22d9-5844-ace2-a9078540bec5",
                "logo": "",
                "date": "2019-12-27T11:30:00+01:00",
                "start": "11:30",
                "duration": "00:20",
                "room": "Chaos-West Bühne",
                "slug": "LBLBJT",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/LBLBJT/",
                "title": "Swiss Cybervoting PIT(falls)",
                "subtitle": "",
                "track": "All about computers",
                "type": "Einfacher Slot",
                "language": "en",
                "abstract": null,
                "description": "The Swiss democracy is one of it's kind.\r\nDigitization is starting to affect even our most critical processes, such as voting.\r\n\r\nWhen a piece of code suddenly gets responsible for democracy, it's only natural that the voices get loud and many questions get raised:\r\nIs our democracy at stake? Do we have to fear for our privacy? Is electronic voting even feasible in Switzerland? Is such a solution secure?\r\n\r\nAs part of a mandatory Public Intrusion Test (PIT), the Swisspost released their e-voting source code to the world and started a heated debate - far beyond the Swiss borders.\r\n\r\nNot only the codebase revealed several problems during the PIT. \r\nInteresting scoping, redefining the term \"open source\" and unreleased security audits were only some of the issues that security researchers faced and caused controversy.\r\n\r\nIn this talk we will have a look at many technical and non-technical aspects of the e-voting solution and PIT from the view of a participating security researcher.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 132,
                    "code": "ER9SQ9",
                    "public_name": "Jannis Kirschner",
                    "biography": "Jannis is a Swiss Security Researcher and CTF player. With a passion for reverse engineering and exploit development, he loves to analyze complex applications. He regularly participates in national and international cybersecurity competitions and speaks at various conferences and events.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 182,
                "guid": "edf22d8e-d223-5f63-b796-e6fded2b112d",
                "logo": "/media/36c3/images/TCNWMW/19-10-25_2-21-35_PM_2965_lUBOOhw.jpg",
                "date": "2019-12-27T12:00:00+01:00",
                "start": "12:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "TCNWMW",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/TCNWMW/",
                "title": "Landtagswahlen sind Klimawahlen und was das für Fridays for Future Thüringen bedeutet hat",
                "subtitle": "",
                "track": "Klimakatastrophe",
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": null,
                "description": "Seit knapp einem Jahr geht die Fridays for Future Bewegung auf die Straßen und durch die Medien. Nebst Brandenburg und Sachsen hat auch Thüringen einen neuen Landtag gewählt. Für Fridays for Future Thüringen war daher sofort klar: Landtagswahlen sind Klimawahlen und wir müssen handeln! Denn die hier gewählten Volksvertrater\\*innen sind die letzten die das Steuer noch herumreißen können.\r\n\r\nAber wie läuft das eigentlich wenn wir nur drei Monate haben um vier Streiks zu organisieren? Was gehört überhaupt zu so einem Streik? Was kostet das eigentlich und wie finanzieren wir das? Was fordern wir? Wann schlafen wir? Mit wem gehen wir in ein Bündnis? All diese Fragen werden in diesem Talk von einem Mitglied des Orga-Teams beantwortet.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 128,
                    "code": "KCXHMY",
                    "public_name": "Moritz Fromm",
                    "biography": "Antifaschist und Aktivist bei Fridays for Future Erfurt & Thüringen",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 191,
                "guid": "20e8e532-a5c8-5c46-b1e8-ee648ca653a9",
                "logo": "",
                "date": "2019-12-27T13:00:00+01:00",
                "start": "13:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "RKMAKL",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/RKMAKL/",
                "title": "Risky Business?! – Rechte und Pflichten von IT-SicherheitsforscherInnen",
                "subtitle": "",
                "track": "All about computers",
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": null,
                "description": "In einem Gespräch über die Hackertool-Paragraphen des Strafgesetzbuches in LNP 296 sagte Frank zu Linus: „Damals haben wir juristisch noch ein bisschen was dazugelernt, nämlich dass die Begründung bzw. Erläuterung des Gesetzes in der deutschen Jurisprudenz mit herangezogen wird.“ Diese Kenntnis reicht für das Lesen von Gesetzen und Gerichtsurteilen aus. Für die IT-Sicherheitsforschung und die Analyse beispielsweise leicht auffindbarer Login-Daten bedarf es aber umfangreicherer Kenntnisse. Fragt man dazu einen Juristen, ist die Antwort oft komplex und führt zum \"buffer overflow\" und einer \"brain resource exhaustion\" des Fragenden.\r\n\r\nDamit ForscherInnen beider Gebiete und Interessierte \"ressourcenschonender\" kommunizieren können und um das juristische Verständnis zu erweitern, fasst dieser Vortrag in einem Überblick die wichtigsten Punkte verständlich zusammen. Betrachtet werden das hauptsächlich Datenschutz- und IT-Sicherheitsrecht, am Rande auch erwähnte,  relevante Strafrechtsnormen. Die (prozessuale) Thematik der Hausdurchsuchung bleibt wegen des Talks vom 35c3 (https://media.ccc.de/v/35c3-10018-verhalten_bei_hausdurchsuchungen) außen vor.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 136,
                    "code": "XXUL7E",
                    "public_name": "Oliver Vettermann",
                    "biography": "Oliver Vettermann ist Jurist und wissenschaftlicher Mitarbeiter im Team für Immaterialgüterrechte von Prof. Franziska Boehm. Für FIZ Karlsruhe betreut er interdisziplinäre Forschungsprojekte – vor allem in der IT-Sicherheit – im Datenschutz- und IT-Sicherheitsrecht. Bei seiner Tätigkeit an der Universität Leipzig widmet er sich für seine Promotion dem verfassungsrechtlichen Schutz der digitalen Identität. Zwischen diesen kopflastigen Tätigkeiten fährt er Fahrrad, schreibt englische Videospiel-Reviews und twittert sich mit Gifs als @magnus_cerebrum durch die Welt.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 190,
                "guid": "c49cf6de-d9f4-50ba-aba2-cb326e3bd385",
                "logo": "",
                "date": "2019-12-27T14:00:00+01:00",
                "start": "14:00",
                "duration": "00:20",
                "room": "Chaos-West Bühne",
                "slug": "MXQBWP",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/MXQBWP/",
                "title": "Ansible all the Things",
                "subtitle": "",
                "track": "The real basic about Bits and Nibbles",
                "type": "Einfacher Slot",
                "language": "de",
                "abstract": null,
                "description": "In diesem Talk wird es um die Grundlagen von Ansible gehen, warum es für den Vortragenden das beste Werkzeug ist und welche alternativen es noch gibt.\r\nVom ersten Host Inventory im YAML Format über die kleine Rollen (NTP/Fail2Ban) und Playbooks bis hin zum ersten kompletten Einrichten des Rasberry Pi oder Servers mit eigenen Dotfiles und den Basic Paketen die man so braucht.\r\nAuch wird drauf eingegangen, wie und warum reproduzierbare Infrastruktur Builds das Leben eines Admins erleichtern können und im Alltag der händischen Arbeit vorzuziehen sind. Abschließen wird der Talk mit dem Thema \"Ansible Playbooks aus dem Internet herunterladen oder selbst machen?\" und worauf man achten sollte, wenn man Playbooks für mehrere unterschiedliche Linux Distributionen baut.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 135,
                    "code": "M93FNJ",
                    "public_name": "Heiko Borchers",
                    "biography": "Fachinformatiker aus Düsseldorf, im moment viel mit Autos in digitalen Wolken unterwegs. Hat früher mal für diverse Unis und Forschungsinstitute gearbeitet und automatisiert sich inzwischen die meiste Arbeit weg um länger schlafen zu können.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 244,
                "guid": "0f020c49-a754-5758-b794-25d84e0ac19a",
                "logo": "/media/36c3/images/KPKBDU/ArcoLinux_2019-11-24_20-48-54.png",
                "date": "2019-12-27T14:30:00+01:00",
                "start": "14:30",
                "duration": "00:20",
                "room": "Chaos-West Bühne",
                "slug": "KPKBDU",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/KPKBDU/",
                "title": "Freedombone - DIY Soziale Veränderung in Zeiten des Überwachungskapitalismus",
                "subtitle": "",
                "track": "The real basic about Bits and Nibbles",
                "type": "Einfacher Slot",
                "language": "de",
                "abstract": null,
                "description": "Was wäre, wenn das Internet nicht wie ein feudaler Besitz regiert würde? Was\r\nwäre, wenn es von und für Leute, die es benutzen, betrieben würde?\r\n\r\nIch benutze Freedombone um der Geselschaft sowie auch allen Individuen zu\r\nermöglichen, die Datensouveränität aus dem free-to-use Model des\r\nÜberwachungskapitalismus zurück zu gewinnen. Durch die Möglichkeit [\"Server\r\nApps\"] ohne technisches Wissen mit 4 Klicks über einer Web UI zu installieren,\r\nist es möglich, dass Hobby-Admins ohne viel Zeit, sowie auch in Umgang mit\r\nServern und Hosting unerfahrene Menschen nicht bei der Inbetriebnahme scheitern.\r\n\r\nSomit kann jede Einzelperson oder eine Community das Internet als freies\r\nKommunikationmiittel wieder nutzen.Bei diesem Talk liegt der Fokus auf dem\r\nFediverse, die Vernetztung sozialer Bewegungen und dem nutzen Dienstprogramme.\r\n[\"Server Apps\"](https://freedombone.net/apps.html)\r\n\r\n\r\nEs ist eine Tatsache, dass Mainstream-Software kaputt ist und die Unternehmen,\r\ndie sie entwickeln, unzuverlässig und datenhungrig sind.\r\n\r\nDaher ist zu folgern, dass wir einen Bruchpunkt in der Gesichte des menschlichen\r\nInformationsaustausches erreicht haben. Die Rückgewinnung der Datensouveränität\r\nist bei Freedombone ein Selbstverständnis. **Du willst also deine eigenen\r\nInternetdienste betreiben, aber hast keine Zeit dies umzusetzen?**\r\n\r\n\r\nDie Konfiguration von Diensten wie E-Mail, Chat, VoIP, Websiten,\r\nDateisynchronisation, Wikis, Blogs, soziale Netzwerken (pleroma, zap, pixelfeed,\r\nua.), Medienhosting, Backups, VPN sind an sich schon ein nicht triviales\r\nUnterfangen. Das Ziel von \\[Freedombones\\](https://freedombone.net/) ist es die\r\nKonfiguration zu übernehmen. Freedombone ist ein Home-Server-System, mit dem du\r\nall diese Dinge von deinem Wohn- oder Hackerzimmer hosten kannst. Für die\r\nEinrichtung wird eine .img.xz [Image] auf einen USB Stick geladen. Nach dem\r\nersten Boot ist ein Email Server schon funktionsfähig. Standartmässig sind alle\r\nDienste im Internet über DNS im Clearnet aber auch im Darknet über TOR\r\nerreichbar.\r\n\r\nFreedombone ist ein AGPLv3 Open Source Projekt.\r\n[Git](https://code.freedombone.net/bashrc/freedombone)\r\n\r\nMein aktuelles Ziel, in diesem Jahr, war die Einbindung von Freifunk. Die\r\nWeboberfläche zeigt alle öffentlich bekannten Freifunk Nodes einer lokalen\r\nFreifunk Gruppe auf einer Karte an. Der Admin wählt den Konfig einer Freifunk\r\nGruppe. Seit Frühjahr arbeite ich auch an an einem GitlabCI System, welches das\r\nZiel hat die Wartung der Software des Projektes zu erleichtern.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 188,
                    "code": "WGSPN3",
                    "public_name": "Sw0rdDoom",
                    "biography": "Studies Life, especially Computer Science in Bremen at Day, Makes Computers do things at Night.\r\n\r\nI am currently doing my bachelor in Computer Science at the University Bremen. I work there as a student research assistant at the Cyber-Physical Systems Institute of German Research Centre for Artificial Intelligence.   https://www-cps.hb.dfki.de/\r\n\r\nAt NIght I like Data Science and Social Responsibility\r\nSee my Last Meeting at [Fiffkon19](https://2019.fiffkon.de/program/events/37.html)",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 230,
                "guid": "a8ea9881-0e74-5dc4-8ce4-74abadf19030",
                "logo": "",
                "date": "2019-12-27T16:00:00+01:00",
                "start": "16:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "XFXE9Q",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/XFXE9Q/",
                "title": "Ein Teil davon. Wie feministische Hackspaces Gemeinschaft herstellen.",
                "subtitle": "",
                "track": "Nicht Computers",
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": null,
                "description": "In den vergangenen Jahren haben sich immer mehr feministische Hackspaces in den verschiedensten Formen gegründet. Warum eigentlich? Was bewegt Menschen dazu, was macht einen feministischen Hackspace überhaupt aus und wie können wir alle davon lernen? Das habe ich in meiner Masterarbeit untersucht und bin dafür durch Deutschland gereist, um mit Mitgliedern feministischer Hackspaces zu sprechen. Im Ergebnis werden die Funktionen feministischer Hackspaces beleuchtet und analysiert, warum diese Räume für ihre Mitglieder so wichtig sind.\r\n\r\nUm das herauszufinden, habe ich mit dem qualitativen Forschungsstil der „Grounded Theory“ in einem zirkulären Verfahren Interviews geführt und ausgewertet. So habe ich ein Modell entwickelt, das zeigen kann, welche Kernfunktionen Hackspaces haben, welche Faktoren Menschen davon abhalten, in ihrem lokalen Hackspace aktiv zu werden, und wie feministische Hackspaces versuchen, diese Defizite auszugleichen.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 176,
                    "code": "R83MCR",
                    "public_name": "Julia",
                    "biography": "Fast fertig mit dem Soziologie-Masterstudium an der Uni Osnabrück geht es danach hoffentlich in den Journalismus. Daneben: Mit Code die Welt verbessern als Mentorin bei Jugend hackt, programmieren für Code for Osnabrück, Crypto-Workshops mit Digitalcourage und jede Menge Spaß mit dem Chaostreff Osnabrück.\r\n\r\nNach der Schnapsidee, das Bachelorstudium in Germanistik und Soziologie in Jena mit einer Arbeit in Computerlinguistik zu beenden, habe ich festgestellt, dass ich mehr mit diesen Computern machen will. Hintergrund bis dahin: Einführungsvorlesung Computerlinguistik + paar Jahre Linux-Erfahrung + bisschen Python + bisschen R + bisschen LaTeX + bisschen Übermut. Danach zum Hackover 2017 gefahren und seitdem immer weiter in diese Chaos-Bubble reingeflutscht. Uppsi. ¯\\_(ツ)_/¯",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 249,
                "guid": "8b2e0ac2-3c75-50d3-86bf-f171eb4f1dd9",
                "logo": "",
                "date": "2019-12-27T17:00:00+01:00",
                "start": "17:00",
                "duration": "00:20",
                "room": "Chaos-West Bühne",
                "slug": "EZU78C",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/EZU78C/",
                "title": "Look at ME! - Intel ME Investigation",
                "subtitle": "",
                "track": "All about computers",
                "type": "Einfacher Slot",
                "language": "en",
                "abstract": null,
                "description": "Look at ME! - Intel ME Investigation\r\n\r\nWith Intel's Firmware Support Package (FSP) and the recent release of a\r\n[redistributable firmware binary](https://edk2.groups.io/g/devel/message/50920/eml)\r\nfor the Management Engine, it has become possible to share full firmware images\r\nfor modern x86 platforms and potentially audit the binaries. Yet, reverse\r\nengineering, decompilation and disassembly are still not permitted. However,\r\nthanks to previous research, we can have a closer look at the binary data and\r\ncome to a few conclusions. This talk briefly summarizes the fundamentals of\r\ndeveloping custom and open source firmware, followed by a quick guide through\r\nthe process of analyzing the binaries without actually violating the terms to\r\nunderstand a few bits, and finally poses a statement on the political issues\r\nthat researchers, repair technicians and software developers are facing.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 193,
                    "code": "PECK7V",
                    "public_name": "CyReVolt",
                    "biography": "With backgrounds in IT security and computer science, I work on the web during the day and on open source [firmware/software](https://github.com/orangecms) in my spare time. In addition, I [give talks and trainings](https://metaspora.org), [exchange](https://twitter.com/orangecms) and hang out in hackerspaces.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 255,
                "guid": "b6905252-7db6-5e9a-a2a0-dfc04b2fd6a2",
                "logo": "",
                "date": "2019-12-27T17:30:00+01:00",
                "start": "17:30",
                "duration": "00:20",
                "room": "Chaos-West Bühne",
                "slug": "EARPZB",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/EARPZB/",
                "title": "Emergency VPN: Analyzing mobile network traffic to detect digital threats",
                "subtitle": "",
                "track": "All about computers",
                "type": "Einfacher Slot",
                "language": "en",
                "abstract": null,
                "description": "The access to surveillance technology by governments and other powerful actors has increased in the last decade. Nowadays malicious software is one of the tools to-go when attempting to monitor and surveil victims. In contrast, the target of these attacks, typically journalists, lawyers, and other civil society workers, have very few resources at hand to identify an ongoing infection in their laptops and mobile devices. \r\n\r\n In this presentation we would like to introduce the Emergency VPN, a solution we developed at the Czech Technical University as part of the CivilSphere project. The Emergency VPN is designed to provide a free and high quality security assessment of the network traffic of a mobile device in order to early identify mobile threats that may jeopardize the security of an individual. \r\n\r\n The presentation will cover the design of the Emergency VPN as a free software project, the instructions of how a user can work with it, and some success cases where we could detect different infections on users.\r\n\r\n We expect attendees will leave this session with a more clear overview of what the threat landscape looks like, what are the options for users that suspect their phone is infected, and how the Emergency VPN can help in those cases.\r\n\r\n More information about the Emergency VPN can be found at CivilSphere's website: https://www.civilsphereproject.org",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 209,
                    "code": "NYGFUB",
                    "public_name": "Sebastian Garcia",
                    "biography": "Bitte nachtragen",
                    "answers": []
                  },
                  {
                    "id": 208,
                    "code": "MZ9Y79",
                    "public_name": "Veronica Valeros",
                    "biography": "Bitte nachtragen",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 207,
                "guid": "b1f5ca8d-78ff-5e80-b301-4e8ae0ae6c8b",
                "logo": "",
                "date": "2019-12-27T18:00:00+01:00",
                "start": "18:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "73DECY",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/73DECY/",
                "title": "The challenges of Protected Virtualization",
                "subtitle": "",
                "track": "All about computers",
                "type": "Doppelter Slot",
                "language": "en",
                "abstract": null,
                "description": "Firmware protection for Virtual Machines against buggy or malicious\r\nhypervisors is a rather new concept that is quickly gaining traction\r\namong the major CPU architectures; two years ago AMD introduced Secure Encrypted Virtualization (AMD SEV), and now IBM is introducing Protected Virtualization for the s390x architecture.\r\n\r\nThis talk will present the motivations and the overall architecture of\r\nProtected Virtualization, the general challenges for Linux both as a guest and as a hypervisor with KVM and Qemu.\r\n\r\nThe main challenges presented will be, among others:\r\n* secure VM startup\r\n* attestation\r\n* I/O\r\n* interrupts\r\n* Linux guest support\r\n* KVM and Qemu changes\r\n* swap and migration\r\n\r\nWhile the talk will have some technical content, it should be enjoyable for anyone who tinkers with KVM and virtualization.\r\n\r\nKnowledge of the s390x architecture is not required.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 154,
                    "code": "ML9U7P",
                    "public_name": "Janosch Frank",
                    "biography": null,
                    "answers": []
                  },
                  {
                    "id": 153,
                    "code": "PRQXVR",
                    "public_name": "Claudio Imbrenda",
                    "biography": "Qemu and KVM developer for the s390x architecture; member of Shack.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 221,
                "guid": "1a8d5fce-a813-5272-83d2-8c21a54a6516",
                "logo": "/media/36c3/images/CBGVT9/logo-quadrat-vector.jpg",
                "date": "2019-12-27T19:00:00+01:00",
                "start": "19:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "CBGVT9",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/CBGVT9/",
                "title": "\"Unvorstellbare Einzelfälle\" und \"neue Phänomene\"? - Kontinuitäten des rechten Terrors",
                "subtitle": "",
                "track": "Antifaschimus",
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": null,
                "description": "Christchurch, El Paso, Walter Lübcke, Halle – seit 2019 verbinden wir diese Orte und Namen mit rechtem Terror. Auf jeden Anschlag folgte auch in diesem Jahr eine öffentliche Debatte, in der rechter Terror meist als neues Phänomen erscheint. Je größer jedoch die Häufung der Anschläge, desto absurder erscheinen die Worte von „unvorstellbaren Einzelfällen“, begangen von „verrückten Einzeltätern“. Diese Erzählungen haben einen anderen Zweck, als rechten Terror die Grundlage zu entziehen. Sie sollen sagen: ‚Wir hätten es nicht wissen können, hätten nichts tun können und werden auch zukünftig nichts verhindern‘. \r\n\r\nDabei ist das Gegenteil der Fall: Rechter Terror hat auch nach 1945 nie aufgehört und obwohl an jedem Fall etwas Spezielles ist, so gibt es doch Gemeinsamkeiten und Kontinuitätslinien. Rechtsterroristen und Rechtsterroristinnen wie etwa der NSU oder Anders Breivik kämpften immer mit den Mitteln der Zeit für die Umsetzung ihrer Ziele: Der Umsturz der Gesellschaft durch massive Gewalt, um ihre wahlweise autoritäre, heteronormative, völkische Vision einer Volksgemeinschaft verwirklichen zu können. Aus dieser Geschichte des rechten Terrors und den gesellschaftlichen Reaktionen darauf können wir lernen ihnen etwas entgegenzusetzen.\r\n\r\nCaro Keller von NSU-Watch wird anhand exemplarischer Fälle die wichtigen Kontinuitätslinien herausarbeiten. Vor diesem Hintergrund nimmt sie auch den aktuellen rechten Terror, Phänomene wie toxische Männlichkeit oder „Gamification of Terror“ in den Blick. Es wird aufgezeigt, ob und wie wir als Antifaschist*innen und Gesellschaft dieses Wissen gegen rechten Terror einsetzen können.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 168,
                    "code": "QN3REG",
                    "public_name": "Caro Keller",
                    "biography": "Caro Keller ist seit 2013 Teil des antifaschistischen Bündnisses NSU-Watch, seit Ende 2016 dort auch Redakteurin, verantwortlich u.a. für Website- und Social Media Output sowie den Podcast \"NSU-Watch: Aufklären & Einmischen  -Der Podcast über den NSU-Komplex, rechten Terror und Rassismus\". \r\n\r\nDas bundesweite antifaschistische Bündnis „NSU-Watch: Aufklären und Einmischen” recherchiert Hintergründe und dokumentiert aktuelle Entwicklungen zum NSU-Komplex und rechtem Terror. NSU-Watch begleitet die verschiedenen juristischen und parlamentarischen Aufklärungsbemühungen von rechtem Terror kritisch. Die unabhängige Beobachtungsstelle wurde von antifaschistischen und antirassistischen Projekten aus dem gesamten Bundesgebiet gegründet, die teilweise seit mehr als zwei Jahrzehnten die extreme Rechte beobachten.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 201,
                "guid": "1a12a734-c498-535b-9292-831e529a14c2",
                "logo": "",
                "date": "2019-12-27T21:00:00+01:00",
                "start": "21:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "GZGQK3",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/GZGQK3/",
                "title": "Rosa Listen",
                "subtitle": "",
                "track": "Queer",
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": null,
                "description": "\"Eine Regierung hat auch die Pflicht uns vor zukünftigen Regimen zu schützen.\" Anhand der Rosa Liste möchte ich aufzeigen weshalb das ein wichtiger Grundsatz moderner Demokratien ist.\r\n\r\nIn der Weimarer Republik und der Ersten Republik Österreich wurden Listen angelegt in denen zahlreiche Daten über tatsächliche oder vermeintliche Homosexuelle gesammelt und auf Vorrat gespeichert wurden. In der NS-Diktatur wurden diese Listen genutzt, um eine möglichst große Anzahl Homosexueller in Konzentrationslager (KZ) zu bringen. In diesen bekamen sie den berühmten Rosa Winkel als Kennzeichnung, wodurch sie auch Repressalie von anderen Insassen ausgesetzt waren. Noch heute gilt die Rosa Liste als eines der schlimmsten Beispiele wie auf Vorrat gespeicherte Daten missbraucht werden können.\r\n\r\nAls Datenschützer und Bisexueller möchte ich näher auf diesen besonderen Teil der Geschichte eingehen und aufzeigen was daraus lernen sollten.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 146,
                    "code": "TWFMUJ",
                    "public_name": "Erwin Ernst 'eest9' Steinhammer",
                    "biography": "Erwin Ernst Steinhammer ist netzpolitischer Aktivist und studiert Politikwissenschaft. Er war lange Zeit als Software Consultant tätig und hat sich im Zuge dessen auch mit den gesellschaftlichen Auswirkungen der Automatisierung beschäftigt. Als Verfechter von Grundrechten, insbesondere dem Informationsfreiheitsgesetz, interessierte er sich bald auch für das Staatsschutzgesetz. Als später die Einführung eines Bundestrojaners beschlossen werden sollte, war er einer der Ersten, die im parlamentarischen Begutachtungsverfahren Kritik äußerten. Heute behält er für epicenter.works die netzpolitischen Entwicklungen, im Parlament und in der Regierung, genau im Auge.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 257,
                "guid": "3ea84afe-51cf-5219-b658-79f331cdc381",
                "logo": "",
                "date": "2019-12-27T22:00:00+01:00",
                "start": "22:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "RUCJJQ",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/RUCJJQ/",
                "title": "Storing energy in the 21st centruy",
                "subtitle": "",
                "track": "Nicht Computers",
                "type": "Doppelter Slot",
                "language": "en",
                "abstract": null,
                "description": "The 21st century will be powered by electricity. I'm a journalist in the field of science and technology reporting. I followed the development of electricity storage and generation for over 10 years. In this talk I will outline the current state of electricity storage technology and its limitations. There is a gap between the intermittent availability of electricity generation and demand for it.\r\n\r\nCobalt and Lithium are increasingly limited in supply and their production is often produced using unsustainable means. Alternatives are being development and will be presented. Some of these technologies are in the form of chemical batteries and some use very surprisingly simple technologies.\r\n\r\nI will be giving an introduction into future technologies for electricity storage currently in development. Some of these are batteries without rare materials and others are not batteries at all.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 69,
                    "code": "NHG9JU",
                    "public_name": "Frank Wunderlich-Pfeiffer",
                    "biography": "[Platzhalter - wird später geupdated]\r\n\r\nFrank Wunderlich-Pfeiffer ist Vollzeitnerd und hat 2015 in Golems Wissenschaftsressort seine ersten Erfahrungen im Journalismus gemacht. Nach einem Studium der Physik und des Wirtschaftsingenieurswesens begeistert er sich für Raumfahrt, Technik und Wissenschaft allgemein, außerdem spielt er seit 2008 für die Go-Bundesliga-Mannschaft von Jena.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 200,
                "guid": "63410ac1-263b-5327-9c4b-ba3b0098228c",
                "logo": "",
                "date": "2019-12-27T23:00:00+01:00",
                "start": "23:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "RAFTCU",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/RAFTCU/",
                "title": "Broken Beyond Repair - No Patch for Verfassungsschutz: Qualitative und quantitative Auswertung der Verfassungsschutzberichte mit Schwerpunkt auf den sog. Linksextremismus",
                "subtitle": "",
                "track": "Antifaschimus",
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": null,
                "description": "Der deutsche Inlandsgeheimdienst, bietet seit Jahrzehnten mit seinen Berichten eine interessante Propaganda an, dieser wollen wir in diesem Talk auf den Zahn fühlen. Zudem stellen wir mit [vsberichte.de](https://vsberichte.de)  ein freies Tool vorstellen, womit ihr das in Zukunft auch könnt.\r\n\r\nDie Verfassungsschutzämter veröffentlichen jährliche Berichte über ihre Arbeit. Die Berichte entzogen sich bisher durch ihre Depublikation (zumeist nach 5 Jahren) einer Einordnung durch die Öffentlichkeit.\r\nWir sammeln die Berichte auf Verfassungschutzberichte.de und bieten dort ein Recherchewerkzeug an.\r\nErwähnungen können mit diesem Werkzeug im historischen Verlauf verglichen werden, so kann zum Beispiel die Einordnung der RAF durch den Verfassungsschutz mit der des NSU verglichen werden.\r\nZur Einordnung der (Un)Sinnhaftigkeit der Berichte wird im qualitativen Teil mit Zitaten gearbeitet. Demonstrieren lässt sich das etwa an der Erwähnung von #Unteilbar im Bericht von Sachsen-Anhalt oder #Wirsindmehr im sächsischen Bericht von 2018.\r\nDieser Talk soll helfen die Berichte einzuordnen, um einen kritischen Umgang mit dem Geheimdienst zu ermöglichen. \r\nDie Aufarbeitung der Berichte wird die Schwächen dieses Inlandsgeheimdienstes anhand ihrer eigenen Publikationen vor Augen führen.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 157,
                    "code": "EZVYCT",
                    "public_name": "Andreas",
                    "biography": "Antifaschist-Aktivist-Data Science",
                    "answers": []
                  },
                  {
                    "id": 145,
                    "code": "FD3B7J",
                    "public_name": "Johannes Filter",
                    "biography": "Johannes Filter is a freelance software developer and an activist for freedom of information, civic tech and open data. He studied computer science at the Hasso Plattner Institute in Potsdam, Germany and during this time he also lived abroad in Tallinn, Estonia and Madrid, Spain. He is active in various projects of the Open Knowledge Foundation Germany (FragDenStaat, OffeneGesetze and CodeForGermany) to increase government transparency and empower citizens.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 195,
                "guid": "be956120-b271-54de-85fe-79dbf7db5fc2",
                "logo": "",
                "date": "2019-12-28T00:00:00+01:00",
                "start": "00:00",
                "duration": "02:00",
                "room": "Chaos-West Bühne",
                "slug": "7CPYCT",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/7CPYCT/",
                "title": "Doktor Ogen presents Deep Space Night",
                "subtitle": "",
                "track": "Klangteppich",
                "type": "Klangteppich",
                "language": "de",
                "abstract": null,
                "description": "Feinster Deep House und wunderschöne visuelle Impressionen aus dem Weltraum laden ein zum grooven, chillen oder sich einfach mal inspirieren zu lassen. Eine Hommage an die Sendung \"Space Night\" des Bayerischen Rundfunks,   gebeamt in die heutige Zeit was die Optik und den Sound betrifft !",
                "recording_license": "",
                "do_not_record": true,
                "persons": [
                  {
                    "id": 140,
                    "code": "M7CH3M",
                    "public_name": "Stecki",
                    "biography": "Verrückte Mongo !",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 205,
                "guid": "894cdfb2-9cfe-563c-82d7-789675d53b4a",
                "logo": "/media/36c3/images/JZACMR/legoController.jpg",
                "date": "2019-12-28T02:00:00+01:00",
                "start": "02:00",
                "duration": "02:00",
                "room": "Chaos-West Bühne",
                "slug": "JZACMR",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/JZACMR/",
                "title": "Dubtechno / Techno / Ambient / Lego DJ-Set",
                "subtitle": "",
                "track": "Klangteppich",
                "type": "Klangteppich",
                "language": "de",
                "abstract": null,
                "description": "",
                "recording_license": "",
                "do_not_record": true,
                "persons": [
                  {
                    "id": 149,
                    "code": "TMHFCF",
                    "public_name": "petrosilius",
                    "biography": "working on searchwing topic since 2 years",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              }
            ],
            "Workshop": [
              {
                "id": 367,
                "guid": "81f5f0c4-3d35-522c-8f1c-c8825b92f00a",
                "logo": "",
                "date": "2019-12-27T16:10:00+01:00",
                "start": "16:10",
                "duration": "02:00",
                "room": "Workshop",
                "slug": "SRMX8W",
                "url": "https://talks.oio.social/36c3-oio/talk/SRMX8W/",
                "title": "Beginners Workshop: How to Hack your Web Application",
                "subtitle": "",
                "track": null,
                "type": "Workshop 2 hours",
                "language": "en",
                "abstract": "Did you ever want to know how hacking works? This beginners workshops gives an introduction into vulnerabilities, application pen testing and the security of web applications. Only if you know how hackers attack your application, you will be able to defend yourself. Nearly all companies use web applications nowadays. Any vulnerability in those applications may be an invitation for hackers to attack it. This workshop will give you insights on those things that you should never neglect when programming your application. From Techie to Techie!\r\n\r\nRequirements: programming experience & laptop needed, security knowledge is not necessary",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 136,
                    "code": "ZWHJ7T",
                    "public_name": "Janosch Maier",
                    "biography": "Janosch Maier holds a computer science master degree and a pedagogy bachelor degree. He worked in several start-ups and developed a cyber security dashboard for the Dutch ministry of justice. After his studies, he founded the Crashtest Security GmbH where he develops a vulnerability scanner for web application.  Janosch is giving regular talks and workshops to promote IT security in agile software development for SMEs and corporates.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 342,
                "guid": "d979082b-5377-513a-a84b-c3f0bb3f85e2",
                "logo": "/media/36c3-oio/images/NTFYAL/nachbar-und-meshnetz_DRZyVof.gif",
                "date": "2019-12-27T18:35:00+01:00",
                "start": "18:35",
                "duration": "04:00",
                "room": "Workshop",
                "slug": "NTFYAL",
                "url": "https://talks.oio.social/36c3-oio/talk/NTFYAL/",
                "title": "Alpha Testing of qaul.net (Internet independent wifi mesh communication App)",
                "subtitle": "",
                "track": null,
                "type": "Workshop 4 hours",
                "language": "en",
                "abstract": "Test with us our new alpha version of the",
                "description": "qaul.net is an Internet independent wifi mesh communication app with fully decentralized messaging, file sharing and voice chat. At the moment we are rewriting the entire application in rust, implementing our experience of 8 years off the grid peer2peer mesh communication, with a mobile first approach and a network agnostic routing protocoll wich can do synchronous as well as delay tolerant messaging.\r\n\r\nIn this workshop we will test the (pre-)alpha version together, install it, test the functionality and communicate off the grid. We will explore our new routing protocol and the wireless interconnection possibilities.\r\n\r\n* Homepage: https://qaul.net\r\n* Code Repository: https://git.open-communication.net/qaul/qaul.net",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 120,
                    "code": "G78ZPE",
                    "public_name": "Mathias Jud",
                    "biography": "Mathias Jud is a berlin based artist. Since over twenty years, he works together with Christoph Wachter.\r\nTheir art works include open-source projects that uncover forms of censorship of the Internet, undermine the concentration of political power and even resolve the dependency on infrastructure.\r\n\r\nhttps://www.wachter-jud.net/",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              }
            ]
          }
        },
        {
          "index": 3,
          "date": "2019-12-28",
          "day_start": "2019-12-28T06:00:00+01:00",
          "day_end": "2019-12-29T04:00:00+01:00",
          "rooms": {
            "Lecture room 11": [],
            "Seminar room 14-15": [],
            "Seminar room 13": [],
            "Lecture room M1": [],
            "Lecture room M2": [],
            "Lecture room M3": [],
            "Kidspace": [],
            "CCL Saal 3": [],
            "Chaos West Bühne": [],
            "ChaosZone": [],
            "OIO Stage": [
              {
                "id": 371,
                "guid": "2b1e7aea-237f-533a-8e7b-022a81ba81dc",
                "logo": "",
                "date": "2019-12-28T12:00:00+01:00",
                "start": "12:00",
                "duration": "00:25",
                "room": "OIO Stage",
                "slug": "E77J8R",
                "url": "https://talks.oio.social/36c3-oio/talk/E77J8R/",
                "title": "Ubuntu Touch & Co - GNU/Linux in der Hosentasche",
                "subtitle": "",
                "track": null,
                "type": "Talk 20 minutes + 5 minutes Q&A",
                "language": "de",
                "abstract": "Der Markt für Mobilgeräte wird dominiert von Android und der Anteil freier Komponenten wird merklich kleiner. Einige Projekte versuchen das zu ändern und bringen GNU/Linux auf Handies und Tablets zu bringen. Wir schauen uns verschiedene solche Projekte an und sprechen über die Notwendigkeit, den aktuellen Stand und die Zukunftsaussichten von GNU/Linux auf Mobilgeräten. Am Beispiel von Ubuntu Touch gehen wir auf besondere Herausforderungen ein.",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 137,
                    "code": "PCJYPA",
                    "public_name": "segal",
                    "biography": "Ich reiche Vorträge für about:freedom hier ein.",
                    "answers": []
                  },
                  {
                    "id": 145,
                    "code": "ESUXA7",
                    "public_name": "Jan Sprinz",
                    "biography": null,
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 374,
                "guid": "2264aaad-2df6-545f-918c-cc5caea4e507",
                "logo": "",
                "date": "2019-12-28T12:40:00+01:00",
                "start": "12:40",
                "duration": "00:55",
                "room": "OIO Stage",
                "slug": "3JU7Y9",
                "url": "https://talks.oio.social/36c3-oio/talk/3JU7Y9/",
                "title": "Building Nextcloud Flow",
                "subtitle": "",
                "track": null,
                "type": "Talk 45 minutes + 10 minutes Q&A",
                "language": "en",
                "abstract": "Nextcloud Flow is the overhauled workflow engine in upcoming Nextcloud 18. This talk describes how it evolved, how it works internally, and especially how own components can be built, so you can set up automatized tasks  in your Nextcloud.",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 138,
                    "code": "KYJPPS",
                    "public_name": "Blizzz",
                    "biography": "I am a father and Nextcloud developer.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 359,
                "guid": "98591fc6-852a-5251-bba5-12436614c1f3",
                "logo": "/media/36c3-oio/images/BJQTYA/avatar1_cqxI94G.png",
                "date": "2019-12-28T13:45:00+01:00",
                "start": "13:45",
                "duration": "00:25",
                "room": "OIO Stage",
                "slug": "BJQTYA",
                "url": "https://talks.oio.social/36c3-oio/talk/BJQTYA/",
                "title": "Exploring and empowering participatory culture communities with the use of online ethnography platform",
                "subtitle": "",
                "track": null,
                "type": "Talk 20 minutes + 5 minutes Q&A",
                "language": "en",
                "abstract": "We explore the potential of scalable online ethnography to study the rapidly growing phenomenon of participatory culture communities and discuss the potential benefits and challenges of using an online platform in hacker communities. The presentation shares views, with a demo, on how to build participatory online communities from a pilot that focused on the global Burning Man community.",
                "description": "The talk is grounded on the collaboration of two high-impact research projects, Burning Stories and Edgeryders. Firstly the aim of Burning Stories, by combining science and arts, is to study the global Burning Man community and seek to explain the processes through which community membership of Burning Man participants evolves across time and space, and how this, in turn, affects the society. By combining the Burning Stories research project with an online ethnography tool from Edgeryders, who use it for multiple Horizon 2020 funded project, the talk aims to present novel ways of disrupting the traditional ways of conducting ethnography in order to understand the emergence of a new cultural phenomenon and apply new, participatory methodology, in order to advance social sciences and community building. The presentation particularly focuses on lessons learnt from these two research projects and with the combination of the projects, explores the potential future use of the co-creative templates for hacker communities.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 131,
                    "code": "9LVDDR",
                    "public_name": "Jukka-Pekka Heikkilä",
                    "biography": "A scholar, co-creator, culture hacker and entrepreneurship educator specialized in extreme settings.\r\n\r\nJukka-Pekka has taught entrepreneurship courses and organized startup and science diplomacy events in Pyongyang between 2012 - 2017. He is a co-founder of WTSUP! Beirut aims to foster equality and volunteerism culture in the Middle East and a founder of Burning Stories research project that aims to study the transformation of Burning Man participants and its impact on society. From academic affiliations, Jukka-Pekka is a Newton Fellow of the Royal Society (UK) and British Academy, an Academy of Finland post-doctoral Fellow based in Aalto University, Finland, and a visiting scholar at Stanford University. In Finland, he works as a board member with The Shortcut, a sister organisation of Slush and an initiative that aims to integrate immigrants to the Finnish society via tech entrepreneurship education.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 368,
                "guid": "83e0c501-6a60-555f-80af-36b22a440fd4",
                "logo": "",
                "date": "2019-12-28T14:30:00+01:00",
                "start": "14:30",
                "duration": "00:55",
                "room": "OIO Stage",
                "slug": "EW8MBQ",
                "url": "https://talks.oio.social/36c3-oio/talk/EW8MBQ/",
                "title": "NPR70 - \"WLAN\" auf 430MHz",
                "subtitle": "",
                "track": null,
                "type": "Talk 45 minutes + 10 minutes Q&A",
                "language": "de",
                "abstract": "Da A.25 mit 9k6 baud irgend wann einfach nicht mehr cool ist um Daten auf 430 Mhz zu übertragen, musste ein neues Protokoll mit passender Hardware her. Herausgekommen ist ein open source Projekt von F4HDK mit 500kbit/s nutzdaten, multiuser und schnellen Rundlaufzeiten.",
                "description": "Nachdem das nötige Hintergrundswissen zu dem Thema Drahtlose Übertragungsprotokolle vermittelt wurde. Wird das Protokoll und die dazugehörende Hardware ausführlich vorgestellt und mit alternativen wie z.B. LORA verglichen.\r\nAußerdem soll rund um den OIO im laufe des Kongresses ein Demo-Netzwerk aufgebaut werden hierfür können auch noch Kits vorort gelötet werden, meldet euch dafür einfach bei mir.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 135,
                    "code": "YXFCTE",
                    "public_name": "Lars Rokita",
                    "biography": "Physics student who likes to tinker around with high frequency stuff. Call DL4APT",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 366,
                "guid": "cface55d-a792-55e0-9eda-d2e4a72b43fb",
                "logo": "",
                "date": "2019-12-28T16:10:00+01:00",
                "start": "16:10",
                "duration": "00:25",
                "room": "OIO Stage",
                "slug": "G3LD3P",
                "url": "https://talks.oio.social/36c3-oio/talk/G3LD3P/",
                "title": "FF-ESP32-OpenMPPT - New Freifunk-ISEMS-MPPT-Solar-Controller with integrated WiFi",
                "subtitle": "",
                "track": null,
                "type": "Talk 20 minutes + 5 minutes Q&A",
                "language": "en",
                "abstract": "The Independent Solar Mesh System has a new hardware that will bring the power consumption, space and cost requirements of low cost WiFi relay stations down: FF-ESP32-.OpenMPPT",
                "description": "In order to build the cheapest energy autonomous WiFi relay possible, we have designed an update to the previous Freifunk-Open-MPPT-Solarcontroller. It has now integrated WiFi and Bluetooth, so it doesn't need an external WiFi router anymore, but you can still connect one. Technical data is preliminary at the moment, but power consumption will be between ~0.3 at low load and ~0.6 Watt at maximum load. So a 20 Watt Solar panel and a 12V 7Ah battery will be more than enough to keep the system running and relaying traffic all year.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 57,
                    "code": "HZ9WHF",
                    "public_name": "Elektra Wagenrad",
                    "biography": "FF-Activist since 2003.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 373,
                "guid": "d84a392d-0680-584c-8a35-358977418a13",
                "logo": "",
                "date": "2019-12-28T16:45:00+01:00",
                "start": "16:45",
                "duration": "00:25",
                "room": "OIO Stage",
                "slug": "A8GQTE",
                "url": "https://talks.oio.social/36c3-oio/talk/A8GQTE/",
                "title": "“Computer says no”: Worüber sollen Algorithmen entscheiden dürfen",
                "subtitle": "",
                "track": null,
                "type": "Talk 20 minutes + 5 minutes Q&A",
                "language": "de",
                "abstract": "Richtlinien für den ethischen Einsatz von Algorithmen gibt es langsam wirklich genug. Konzerne und Organisationen    übertrumpfen sich geradezu damit zu betonen, dass der Mensch bei allen maschinellen Entscheidungen im Mittelpunkt stehen soll, dass die Systeme fair und nachvollziehbar arbeiten müssen. Aber egal, ob sie nun direkt von Google und IBM stammen, von Normungsorganisationen wie IEEE oder der OECD – gemeinsam ist all diesen Richtlinien: Sie sind rechtlich nicht bindend. Die Frage ist also: Wem dienen solche Ansätze der unternehmerischen und    staatlichen Selbstregulierung? Und wollen wir uns auf sie verlassen oder brauchen wir klare gesetzliche Auflagen? Welche Regeln sollten für Unternehmen gelten, welche für den Staat? Und wer soll darüber wachen, dass sie eingehalten werden?",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 137,
                    "code": "PCJYPA",
                    "public_name": "segal",
                    "biography": "Ich reiche Vorträge für about:freedom hier ein.",
                    "answers": []
                  },
                  {
                    "id": 142,
                    "code": "AWJ9RX",
                    "public_name": "Chris Köver",
                    "biography": ".",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 382,
                "guid": "35cda8cc-6647-5a55-b87f-2e65057ef9e5",
                "logo": "",
                "date": "2019-12-28T17:15:00+01:00",
                "start": "17:15",
                "duration": "00:55",
                "room": "OIO Stage",
                "slug": "P9BACD",
                "url": "https://talks.oio.social/36c3-oio/talk/P9BACD/",
                "title": "Freifunk Super Node und Firmware Build Server aufsetzen und Provider werden",
                "subtitle": "",
                "track": null,
                "type": "Talk 45 minutes + 10 minutes Q&A",
                "language": "de",
                "abstract": "Ein howto für Dummis, Freifunk Infrastruktur selber zu betreiben.",
                "description": "Es ist gut, wenn viele Menschen Freifunk Router einrichten können. Doch es ist besser, wenn auch Leute selber einen Super Node betreiben können. Es gibt viele Wege, dies umzusetzen. Ich möchte zeigen, wie ich in letzter Zeit es umgesetzt habe mit mittleren Kenntnissen. Und es wird gezeigt, wie man Provider werden kann.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 42,
                    "code": "JGBAWZ",
                    "public_name": "Matthias Schmidt",
                    "biography": "1996 mit 16 Jahren habe ich erste Netzwerk Erfahrungen gesammelt, ab dem Jahr 2000 bin ich im Internet. Seit 2014 mache ich bei Freifunk Düren und Aachen mit. Ich bin Mitglied beim Freifunk Rheinland e.V. und Fördervereinigung freier Netzwerke in der Region Aachen e.V., beim F3N bin ich Beisitzer. Seit wenigen Monaten betreibe ich einen eigenen Super Node auf einer Test Infrasruktur. Bei der Bundesnetzagentur bin ich als \"datendurchleitend\" deklariert. Der nächste Schritt möge sein, von einem LIR einen IP Block zu bekommen.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 360,
                "guid": "9ca25e43-bcd8-541c-b79c-bfb6db1c2789",
                "logo": "/media/36c3-oio/images/8D7DBP/logos_to_replace_78tfwYe.png",
                "date": "2019-12-28T18:15:00+01:00",
                "start": "18:15",
                "duration": "00:25",
                "room": "OIO Stage",
                "slug": "8D7DBP",
                "url": "https://talks.oio.social/36c3-oio/talk/8D7DBP/",
                "title": "A dozen more things you didn't know Nextcloud could do",
                "subtitle": "",
                "track": null,
                "type": "Talk 20 minutes + 5 minutes Q&A",
                "language": "en",
                "abstract": "With Nextcloud you can sync, share and collaborate on data, but you don't need to put your photos, calendars or chat logs on an American server. Nope, Nextcloud is self-hosted and 100% open source! Thanks to hundreds of apps, Nextcloud can do a lot and in this talk, I will highlight some cool things.",
                "description": "Consider this a follow-up from my talk about 200 things Nextcloud can do last year! An update on what's new and some cool new stuff. What, what is `Nextcloud`? Let's see. A private cloud is one way to put it, though that's a contradiction of course. It is a way to share your data, sync your files, communicate and collaborate with others - without giving your data to GAFAM! Keep it on your own server, or something close (like a local hosting provider or data center). Nextcloud is a PHP app that does all that, and more! Easy to use, secure (really) and fully open source of course.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 59,
                    "code": "KMKHUZ",
                    "public_name": "Jos Poortvliet",
                    "biography": "People person, technology enthusiast and all-things-open evangelist. Head of marketing at Nextcloud, previously Community Manager at ownCloud and SUSE, recovering business consultant with decade long involvement in the KDE community. Enjoys avoiding traffic and public transport on bike through Berlin, but only when the weather is good. Loves cooking for friends and family and playing with the dog.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 369,
                "guid": "aa7b077e-6de3-5bbf-aefd-1e6da636adbf",
                "logo": "",
                "date": "2019-12-28T20:50:00+01:00",
                "start": "20:50",
                "duration": "00:25",
                "room": "OIO Stage",
                "slug": "LU3JNL",
                "url": "https://talks.oio.social/36c3-oio/talk/LU3JNL/",
                "title": "Extending the lifetime of smartphones with Replicant, a fully free Android distribution",
                "subtitle": "",
                "track": null,
                "type": "Talk 20 minutes + 5 minutes Q&A",
                "language": "en",
                "abstract": "After a very quick introduction on Replicant and the smartphones ecosystem, we will look at what affects smartphones' and tablets' lifetime and how to increase it by making Replicant more sustainable.",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 137,
                    "code": "PCJYPA",
                    "public_name": "segal",
                    "biography": "Ich reiche Vorträge für about:freedom hier ein.",
                    "answers": []
                  },
                  {
                    "id": 143,
                    "code": "VLPGUU",
                    "public_name": "Denis 'GNUtoo' Carikli",
                    "biography": null,
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 362,
                "guid": "4b6379f9-a6d9-5c3e-8af9-a9c1b1c04e95",
                "logo": "/media/36c3-oio/images/GUZH7V/logo_GGS6DxK.png",
                "date": "2019-12-28T21:20:00+01:00",
                "start": "21:20",
                "duration": "00:55",
                "room": "OIO Stage",
                "slug": "GUZH7V",
                "url": "https://talks.oio.social/36c3-oio/talk/GUZH7V/",
                "title": "CloudCalypse 2: Social network with net2o [YBTI/wefixthenet session]",
                "subtitle": "",
                "track": null,
                "type": "Talk 45 minutes + 10 minutes Q&A",
                "language": "en",
                "abstract": "Building a social network on top of net2o, and importing your existing data",
                "description": "I've a dream: A peer-to-peer network, where services like search engines or social networks aren't offered by big companies, who in turn need to make money by selling the privacy of their users. Where all data is encrypted, so that access is only possible for people who have the key and really are authorized. Which layman can use without cryptic user interfaces. Where the browser is a platform for running useful applications without the mess of Flash and JavaScript. Without the lag of “buffer bloat” and without the speed problems of a protocol not designed to be assisted by hardware.\r\n\r\nThis dream is coming to reality: This talk will show how far I got, and what challenges still are ahead. The talk is in three parts:\r\n\r\n1. a short overview over net2o\r\n2. a demonstration of how the social network stuff looks like\r\n3. and an outlook over what needs to be done to make it a polished product",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 128,
                    "code": "MCE83P",
                    "public_name": "dvn",
                    "biography": "p2p communications and privacy researcher and developer\r\n\r\nCurrently organizing a \"youbroketheinternet/wefixthenet\" session at 36c3, representing GNUnet.",
                    "answers": []
                  },
                  {
                    "id": 132,
                    "code": "SP93BA",
                    "public_name": "Bernd Paysan",
                    "biography": "I'm the GNU Forth maintainer and the principal developer of net2o, a complete alternative network stack that runs as overlay on UDP.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 383,
                "guid": "18ce862e-36e1-5df6-803b-38f82b2ef327",
                "logo": "",
                "date": "2019-12-28T22:25:00+01:00",
                "start": "22:25",
                "duration": "00:25",
                "room": "OIO Stage",
                "slug": "L7MBH8",
                "url": "https://talks.oio.social/36c3-oio/talk/L7MBH8/",
                "title": "WiFi-Hostpot-Abos - Wie viel Freifunk steckt drin?",
                "subtitle": "",
                "track": null,
                "type": "Talk 20 minutes + 5 minutes Q&A",
                "language": "de",
                "abstract": "Im Internet offerieren diverse Anbieter WiFi Hardware inklusive VPN für 10€.\r\n\r\nDieser Talk behandelt, wie sehr sich die verkaufte Hardware sowie Software von den meisten Freifunk Setups unterscheidet.",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 140,
                    "code": "DGCAVP",
                    "public_name": "blocktrron",
                    "biography": "Working on Freifunk / Gluon / OpenWrt.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              }
            ],
            "Chaos-West Bühne": [
              {
                "id": 198,
                "guid": "04a2ab95-c74a-58d7-93ac-e65046a56866",
                "logo": "",
                "date": "2019-12-28T11:00:00+01:00",
                "start": "11:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "AQSTLX",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/AQSTLX/",
                "title": "A Hacker's Guide to Healthcare: How to Improve Lives with Data",
                "subtitle": "",
                "track": "Nicht Computers",
                "type": "Doppelter Slot",
                "language": "en",
                "abstract": null,
                "description": "Health related personal data is highly sensitive -- and yet it promises an outright methodology shift for the surprisingly conservative healthcare system. This talk provides an overview of beneficial uses of health data, and formulates ways to get involved to make sure the benefits are reaped in a conscientious manner.\r\n\r\nHealthcare is rapidly becoming digital: security and data privacy call for active participation. But so do questions of quantified fairness and certification of digital medical devices. Hackers can play a crucial part to ensure this benefits patients and citizens, by championing data transparency and standards of evidence. My talk will outline ways to get creative with data beyond scrutinizing governments on information security.\r\n\r\nFor the past year I worked for the German Ministry of Health's in-house think tank (hih) as an advisor on artificial intelligence. I will present my personal views, not those of the Federal Government.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 143,
                    "code": "XQLGNP",
                    "public_name": "Lars Roemheld",
                    "biography": "Lars Roemheld is Director of AI & Data at the health innovation hub, the German Ministry of Health’s own thinktank. He previously held senior positions at the AI specialist QuantCo, where he used machine learning to develop anti-fraud and pricing solutions for financial, retail, and healthcare organizations in the US and Europe. A Data Scientist and Philosopher, he holds degrees from Stanford University and University of Heidelberg.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 178,
                "guid": "059f517a-6650-5cd5-82df-ece4f7b0adae",
                "logo": "",
                "date": "2019-12-28T12:00:00+01:00",
                "start": "12:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "EMK8WQ",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/EMK8WQ/",
                "title": "NOTH1NG T0 HID3: go out and fix privacy!",
                "subtitle": "",
                "track": "Nicht Computers",
                "type": "Doppelter Slot",
                "language": "en",
                "abstract": null,
                "description": "After the highly-successful presentation \"Toll of personal privacy in 2018\" at Chaos-West 35C3 where I talked about my personal experiences with trying to protect my privacy, this year I return with a completely* different talk that tries to convince the audience — you should care about privacy too!\r\n\r\nThis talk revisits the theme of personal privacy in the digital world, this time centring around the \"I've got nothing to hide\" argument. A beam of intensive light is shed upon the motivation behind caring about one's privacy. We go in depth into what we can do to stay private and should we even try to do it at all. We talk about where we as an global society were able to fix privacy and where we have failed. New topics previously not covered are discussed, such as herd immunity and certification programs.\r\n\r\n\\* 97%+",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 44,
                    "code": "8N8CRM",
                    "public_name": "Kirils Solovjovs",
                    "biography": "Kirils Solovjovs is Lead Researcher at Possible Security, bug bounty hunter, IT policy activist, and the most visible white-hat hacker in Latvia having discovered and responsibly disclosed or reported multiple security vulnerabilities in information systems of both national and international significance. Kirils has developed the jailbreak tool for Mikrotik RouterOS. He has extensive experience in social engineering, penetration testing, network flow analysis, reverse engineering, and the legal dimension.\r\n\r\nHe has spoken at many amazing conferences including Hack In The Box, Hack in Paris, Hackfest, Nullcon, SHA2017, 35C3 Chaos-West, CONFidence, BalCCon, and TyphoonCon.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 239,
                "guid": "669e8ad4-d0a0-501d-aebd-c1a8c8423291",
                "logo": "",
                "date": "2019-12-28T13:00:00+01:00",
                "start": "13:00",
                "duration": "00:20",
                "room": "Chaos-West Bühne",
                "slug": "D9BFMN",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/D9BFMN/",
                "title": "System Transparency",
                "subtitle": "",
                "track": "All about computers",
                "type": "Einfacher Slot",
                "language": "en",
                "abstract": null,
                "description": "The ever increasing usage of cloud-based software forces us to face old questions about the trustworthiness of our software. While FLOSS allows us to trust software running on our platforms, System Transparency establishes the same level of trust in SaaS and IaaS scenarios.\r\n\r\nIn a System Transparency context, all parties that depend on the services of a particular server can retrieve the complete source code of firmware and OS running on it. They can reproduce all binaries and verify remotely that these were run as part of the boot process. This gives every user the ability to verify claims of the service provider like the absence of logs or lack of backdoor access.\r\n\r\nSystem Transparency accomplishes this by \r\n - giving every server a unique, cryptographic identity that is kept in a hardware trust anchor,\r\n - using a provisioning ritual to associate this identity with a particular hardware,\r\n - running the FLOSS firmwares coreboot and LinuxBoot instead of proprietary UEFI implementations,\r\n - building firmware and OS images are reproducible,\r\n - retrieving all OS images from the network, keeping only minimal state on the disk,\r\n - signing all OS images as well as listing them in a public append-only log and\r\n - minimizing administrator access to prevent invisible changes to the OS after it has been booted.\r\n\r\nThis talk introduces System Transparency and details the platform security features we implemented as part of our reference system. We also describe our reference implementations’ custom bootloader based on LinuxBoot. It verifies that boot artifacts are signed by the server owner and are in the transparency log before continuing. This makes sure that 3rd parties can audit past and present artifacts booted on the platform. Finally, we demo a modern x86 server platform running our prototype coreboot/LinuxBoot stack.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 184,
                    "code": "EVKLMA",
                    "public_name": "seu",
                    "biography": "Kai is a Hacker from Bochum",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 217,
                "guid": "8fb9096f-bcb7-5d8b-833c-4a275bee17b3",
                "logo": "",
                "date": "2019-12-28T13:30:00+01:00",
                "start": "13:30",
                "duration": "00:20",
                "room": "Chaos-West Bühne",
                "slug": "XEUGGK",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/XEUGGK/",
                "title": "Don't trust your vendors - $ecurity can't be bought",
                "subtitle": "",
                "track": "All about computers",
                "type": "Einfacher Slot",
                "language": "en",
                "abstract": null,
                "description": "The comprehensive, seamless, real-time, IoT capable, AI Intelligence Next-Gen Sandbox Platform Cyber Security Solution with Blockchain, Big Data and Deep learning. Nowadays tons of security buzzwords like these are used to sell products into corporate environments. \r\n\r\nAll this technologies have something in common: They probably cost a fortune and unfortunately often ending up as \"shelfware\". Or nobody is understanding them anymore. Resulting in high expenses, but no improvement of security because of misconfiguration or lack of interest.\r\n\r\nThis is not a talk against security solution vendors - It is talk about promoting to keep an eye on the fundamentals. Ideas and hints provided here are not only the base layer of defense, but also low-cost, low-technology and heck effective against the majority of threats. The talk is not about security management, but will include suggestion how to organize a security team.\r\n\r\nThis is a foundation talk for the many of our ordinary companies running Active Directory/Windows and mostly on-prem infrastructure. The ones which security requirements are not military or high-technology. And it is exactly these companies which are often victims of shotgun approach attacks. It is a talk for SMEs and for companies who simply want to improve their security defense, do their fundamentals and not break the bank for it. \r\n\r\nCut the bullshit bingo, let's start improving security defense in an ordinary company. Low-cost, low-technology and heck effective against the majority of threats.\r\nThis is a security defense & security foundation talk.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 164,
                    "code": "PRY8UC",
                    "public_name": "marides",
                    "biography": "Since Camp 2007 I regularly take part in CCC events. I am a trained security engineer, currently managing a corporate IT environment. As a member of Toastmasters Vienna - a club promoting communication and public speaking skills - I highly value opportunities combing my professional knowledge and my passion for public speaking.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 245,
                "guid": "1416acfc-d57c-5e6a-b2a4-958bc28154ff",
                "logo": "",
                "date": "2019-12-28T14:00:00+01:00",
                "start": "14:00",
                "duration": "00:20",
                "room": "Chaos-West Bühne",
                "slug": "AWGLR9",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/AWGLR9/",
                "title": "Oh no, not I, I will survive!  - Wie man eine Jahresabschluss-/Revisions/Zertifikats-/(...-)Prüfung überlebt",
                "subtitle": "",
                "track": "The real basic about Bits and Nibbles",
                "type": "Einfacher Slot",
                "language": "de",
                "abstract": null,
                "description": "Früher oder später kommen viele in die Situation, dass ihre Arbeitsergebnisse geprüft werden. Sei es von der Compliance, der internen Revision, im Rahmen der Jahresabschlussprüfung oder aufgrund einer ISO 27001 Zertifizierung. Dennoch ist einmal immer das erste Mal – und auch mit der Zeit kann so eine Situation unangenehm sein, wenn man z.B. nicht genau weiß was einen erwartet, welche Informationen benötigt werden oder worauf das Gegenüber achtet.\r\n\r\nIch möchte euch einen kleinen Einblick geben, wie eine Prüfung üblicherweise abläuft, welche Fragen-Arten auftauchen können und was Mensch tun kann, um darauf vorbereitet zu sein. Dies ist ein Einführungs-Talk für Anfänger*innen, ihr müsst also weder in so einer Situation gewesen sein, noch wissen was die Inhalte des ISO 27001 sind.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 59,
                    "code": "9ASTVV",
                    "public_name": "Diula",
                    "biography": "Irgendwo unterwegs zwischen Informationssicherheit, IT-Risikomanagement, Banken und der Chaoswelt. Fragt gerne \"kann das kaputt gehen?\", hat ein Hörnchen und ist Member des Chaosdorf <3 .",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 224,
                "guid": "df22758d-4c2a-59e7-b4fb-c4309e176f63",
                "logo": "",
                "date": "2019-12-28T14:30:00+01:00",
                "start": "14:30",
                "duration": "00:20",
                "room": "Chaos-West Bühne",
                "slug": "ANUQNX",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/ANUQNX/",
                "title": "Fundamentals of EEG based Brain-Computer Interfaces",
                "subtitle": "",
                "track": "All about computers",
                "type": "Einfacher Slot",
                "language": "en",
                "abstract": null,
                "description": "The availability of consumer grade EEG headsets and open EEG hardware platforms makes it easier for everyone to develop a Brain-Computer Interface (BCI).  \r\nThe talk will explain the basics of Electroencephalography (EEG) and how information can be extracted from the Electroencephalogram, which is basically a noise signal. This covers Event Related Potentials (ERP) and their application in common BCI paradigms and biometric schemes. Standard approaches for the experimental setup and for EEG signal processing will be discussed. \r\nAs an example an EEG based authentication system will be presented that uses the P300 component of the ERP and images as a password. \r\nThis talk will give an overview of the issues of performance, usability, privacy and security in BCIs and how far the technology is from reading the mind or connecting us to the matrix.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 170,
                    "code": "9ZEZHA",
                    "public_name": "gnoedi",
                    "biography": "After always being into cyberpunk and being fascinated by the human brain, actually doing research on Brain-Computer Interfaces and Security.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 243,
                "guid": "0827f402-aba2-519d-bf62-d54be7d7ea05",
                "logo": "",
                "date": "2019-12-28T16:00:00+01:00",
                "start": "16:00",
                "duration": "00:20",
                "room": "Chaos-West Bühne",
                "slug": "NN8XZY",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/NN8XZY/",
                "title": "\"Hello, I'm your Edge Case!\" or \"No, seriously! How do you ask people for their gender on the internet?!\"",
                "subtitle": "",
                "track": "Queer",
                "type": "Einfacher Slot",
                "language": "en",
                "abstract": null,
                "description": "In an increasingly digital age, input forms for personal data (like name, gender, sexuality, and more), while sometimes necessary, are also increasingly becoming a barrier to entry. Especially for bodies and experiences that do not fit an arbitrary norm the designer might have had in mind. \r\n\r\nWhether you are traveling abroad, signing up with a health care provider, filling out a scientific study or ordering food, these forms not only factor into your experience but can even make or break the whole endeavour.\r\n\r\nThis talk will feature some of the most glaring fails in input form design, discussion about what exactly went wrong and some ideas on how it could be improved to be more accurate and inclusive, both in the particular as well as the general.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 187,
                    "code": "LFDE8N",
                    "public_name": "lambdaTotoro",
                    "biography": "Queer-ish λPunk enby CS PhD student.\r\nSometimes anti-social, but always anti-fascist!\r\nFancies Haskell, fan of sloths, sharks and pigeons!",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 215,
                "guid": "53015074-4e23-5385-8857-0b6613990693",
                "logo": "",
                "date": "2019-12-28T16:30:00+01:00",
                "start": "16:30",
                "duration": "00:20",
                "room": "Chaos-West Bühne",
                "slug": "M8NMW7",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/M8NMW7/",
                "title": "Rechter Feminismus in der 'Identitären Bewegung' ?- oder How to red pill a woman",
                "subtitle": "",
                "track": "Antifaschimus",
                "type": "Einfacher Slot",
                "language": "de",
                "abstract": null,
                "description": "Der Feminismus ist Feindbild der rechten Szenen. So auch in der ‚Identitären Bewegung‘. Neben Praktiken des Otherings und Diffamierungen gegen Feminist*innen und andere Akteur*innen des Gender-Diskurses behaupten die ‚Identitären‘, sich für Frauen viel gewissenhafter einzusetzen als „die Linken“ es täten: Denn Feminismus mache Frauen unglücklich und mache sie langfristig zu unfrei. Frauen ließen sich von „linksgrünversifften“ Mainstreammedien und der Politik unwissentlich emotional erpressen und wählten darum Parteien¬, die in der Lesart der IB Frauen nur Unglück brächten. Die Überzeugungsstrategien, die genutzt werden, um Frauen auf die „rechte Seite“ zu ziehen, wird in der Szene als „red pilling“ bezeichnet – eine Metapher von misogynen Männerrechtlern, die durch „Gamergate“ auch andere Szenen erreichte.\r\nIch werde die vermeintlich ‚harmlos‘ erscheinenden Social-Media-Darstellungen der ‚Identitären‘ – wie das „private’ Instagramfoto einer Schwangeren im Kornfeld – analysieren, und zeigen, welche mehr oder weniger subtilen Reproduktion von stereotypischen, antifeministischen Rollenbildern transportiert werden, die vordergründig als „frauenfreundlich“ angeboten werden.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 160,
                    "code": "UKMFTJ",
                    "public_name": "Marie Rodewald",
                    "biography": "Promoviere in Volkskunde/Kulturanthropologie an der Uni Hamburg zur 'Identitären Bewegung'",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 250,
                "guid": "5b826432-aae7-5fae-9fd0-85985b8b71cc",
                "logo": "",
                "date": "2019-12-28T17:00:00+01:00",
                "start": "17:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "QT7EV7",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/QT7EV7/",
                "title": "The technical is political – tech’s role in oppression and what technicians can do against it",
                "subtitle": "",
                "track": "Antifaschimus",
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": null,
                "description": "Where did all the nice things go? The World Wide Web had plenty. Everyone had Neopets, Geocities and Tom from MySpace as their top friend. \r\n\r\nWhere did all the women go? Computing had plenty of them. The first computers were women.\r\n\r\nThis talk is going to answer these and more questions. Starting with the technical underpinnings of the internet – explained on a beginner-friendly level. It takes you through the history of the web and computing, focussing on the exclusion of women out of the work sphere. It will illustrate that the tech industry as a whole has been complicit in oppression for far too long, but also show recent examples of organised workers, trying to change things for the better.\r\n\r\nIn the second part, it will use these learnings to make the case for building and promoting inclusive, accessible communities and websites. \r\n\r\nIt’s time to take back the web. \r\n\r\nPSA: There might be occurrences of cats, trance dolphins and other mystical creatures of the digital sphere along the way.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 194,
                    "code": "BE7UYP",
                    "public_name": "Oscar",
                    "biography": "Web-developer, typograph and antifascist.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 240,
                "guid": "dd49cd68-a630-5565-8e82-e397d89f900d",
                "logo": "",
                "date": "2019-12-28T18:00:00+01:00",
                "start": "18:00",
                "duration": "00:20",
                "room": "Chaos-West Bühne",
                "slug": "YDMJLP",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/YDMJLP/",
                "title": "DevelopersForFuture",
                "subtitle": "",
                "track": "Klimakatastrophe",
                "type": "Einfacher Slot",
                "language": "de",
                "abstract": null,
                "description": "### Code für den Aktivismus\r\n\r\nAls wir im Frühjahr diese Gruppe gegründet haben, konnten wir nicht ahnen, dass wir derart viele Anfragen zu bearbeiten geben könnte. Von Wissenschaftlern bis Förstern – jeder mit anderen Bedürfnissen. Dazu stehen wir in engem Kontakt mit den Entwicklern der diversen Friday For Future Projekte, sodass wir hier inzwischen auch als fester Bestandteil der Bewegung gelten\r\n\r\nDurch die Fülle an Organisationen und kleinen Projekten, können fast auf ein Jahr Coding zurückblicken. An diesen Beispielen möchte ich euch teilhaben lassen und so auch das Projekt Developers For Future vorstellen und es vor allem in den Kontext der Klima-Protest-Bewegung einordnen. Es geht los bei einem kleinen Einschreibeformular und endet bei ganzen Applikationen, die dabei helfen sollen die Anliegen der Bewegung zu transportiern.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 183,
                    "code": "XUUZAD",
                    "public_name": "Maximilian Berghoff",
                    "biography": "Max ist bereits seit den 90ern als Softwareentwickler aktiv. Zunächst setzte er sich noch mit kleineren Webprojekten auf Grundlage von PHP und MySQL auseinander. Nachdem ihn Studium und Job in einer Agentur zunächst ein wenig vom Web abbrachten, gelang ihm als Quereinsteiger dann auch professionell der Einstieg ins Development. Über das SymfonyCMF fand Max Geschmack an der Open-Source-Entwicklung und ist dort inzwischen im Core Team aktiv.\r\n\r\n\r\n\r\nMit seinem Interesse an der Softwareentwicklung ist er letztlich auf Mayflower aufmerksam geworden und dort als versierter Trainer in Workshops und als Speaker auf Konferenzen und Meetups gefragt.\r\n\r\n\r\n\r\nIm Rahmen der Mayflower Slacktime setzt Max sich dabei auch gerne mal mit Projekten anderer Sprachen wie Go auseinander, oder experimentiert mit Konzepten wie Artificial Intelligence (AI) oder Natural Language Understanding (NLU).\r\n\r\nSeit März 2019 hat mich nun das Klima-Fieber erwischt. Mit der Gründung der DevelopersForFuture und der Zusammenarbeite mit den restlichen ForFuture-Gruppen versuche ich nicht nur die Bewegung zu unterstützen, vielemehr gilt es die Verantwortung einer ganzen Branche herauszustellen.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 186,
                "guid": "c98a6986-b4bb-5503-9985-d1d754db2da9",
                "logo": "",
                "date": "2019-12-28T18:30:00+01:00",
                "start": "18:30",
                "duration": "00:20",
                "room": "Chaos-West Bühne",
                "slug": "JQMCLL",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/JQMCLL/",
                "title": "FSK Modems",
                "subtitle": "",
                "track": "The real basic about Bits and Nibbles",
                "type": "Einfacher Slot",
                "language": "de",
                "abstract": null,
                "description": "FSK Modems sind die einfachste praktikable Form von Modems. Sie sind so einfach, dass mit relativ wenig Aufwand bauen kann. Dabei kann man sie unterschiedlich realisieren von relativ einfachen von einfachen Digitalschaltungen bis hin zu einfachen Softwarelösungen. Auch wenn heute die Übertragung von Daten über Telefonleitungen nicht mehr so relevant ist, gibt es immer noch Anwendungen wie beispielsweise im Funkbereich oder wenn man Daten über Kopfhörerausgänge transportieren möchte.\r\nIn diesem Talk möchte ich einige der Wege aufzeichnen wie man solche Modems realisiert hat.\r\n\r\nDieser Talk soll auch dazu inspirieren selbst mal ein paar Zeilen Code zu schreiben oder den Lötkolben zu schwingen um diese Technologie auch heute noch zu verwenden. Gleichzeitig wird es auch noch zeigen wie schön komplexe Zahlen sein können und wofür die eigentlich gut sind.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 14,
                    "code": "MHDVTZ",
                    "public_name": "Christian Berger",
                    "biography": "Elektroingenieur aus Leidenschaft mit einem Hand zur Technikgeschichte. Von mir ist auch der Vortrag über Bildschirmtext vom 35c3.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 173,
                "guid": "eba30f37-4ed3-5e32-8654-b9840bc81228",
                "logo": "",
                "date": "2019-12-28T19:00:00+01:00",
                "start": "19:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "YDBKTM",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/YDBKTM/",
                "title": "Bahn API Chaos",
                "subtitle": "",
                "track": "The real basic about Bits and Nibbles",
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": null,
                "description": "Bahn API Chaos  \r\nWir schauen uns mal wieder Bahn APIs an.  \r\nDiesmal mehr Wagenreihungs Fakten und interessante unregelmäßigkeiten in den verschiedenen APIs.\r\nWarum zum Beispiel gibt es bei marudor.de ein \"isActuallyIC\" wenn doch eigentlich die Zuggattung mitkommt.  \r\nWarum gibt es \"realFahrtrichtung\" wenn es auch eine \"fahrtrichtung\" property gibt.\r\n\r\nUnregelmäßigkeiten in den Bahn APIs zwangen mich erfinderisch zu sein.  \r\nGleichzeitig ist es teils Abenteuerlich wie ich die unregelmäßigkeiten fand - die sind oft gar nicht so ersichtlich.  \r\n\r\nAuch versuchen wir zu erörtern warum die Sachen so sind, ist es ein technisches Problem? Ist es ein Datenproblem? Was könnte ein Auslöser sein? Wer ist dafür verantwortlich?\r\n\r\nGrundlage für alles ist marudor.de und die Entwicklung daran. Das bedeutet für mich mindestens 3 Jahre Erfahrung in Bahn APIs reverse engineeren und deuten wie gut die Qualität einzelner APIs ist. Dabei wurde nicht nur die Deutsche Bahn sondern auch verschiedene Verkehrsverbünde und Ausländische Bahnen angeschaut.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 118,
                    "code": "8WLJWF",
                    "public_name": "marudor",
                    "biography": "Schaut sich seit Jahren APIs von EVUs an und fand schon so einige lustige Dinge.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 228,
                "guid": "4b6a36ca-e734-5ae2-99cb-e08f3557d1e3",
                "logo": "",
                "date": "2019-12-28T21:00:00+01:00",
                "start": "21:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "HBQRZE",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/HBQRZE/",
                "title": "Encrypted DNS? D'oh! - The Good, Bad and Ugly of DNS-over-HTTPS (DoH)",
                "subtitle": "",
                "track": "All about computers",
                "type": "Doppelter Slot",
                "language": "en",
                "abstract": null,
                "description": "Old school DNS is unencrypted and thus prone to MITM-Attacks or DNS-Hijacking. DNS-over-HTTPS (DoH) is trying to solve this finally by encrypting DNS-requests between the client and the resolver. \r\n\r\nThere have been previous (failed) attempts of encrypting DNS, but DoH seems to be the most promising so far, because browser makers such as Mozilla and Google are pushing the adoption and plan to roll this technology out to all Firefox and Chrome users. Microsoft ist planning to support DoH in natively in Windows 10.\r\n\r\nBut there are a lot of people that are pretty angry and vocal about that move. This includes ISPs and Ad-Companies all over the world. \r\n\r\nThis talk will give an overview how DoH came to be, what problems it is trying to solve and what obstacles are hindering the adoption. You'll learn about DNS, encryption, the work on _proposed_ internet standards, how fake news work and why your ISP is tracking you and provides you with falsified information. And you'll learn how to use encrypted DNS.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 174,
                    "code": "7ESPXV",
                    "public_name": "Sebastian",
                    "biography": "I'm Sebastian Grüner and work as an editor at the German online IT magazine Golem.de. I cover everything Free and Open, Web, Internet and protocols. \r\n\r\n[My work](https://www.golem.de/specials/autor-sebastian-gruener/)\r\n\r\n[Twitter](https://twitter.com/grnr_s)",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 206,
                "guid": "353a6553-2fcf-56d4-81e3-93c0b7bcff4a",
                "logo": "",
                "date": "2019-12-28T22:00:00+01:00",
                "start": "22:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "PDFWDW",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/PDFWDW/",
                "title": "Welches Betriebssystem hat der Bundestag und wie kann man es hacken?",
                "subtitle": "",
                "track": "All about computers",
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": null,
                "description": "Wäre der Staat ein Betriebssystem, würden wir uns natürlich wünschen, dass er nach den Prinzipien freier Software verwaltet wird. Die Prozesse sollten möglichst transparent ablaufen, sodass jeder nachprüfen kann, wenn irgendwo was schief läuft. Natürlich sollte die Gestaltung der Prozesse nicht in einer Blackbox passieren und der Code sollte zum Verändern und Mitmachen einladen. Ich bin der Meinung, dass Politik transparent und nachvollziehbar sein sollte. Es sollte Beteiligungsmöglichkeiten geben, die für alle offen stehen. Leider laufen die Prozesse im Bundestag nicht mal transparent, geschweige denn besonders partizipativ ab. Das Interface ist so unübersichtlich, dass selbst die Leute mit Adminrechten (Regierung) zum Teil Schwierigkeiten haben, den Überblick zu behalten. Als Bundestagsabgeordnete wurde mir zwar ein dickes Manual ausgehändigt, zum Durcharbeiten war aber keine Zeit. Die Lernkurve, bis man das System halbwegs effizient nutzen kann, ist sehr lang. Die Abläufe sind analoger, als man ohnehin vermutet, mit absurden, historisch gewachsenen Abläufen und unvorstellbaren Papierbergen. Es gibt wenig Transparenz und Mitmachmöglichkeiten sind rar.\r\nIn dieser Session gebe ich Insider Einblicke in den Alltag als netzpolitische Sprecherin der Linksfraktion im Bundestag mit netzaktivistischem Hintergrund, zeige die Handlungsmöglichkeiten einer Oppositionspolitikerin und wie ich versuche, meine eigenen Handlungsspielräume für mehr Transparenz und Beteiligungsmöglichkeiten auszureizen, aber auch wie ihr als Netzcommunity mich als Eure Volksvertreterin nutzen könnt, um z.B. auf offiziellen Kanälen Informationen abzufragen, an die man sonst nicht kommt, denn Wissen ist Macht. \r\nAls Netzaktivistin im Bundestag möchte ich dort ganz besonders Sprachrohr der Netzcommunity sein. In meiner Rolle als Abgeordnete einer Oppositionspartei kann ich Themen setzen und Informationen beschaffen, ich kann fiese Fragen stellen – in langen und kurzen Formaten und die Bundesregierung muss darauf antworten. In 22 Monaten hielt ich 20 Reden, stellte 43 schriftliche Fragen, 33 Kleine Anfragen, 5 Anträge und reichte einen eigenen Gesetzentwurf ein. Es ging um Überwachung am Südkreuz, Open Source, das NetzDG, Hackbacks, IPv6, Künstliche Intelligenz, DNA Analysen in der Stammbaumforschung, Uploadfilter, IT Sicherheit, Impressumpflichten, barrierefreie Notrufe, Whistleblower, Mobilfunk, Open Data, KfZ Scanning, Funkzellenabfragen und stille SMS, digitale Gewalt gegen Frauen, Bundeswehr bei re:publica, Verschlüsselung, Lobbyregister, social Innovation, Open Justice und vieles mehr.\r\nIn dieser Session werde ich konkrete Beispiele dazu vorstellen, über meine Pläne reden und Euch fragen, was Ihr schon immer von der Bundesregierung in Netzfragen wissen wolltet, damit ich die GroKo weiter nerven kann und wir alle besser wissen, was sie tun. Lasst uns gemeinsam das intransparente und wenig partizipative System Bundestag hacken, denn Demokratie lebt vom Mitmachen!",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 152,
                    "code": "SB87WQ",
                    "public_name": "Anke Domscheit-Berg",
                    "biography": "1968 geboren, in der DDR aufgewachsen.\r\nStudienabschlüsse: Textilkunst (DDR), BA International Business Administration, MA European Business Administration\r\n9 Jahre Accenture\r\n2 Jahre McKinsey Business Technology Office\r\n3 Jahre Microsoft Deutschland \r\nSeit 2011 Publizistin (Buchautorin, Kolumnistin, Texte u Vorträge)\r\nSeit 2017 Mitglied des Deutschen Bundestages, parteilos in der Fraktion DIE LINKE\r\nSchwerpunktthemen: Verbindung von Digitaler Revolution mit Sozialer Revolution sowie gemeinwohlorientierte Gestaltung der digitalen Gesellschaft; Digitale Bildung (eigenes Projekt: Verstehbahnhof in Fürstenberg/Havel), Open Government, Geschlechtergerechtigkeit\r\nIch lebe im Norden von Brandenburg und bin verheiratet mit Daniel Domscheit-Berg, 1 Sohn, 6 Katzen.\r\n\r\nIch bin netzpolitische Sprecherin der Linksfraktion, Mitglied bzw. stellvertretendes Mitglied im Digitalausschuss, im Beirat der Bundesnetzagentur (Megathema 5G Lizenzversteigerung), der Enquete Kommission Künstliche Intelligenz, in den Ausschüssen für Bildung/Forschung/Technikfolgen sowie für Verkehr und digitale Infrastruktur.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 234,
                "guid": "87f4774e-f5db-5cee-b053-89219329c2de",
                "logo": "/media/36c3/images/YYJGCZ/header.png",
                "date": "2019-12-28T23:00:00+01:00",
                "start": "23:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "YYJGCZ",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/YYJGCZ/",
                "title": "DC/DC Converters: Everything You Wanted To Know About Them",
                "subtitle": "",
                "track": "Nicht Computers",
                "type": "Doppelter Slot",
                "language": "en",
                "abstract": null,
                "description": "# Non-isolated DC/DC converters\r\n\r\nDC-to-DC converters are cheap and ubiquitous, but many still feel uncomfortable using them. In this talk I will talk about step-down (buck) and step-up (boost) converters, covering the basics in an easy-to-understand form, and touching on the knowledge you need to build your own.\r\n\r\nThis talk will be enjoyable for you if you have basic electronics knowledge: you understand what voltage, resistance, and current mean.\r\n\r\n##Outline\r\n- Theory of operation explained with illustrations\r\n- Synchronous and asynchronous converters: advantages and disadvantages\r\n- How to chose and evaluate cheap DC/DC converter modules you can buy online\r\n- Efficiency and sources of energy loss\r\n- Features you might want: Enable, Current Limiting, Undervoltage Protection\r\n- Control modes: voltage mode, current mode, and hysteretic mode\r\n- Unstable converters, and how to fix them\r\n- Switching noise, and how to deal with it\r\n- What if you need more voltage? Boost converters!",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 177,
                    "code": "MCANSZ",
                    "public_name": "Zoé Bőle",
                    "biography": "I am an electronics engineer and hardware-software tinkerer who likes to share her fascination.\r\n\r\nI worked years as validation engineer in the semiconductor industry, testing DC/DC converters. I'm enthusiastic about open hardware, maker culture and DIY.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 177,
                "guid": "86b9dea6-e5f7-5849-a732-945101965e1b",
                "logo": "",
                "date": "2019-12-29T00:00:00+01:00",
                "start": "00:00",
                "duration": "02:00",
                "room": "Chaos-West Bühne",
                "slug": "9AY7YE",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/9AY7YE/",
                "title": "Systemabsturz",
                "subtitle": "",
                "track": "Klangteppich",
                "type": "Klangteppich",
                "language": "de",
                "abstract": null,
                "description": "Systemabsturz ist eine Datenschutz-Elektropunk-Band aus Berlin. Stets pflichtbewusst fordern sie einen weiteren Abbau der Freiheitsrechte und mehr Überwachung. Musikalisch bewegen sich die Songs irgendwo zwischen Rave Punk, Schlager-Verschnitten und Techno.",
                "recording_license": "",
                "do_not_record": true,
                "persons": [
                  {
                    "id": 125,
                    "code": "YSTCQ8",
                    "public_name": "Vik",
                    "biography": "Ab und zu singender Keyboarder von Systemabsturz.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 220,
                "guid": "1e6d2e5d-31b2-5877-97aa-b03e8bf8dffd",
                "logo": "/media/36c3/images/7PERQN/53761191_1876875599091269_7223011896578801664_o.png",
                "date": "2019-12-29T02:00:00+01:00",
                "start": "02:00",
                "duration": "02:00",
                "room": "Chaos-West Bühne",
                "slug": "7PERQN",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/7PERQN/",
                "title": "intergalactic gas distribution (light)",
                "subtitle": "",
                "track": "Klangteppich",
                "type": "Klangteppich",
                "language": "en",
                "abstract": null,
                "description": "Improvised music, visualised and influenced through artificial intelligence. Dialogue in space, interaction, improvisation, live sampling, as well as the creative use of traditional and experimental instruments, synthesizers, electronic effects and everyday life objects -- all of which turns into music under the influence of AI. Evolving from this is a unique, atmospheric sound and non-repeatable sound experience. The employed AI consists of a neural network, thus an exemplary reproduction of brain functions. The data sets which are used to train the network includes behavioural modelling data as and the distribution of gases in space. Glitches and non-perfect behavior is strongly appreciated! The \"light\" version is just the dialog between algorithm and modular. live Ambient / Drone / Soundscape",
                "recording_license": "",
                "do_not_record": true,
                "persons": [
                  {
                    "id": 167,
                    "code": "PCHHEA",
                    "public_name": "timodufner",
                    "biography": "Timo Dufner is a musician, media artist and computer scientist. His work focuses on testing limits of hard- and software. In doing so, glitches are an unavoidable component he consciously puts up with. Characteristic features of his work also include direct interaction between sound and image and an exchange between audience and piece. All of his works are created real-time – in the very moment – and thus each performance is different. Real-time audio processing, machine learning and AI, live coding and numerous electronical instruments are being deployed.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              }
            ],
            "Workshop": [
              {
                "id": 347,
                "guid": "bf48fa55-92a1-5481-a14a-f77cc0d4fccb",
                "logo": "",
                "date": "2019-12-28T11:30:00+01:00",
                "start": "11:30",
                "duration": "01:00",
                "room": "Workshop",
                "slug": "FU3ZZE",
                "url": "https://talks.oio.social/36c3-oio/talk/FU3ZZE/",
                "title": "Nudeln hacken - Wettbewerb für Junghacker von 5 Jahren bis ∞",
                "subtitle": "",
                "track": null,
                "type": "Workshop 1 hour",
                "language": "de",
                "abstract": "Spaß am Gerät: Mehrere Teams bauen gleichzeitig mit Nudeln um die Wette. Dabei geht es um kreativen Umgang mit Technik und die Erfahrung, dass man Dinge auch jenseits der eigentlichen Verwendungszwecke gut gebrauchen kann. Junghacker bzw. solche die es werden wollen, können alleine oder als Team kommen. Es kann jeder mitmachen, der weiß, was eine Nudel ist. PS: Es werden keine Lebensmittel verschwendet. PPS: Erwachsene dürfen auch mitmachen, wenn sie den Junghacker keinen Platz wegnehmen. Sie werden aber wahrscheinlich gegen den Nachwuchs verlieren :-D",
                "description": "",
                "recording_license": "",
                "do_not_record": true,
                "persons": [
                  {
                    "id": 74,
                    "code": "73PEWU",
                    "public_name": "Stefan Safari",
                    "biography": "Ich arbeite sehr gerne mit Gruppen, mag den kreativen Umgang mit Dingen und liebe es, gutes Essen zu essen.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 348,
                "guid": "c4bd3614-30a5-5739-a7f6-6880be23709b",
                "logo": "",
                "date": "2019-12-28T13:30:00+01:00",
                "start": "13:30",
                "duration": "01:00",
                "room": "Workshop",
                "slug": "RW3HCE",
                "url": "https://talks.oio.social/36c3-oio/talk/RW3HCE/",
                "title": "Trotz Schule die Zukunft meistern? - Mitmach-Workshop für Menschen von 10-100 Jahre",
                "subtitle": "",
                "track": null,
                "type": "Workshop 1 hour",
                "language": "en",
                "abstract": "In einem Workshop überlegen Schüler*innen gemeinsam mit anderen, wie man sich auf Berufe vorbereitet, die es heute noch gar nicht gibt. Und warum das eigene Smartphone- und Social-Media-Verhalten einem die Zukunft rettet statt sie zu vergeigen.",
                "description": "Die Schüler*innen von heute werden später Jobs machen, von denen es 65% heute noch gar nicht gibt - sagt eine Studie, der OECD. Die OECD hat auch Thesen aufgestellt worauf es in der Zukunft ankommt. Da werden Punkte wie \"Problem lösen/kritisches Denken\" oder \"Kreativität\" genannt und persönliche Eigentschaften wie \"Neugierde\", \"Initiative\" oder \"Ausdauer/Entschlossenheit\" aufgelistet. Bereitet einen die Schule wirklich auf so was vor, oder sind die Lernwelten nicht viel größer. Wie ist ein Besuch des 36C3 einzuordnen? Wie \"wird man neugierig\"?\r\n\r\nDer Workshop wird besonders lebendig, wenn verschiedene Altergruppen/ Generationen teilnehmen. Wenn es allerdings eng im Raum wird, werden Schüler*innen bevorzugt.",
                "recording_license": "",
                "do_not_record": true,
                "persons": [
                  {
                    "id": 74,
                    "code": "73PEWU",
                    "public_name": "Stefan Safari",
                    "biography": "Ich arbeite sehr gerne mit Gruppen, mag den kreativen Umgang mit Dingen und liebe es, gutes Essen zu essen.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 347,
                "guid": "bf48fa55-92a1-5481-a14a-f77cc0d4fccb",
                "logo": "",
                "date": "2019-12-28T15:30:00+01:00",
                "start": "15:30",
                "duration": "01:00",
                "room": "Workshop",
                "slug": "FU3ZZE",
                "url": "https://talks.oio.social/36c3-oio/talk/FU3ZZE/",
                "title": "Nudeln hacken - Wettbewerb für Junghacker von 5 Jahren bis ∞",
                "subtitle": "",
                "track": null,
                "type": "Workshop 1 hour",
                "language": "de",
                "abstract": "Spaß am Gerät: Mehrere Teams bauen gleichzeitig mit Nudeln um die Wette. Dabei geht es um kreativen Umgang mit Technik und die Erfahrung, dass man Dinge auch jenseits der eigentlichen Verwendungszwecke gut gebrauchen kann. Junghacker bzw. solche die es werden wollen, können alleine oder als Team kommen. Es kann jeder mitmachen, der weiß, was eine Nudel ist. PS: Es werden keine Lebensmittel verschwendet. PPS: Erwachsene dürfen auch mitmachen, wenn sie den Junghacker keinen Platz wegnehmen. Sie werden aber wahrscheinlich gegen den Nachwuchs verlieren :-D",
                "description": "",
                "recording_license": "",
                "do_not_record": true,
                "persons": [
                  {
                    "id": 74,
                    "code": "73PEWU",
                    "public_name": "Stefan Safari",
                    "biography": "Ich arbeite sehr gerne mit Gruppen, mag den kreativen Umgang mit Dingen und liebe es, gutes Essen zu essen.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 375,
                "guid": "5634bc77-b6ad-52ae-88c5-c059cfcebb8e",
                "logo": "",
                "date": "2019-12-28T18:00:00+01:00",
                "start": "18:00",
                "duration": "02:00",
                "room": "Workshop",
                "slug": "TZBSSE",
                "url": "https://talks.oio.social/36c3-oio/talk/TZBSSE/",
                "title": "SDR kennenlernen",
                "subtitle": "",
                "track": null,
                "type": "Workshop 2 hours",
                "language": "de",
                "abstract": "Software Defined Radios in Kombination mit open source tools erlauben es einfach anspruchsvolle aufgeben umzusetzen. Nach einer kurzen theoretischen Engführung kann sich jeder an verschieden Beispielen versuchen Signale zu empfangen und zu dekodiren.",
                "description": "Vom FM Radio bis hin zu z.B. Wlan frames wollen wir uns verscheide Dinge anschauen. Wer es kann bitte einen Laptop mitbringen um eigenständig arbeiten zu können. English speakers can also attend but may have to wait a bit for there instructions.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 135,
                    "code": "YXFCTE",
                    "public_name": "Lars Rokita",
                    "biography": "Physics student who likes to tinker around with high frequency stuff. Call DL4APT",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 353,
                "guid": "c05054ed-aca8-5d2f-814c-0d6e8851d96e",
                "logo": "/media/36c3-oio/images/CTQSQ8/meetup_1920_7FtptxA.png",
                "date": "2019-12-28T20:30:00+01:00",
                "start": "20:30",
                "duration": "02:00",
                "room": "Workshop",
                "slug": "CTQSQ8",
                "url": "https://talks.oio.social/36c3-oio/talk/CTQSQ8/",
                "title": "Open Communication Meetup! - Decentralized Social Networks",
                "subtitle": "",
                "track": null,
                "type": "Workshop 2 hours",
                "language": "en",
                "abstract": "We will test, discuss and document decentralized and off the grid social networks, such as secure scuttlebutt SSCB.",
                "description": "The goal behind [open-communication.net](https://open-communication.net) is to build a knowledge base on open decentralized communication tools. This is done collectively and collaboratively in 'Open Communication Meetups'.\r\n\r\nIn this meetup we will test, discuss and document existing decentralized and off-the-grid social networks, such as [secure scuttlebutt](https://scuttlebutt.nz/). \r\n\r\nPlease bring your laptops and digital devices in order to collectively test the projects!\r\n\r\nhttps://open-communication.net",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 120,
                    "code": "G78ZPE",
                    "public_name": "Mathias Jud",
                    "biography": "Mathias Jud is a berlin based artist. Since over twenty years, he works together with Christoph Wachter.\r\nTheir art works include open-source projects that uncover forms of censorship of the Internet, undermine the concentration of political power and even resolve the dependency on infrastructure.\r\n\r\nhttps://www.wachter-jud.net/",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              }
            ],
            "ChaosZone Workshop": [
              {
                "id": 735,
                "guid": "4041ab59-5add-5f84-9a37-d716c468a136",
                "logo": "",
                "date": "2019-12-28T10:00:00+01:00",
                "start": "10:00",
                "duration": "08:00",
                "room": "ChaosZone Workshop",
                "slug": "PU7RSW",
                "url": "https://cfp.chaoszone.cz/36c3/talk/PU7RSW/",
                "title": "Junghackertag",
                "subtitle": "",
                "track": null,
                "type": "Workshop 8h",
                "language": "de",
                "abstract": "Der Junghackertag der Chaoszone ist Teil des 36C3-Junghackertages am 28.12.  (link zum 36C3 Junghackertag, wenn verfügbar)",
                "description": "Es gibt verschiedene Stationen, bei denen Du Dich ausprobieren kannst: \r\n- Du kannst Lötkits löten, einfache Buttons bis komplexe Laufschrift-Namensschilder, Du suchst es Dir aus.\r\n- Es gibt mBot Roboterautos, die Du steuern kannst.\r\n- Du kannst auch vorher mit einem Programm arbeiten und dabei ausprobieren, wie so eine Steuerung funktioniert.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 35,
                    "code": "LTF3B7",
                    "public_name": "r2d2data",
                    "biography": "Bin in Verein dezentrale",
                    "answers": []
                  },
                  {
                    "id": 49,
                    "code": "PGSUMT",
                    "public_name": "rezzisto",
                    "biography": "",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              }
            ]
          }
        },
        {
          "index": 4,
          "date": "2019-12-29",
          "day_start": "2019-12-29T06:00:00+01:00",
          "day_end": "2019-12-30T04:00:00+01:00",
          "rooms": {
            "Lecture room 11": [],
            "Seminar room 14-15": [],
            "Seminar room 13": [],
            "Lecture room M1": [],
            "Lecture room M2": [],
            "Lecture room M3": [],
            "Kidspace": [],
            "CCL Saal 3": [],
            "Chaos West Bühne": [],
            "ChaosZone": [],
            "OIO Stage": [
              {
                "id": 384,
                "guid": "d7287f76-3369-5017-89f7-35101cc72a18",
                "logo": "",
                "date": "2019-12-29T17:10:00+01:00",
                "start": "17:10",
                "duration": "00:25",
                "room": "OIO Stage",
                "slug": "UYCLAE",
                "url": "https://talks.oio.social/36c3-oio/talk/UYCLAE/",
                "title": "Hacking health",
                "subtitle": "",
                "track": null,
                "type": "Talk 20 minutes + 5 minutes Q&A",
                "language": "en",
                "abstract": "About hacking wheelchairs, building custom bicycles, adapters to use e-scooters as outboard motors: Empowering people with disablitities or healthcare needs through Open Hardware. Presentation on experiences and lessons learned in collecting and co-creating open personalized DIY healthcare solutions for replicability and adaptability in Makerspace worldwide.",
                "description": "Careables are open source solutions that aim to improve the quality of life for people with unmet particular needs or facing physical limitations. Careables are often co-designed, replicable, accessible, adjustable and shareable online using digital technologies.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 96,
                    "code": "P3GLDY",
                    "public_name": "Sandra GIG",
                    "biography": "Sandra Mamitzsch baut seit 2018 das Berliner Büro des Global Innovation Gathering e.V., einem globalen Netzwerk von Makern und Innovatoren, auf und beschäftigt sich daher viel damit, wie dezentrale Zusammenarbeit und offene Organisationsformen funktionieren. Hauptsächlich ist sie im Verein für das Horizon2020-Förderprojekt Careables.org verantwortlich, dass innerhalb von Makerspace-Communities dabei hilft, mit offenen Technologien und Co-Design in Gesundheit und Pflege das Leben von Menschen zu verbessern. Von 2012-2017 war sie Programmdirektorin der re:publica und arbeitet dort weiterhin als freie Beraterin und Kuratorin. Nebenbei ist sie Mitglied bei European Digital Rights (EDRi) und beim Digitale Gesellschaft e.V.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 354,
                "guid": "18a492b2-6219-5b95-a48d-b03944b75739",
                "logo": "",
                "date": "2019-12-29T17:40:00+01:00",
                "start": "17:40",
                "duration": "00:45",
                "room": "OIO Stage",
                "slug": "WSLWVM",
                "url": "https://talks.oio.social/36c3-oio/talk/WSLWVM/",
                "title": "Delta Chat: e-mail based messaging, the Rustocalypse and UX driven approach [YBTI/wefixthenet session]",
                "subtitle": "",
                "track": null,
                "type": "Talk 45 minutes + 10 minutes Q&A",
                "language": "en",
                "abstract": "Delta Chat is an e-mail instant messenger that is just becoming available on all platforms. \r\nUnlike other offerings, Delta Chat is no platform and operates no own servers. \r\nInstead it uses existing SMTP/IMAP servers to send and receive messages.\r\nWe'll talk about the current development status on all platforms, our new \r\nRust-core based approach, our decentralized e2e-encryption facilities (not requiring \r\nkeyservers, and safe against active attacks) and how we are generally driving\r\ndevelopments from UX and security perspectives.  We also aim to showcase\r\n\"burner accounts\", a new concept that we are developing and discussing\r\nwith activists in eastern european countries and asian cities.",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 128,
                    "code": "MCE83P",
                    "public_name": "dvn",
                    "biography": "p2p communications and privacy researcher and developer\r\n\r\nCurrently organizing a \"youbroketheinternet/wefixthenet\" session at 36c3, representing GNUnet.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 388,
                "guid": "81b0de17-dbef-5da7-80e8-4d9ae563a4fd",
                "logo": "",
                "date": "2019-12-29T19:00:00+01:00",
                "start": "19:00",
                "duration": "00:45",
                "room": "OIO Stage",
                "slug": "MPCRC8",
                "url": "https://talks.oio.social/36c3-oio/talk/MPCRC8/",
                "title": "Freifunk und die Haftungsprivilegierung des Telemediengesetzes",
                "subtitle": "",
                "track": null,
                "type": "Talk 45 minutes + 10 minutes Q&A",
                "language": "de",
                "abstract": "Seit Jahren kämpfen wir um die Haftungsprivilegierung für Freifunker. Als Zugangsvermittler in das Internet hat der Gesetzgeber den Freifunker als Diensteanbieter von Ansprüchen Dritter freigestellt. Nach dem Gesetz ist der Freifunker für die Handlungen Dritter im Internet nicht verantwortlich. Wie die Rechtssprechung die gesetzliche Regelung anwendet, möchte ich Euch in meinem Vortrag berichten.",
                "description": "Ich würde gerne den Vortrag in meinen Bericht über die einzelnen Freifunk-Verfahren gegen die Rechteinhaber einbetten. Ich weiß noch nicht recht, wie ich den Zusammenhang gestalte. Mit wem könnte ich darüber sprechen?",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 75,
                    "code": "UEK7FN",
                    "public_name": "Beata Hubrig",
                    "biography": "Mit Anfang zwanzig entschied ich mich, Rechtsanwältin zu werden und habe immer wieder große Freude daran, die zivilrechtlichen Interessen im Urheberrecht und Datenschutz zu vertreten. Dabei lege ich großen Wert auf die Durchsetzung des generellen Zugangs zu Informationen und wissenschaftlichen Werken sowie auf den Schutz jeder natürlichen Person vor dem Missbrauch ihrer personenbezogenen Daten.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 357,
                "guid": "35f647fc-1849-5194-a354-2e855e7a642d",
                "logo": "/media/36c3-oio/images/SHDVXB/t1-engine_pvMnznO.jpg",
                "date": "2019-12-29T21:30:00+01:00",
                "start": "21:30",
                "duration": "00:25",
                "room": "OIO Stage",
                "slug": "SHDVXB",
                "url": "https://talks.oio.social/36c3-oio/talk/SHDVXB/",
                "title": "Raumfahrtantriebe",
                "subtitle": "",
                "track": null,
                "type": "Talk 20 minutes + 5 minutes Q&A",
                "language": "de",
                "abstract": "Wie kommt man eigentlich in den Weltraum und was ist an so ein bisschen Schub so kompliziert *?\r\n\r\nWarum sehen Raumfahrtantriebe so aus wie sie sind und was wird sich mit \"New Space\" alles ändern?\r\n\r\n\r\n(*)insert rocket science joke here",
                "description": "Preview\r\n1. Wie erzeugt man Schub?\r\n-\tWas ist eine Raketenmotor -triebwerk?\r\n-\tWarum fliegen Flaschenraketen mit Wasser höher?\r\n\r\n2. Feststoffraketen\r\n-\tFeuerwerk, Modellbau oder Shuttle Booster\r\n-\tBrennprofile\r\n\r\n3. Flüssigraketen\r\n-\tGoddards erste Versuche\r\n-\tKomplex, teuer, fehleranfällig und warum wir trotzdem Flüssigtreibstoffe nutzen\r\n3.1. Brennkammer\r\n-\tAufbau und Eigenschaften\r\n3.2. Turbopumpen\r\n-\tWie kommt der Treibstoff und Oxidator in die Brennkammer\r\n3.3. Düsen\r\n-\twarum überhaupt Düsen und warum sehen sie so aus wie sie sind\r\n-\tAerospike\r\n3.4. Treibstoffe\r\n-\tEin wenig Chemie.  Mono-, Bi- und Tritreibstoff \r\n3.5. 5,4 all engines running,2,1,0 lift off\r\n-\tWie man eine Rakete startet Soyuz, Titan II, Delta 4 und das Space-Shuttle\r\n4. Hybridraketen\r\n-\tDie Komplexität einer Flüssigrakete mit den Nachteilen einer Feststoffrakete\r\n5. Ionenantrieb\r\n-\tWenig Schub aber hoher Impuls \r\n-\tAufbau und Eigenschaften\r\n6. Solar Sail\r\n-\tEin Segel spannen und mit dem Sonnenwind dahingleiten\r\n7. Nuklearantriebe\r\n-\tEin fliegender Kernreaktor, was kann da schon schief gehen?\r\n-\tin 200 Tagen zum Mars und zurück",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 127,
                    "code": "H3NCWF",
                    "public_name": "Äpex",
                    "biography": "armchair rocket scientists.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 381,
                "guid": "03d76db0-ea48-516b-94f2-b731cccf47de",
                "logo": "",
                "date": "2019-12-29T22:00:00+01:00",
                "start": "22:00",
                "duration": "00:55",
                "room": "OIO Stage",
                "slug": "7WUGHV",
                "url": "https://talks.oio.social/36c3-oio/talk/7WUGHV/",
                "title": "Ethische Grenzen im Making",
                "subtitle": "",
                "track": null,
                "type": "Talk 45 minutes + 10 minutes Q&A",
                "language": "de",
                "abstract": "Machbarkeit im Making wird vornehmlich von physikalischen Gesetzen bestimmt. Doch wie sieht es mit ethischen Grenzen aus? Vor allem im Gesundheitsbereich stellt sich die Frage, ob alles das was reverse engineered und selbst gebaut werden kann tatsächlich auch von der maker community diesem Prozess unterzogen werden sollte. Über diese Frage diskutieren Steini und Seb (CADUS).",
                "description": "„Tut mir leid, alle von offiziellen Stellen geprüften und zertifizierten Medizingeräte sind kaputt, aber wir überwachen Sie während der OP einfach mit diesem selbst zusammengebauten open source Patienten-Monitor, kein Problem.“\r\n\r\nMachbarkeit im Making wird vornehmlich von physikalischen Gesetzen bestimmt. Doch wie sieht es mit ethischen Grenzen aus? Vor allem im Gesundheitsbereich stellt sich die Frage, ob alles das was reverse engineered und selbst gebaut werden kann tatsächlich auch von der maker community diesem Prozess unterzogen werden sollte. Über diese Frage diskutieren Steini und Seb (CADUS).",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 133,
                    "code": "M7YNCY",
                    "public_name": "Sebastian Jünemann",
                    "biography": "Gründer der unabhängigen humanitären Hilfsorganisation CADUS e.V., die in Zusammenarbeit mit lokalen Partner*innen medizinische und technische Nothilfe leistet. CADUS ist hauptsächlich in Nordost-Syrien und im Nord-Irak tätig. Im Berliner Crisis Response Makerspace der Organisation werden open source Lösungen für Herausforderungen in der humanitären Hilfe entwickelt.",
                    "answers": []
                  },
                  {
                    "id": 149,
                    "code": "AT7TJC",
                    "public_name": "Steini",
                    "biography": null,
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              }
            ],
            "Chaos-West Bühne": [
              {
                "id": 247,
                "guid": "693d16cf-a258-5c00-a9b4-64ba49317708",
                "logo": "",
                "date": "2019-12-29T11:00:00+01:00",
                "start": "11:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "Q7LV9G",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/Q7LV9G/",
                "title": "Datengewerkschaften im Kampf gegen Facebook, Google und Co.",
                "subtitle": "",
                "track": "All about computers",
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": null,
                "description": "Die Datenverarbeitung auf Basis von Einwilligungen macht uns zu Klickrobotern und gibt uns gegenüber übermächtigen Anbietern keine wirklich freie Wahl. Wir zeigen eine Alternative auf, mit der wir unser Grundrecht auf informationelle Selbstbestimmung gegenüber den Großkonzernen wieder durchsetzen könnten.\r\n\r\nAusgehend von den Nachteilen der meistens alternativlosen Einwilligung, die Facebook, Google und Co. für die Nutzung ihrer Services verlangen, wird das Modell von Datengewerkschaften erläutert, ein Zusammenschluss von datenerzeugenden Einzelpersonen. Die Bündelung der Interessen vieler Betroffener zur Schaffung einer ernstzunehmenden Verhandlungsposition und die damit verbundene Ermöglichung von differenzierten und wirklich freiwilligen Einwilligungen könnten zu einer besseren Balance der Interessen führen, ohne die einzelnen Betroffenen dabei zu bevormunden. Eine erste Datengewerkschaft wurde bereits 2018 in den Niederlanden gegründet, deren erklärtes Ziel es ist, direkt mit den Anbietern zu verhandeln, um den Erzeuger*innen der Daten auch einen fairen Anteil an den Gewinnen zu verschaffen.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 195,
                    "code": "MVX8Y9",
                    "public_name": "Jörn Erbguth",
                    "biography": "Als Jurist und Informatiker setze ich mich für digitale Grundrechte ein. Aktiv im Bereich Blockchain und DSGVO, lehre ich an der Uni Genf, der Geneva School of Diplomacy und der Universität Luzern. Ich engagiere mich für die Standardisierung von Blockchain und organisiere Veranstaltungen zum Thema [Blockchain und DSGVO](https://blockchain-gdpr.info).\r\nIm Vorstand des [EDV-Gerichtstag](https://edvgt.de) bemühe ich mich um eine gerechte digitale Justiz und im Vorstand von [entscheidsuche.ch](https://entscheidsuche.ch) für den freien Zugang zu Schweizer Gerichtsentscheiden.",
                    "answers": []
                  },
                  {
                    "id": 189,
                    "code": "UFDKUK",
                    "public_name": "Deanna",
                    "biography": "In Berlin lebende Rechtsanwältin mit einer hohen Affinität zur IT",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 214,
                "guid": "4f4901d9-d5fa-594d-b367-532933de3d02",
                "logo": "/media/36c3/images/S9XFSM/digitalcourage_vds_banner.jpg",
                "date": "2019-12-29T12:00:00+01:00",
                "start": "12:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "S9XFSM",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/S9XFSM/",
                "title": "Achtung Vorratsdatenspeicherung: Es wird ernst",
                "subtitle": "",
                "track": "Nicht Computers",
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": null,
                "description": "Untertitel:\r\n\r\nWie Europol und die Innenminister der EU-Länder Massenüberwachung legalisieren wollen und was dagegen zu tun ist.\r\n\r\n–– \r\n\r\nZusammenfassung:\r\n\r\nTrotz klarer Gerichtsurteile gegen anlasslose Massenüberwachung wird in Arbeitsgruppen, Ausschüssen und Spezialgerichten an neuen Rechtsgrundlagen für eine EU-weite Vorratsdatenspeicherung gearbeitet. Es geht um Hintertüren in der ePrivacy-Verordnung, einen Fahrplan von EU-Rat und EU-Kommission, ein Überwachungskonzept von Europol und Versuche, den EU-Gerichtshof zu einer Revidierung vorheriger, grundrechtefreundlicher Urteile zu bewegen, während zur selben Zeit in Deutschland die CDU den Terror-Angriff von Halle/Saale instrumentalisiert.\r\n\r\n––\r\n\r\nAusführliche Beschreibung:\r\n\r\nIn diesem Vortrag möchte ich erklären, wie sogenannte Sicherheitspolitiker auf drei Ebenen an mehreren neuen Rechtsgrundlagen für die massenhafte und anlasslose Überwachung unserer Kommunikations- und Aktivitätsdaten arbeiten. In diesem Zusammenhang möchte ich die Reaktion der deutschen CDU auf den Terror-Angriff in Halle/Saale im Oktober diesen Jahres als geschichtsvergessen kritisieren.\r\n\r\nZum Referenten: Mein Name ist Friedemann Ebelt, ich arbeite seit fünf Jahren bei der deutschen Grundrechteorganisation Digitalcourage, die im Jahr 2006 eine Verfassungsbeschwerde gegen das deutsche Gesetz zur Vorratsdatenspeicherung eingereicht hat. Die Klage ist mit anderen Beschwerden anhängig beim Bundesverfassungsgericht, dessen Urteil eine EU-weite Signalwirkung haben wird.\r\n\r\nDigitalcourage beobachtet die aktuellen Überwachungsbestrebungen unter anderem mit Hilfe von Anfragen auf Grundlage des Informationsfreiheitsgesetzes, die wir auf fragdenstaat.de stellen. Was uns die Dokumente zeigen, ist aus unserer Sicht eine Kampagne für Vorratsdatenspeicherung, die auf drei Ebenen stattfindet:\r\n\r\n(1)\r\nIm geplanten EU-Gesetz zur ePrivacy-Verordnung wird über eine riesige Hintertür für eine private Vorratsdatenspeicherung verhandelt. Das ist absurd, denn das Ziel dieser Verordnung ist der Schutz sensibler Kommunikationsdaten. (Siehe Artikel 6 des Entwurfs einer ePrivacy-Verordnung)\r\n→ Mehr dazu:\r\nhttps://digitalcourage.de/blog/2019/eprivacy-private-vorratsdatenspeicherung-durch-hintertuer\r\n\r\n(2)\r\nEU-Rat und EU-Kommission haben einen Fahrplan für eine neue EU-weite Vorratsdatenspeicherung beschlossen. Die Hauptgefahr aus unserer Sicht ist, dass ausschließlich Vorschläge für anlasslose Massenüberwachung diskutiert werden, wie die Überwachungs-Matrix aus dem Europol Data Retention Matrix Workshops. \r\nIn einer 45-seitigen Tabelle breitet Europol aus, welche Daten sie für relevant für eine neue, EU-weite Vorratsdatenspeicherung halten. Von Standortdaten über IP-Adressen bis hin zu Verbindungsdaten sind nahezu sämtliche Informationen aufgeführt, die Provider demnach längerfristig speichern müssten. Diskutiert wird aber auch über die Speicherung der Länge von Antennen und über Klingeltöne.\r\nEs gibt keine Vorschläge für verhältnismäßige Optionen wie Quick Freeze, Sonderermittlungsdezernate oder ähnliches.\r\n→ Mehr dazu:\r\nhttps://digitalcourage.de/blog/2019/eu-vorratsdatenspeicherung-diese-daten-sollen-gespeichert-werden\r\nhttps://digitalcourage.de/blog/2019/beschraenkte-vorratsdatenspeicherung\r\n\r\n(3)\r\nMehrere EU-Mitgliedsstaaten verlangen vom EU-Gerichtshof eine Revidierung vorheriger, grundrechtefreundlicher Urteile. Anstatt die grundrechlichen Grenzen für Massenüberwachung zu akzeptieren, greifen die Regierungen der EU-Länder diese Grenzen an.\r\n→ Mehr dazu:\r\nhttps://digitalcourage.de/blog/2019/achtung-vorratsdatenspeicherung-es-wird-ernst\r\n\r\nIn Verbindung mit der geplanten E-Evidence-Verordnung, massiv verschärften Polizeigesetzen und dem derzeitigen Wettbewerb zur Einschränkung von Grundrechten, den sich die Regierungen der EU-Länder aktuell liefern, sind die Pläne für eine flächendeckende Vorratsdatenspeicherung als toxisch für Rechtsstaat und Demokratie zu bewerten.\r\nBezeichnend für eine grundrechtevergessene Politik sind die jüngsten Ereignisse in Deutschland:\r\n\r\nÜberwachung über Ethik: \r\nCDU in Deutschland nutzt den Terror von Halle/Saale \r\nNur einen Tag nach dem Terror-Angriff in Halle/Saale im Oktober diesen Jahres sagte CDU-Innenpolitiker Mathias Middelberg im Deutschlandfunk, dass gegen rechte Hetze im Internet und im Bildungssystem vorgegangen werden müsse. Konkret handeln er und seine Partei jedoch in eine ganz andere Richtung: Sie nutzen den rechten Terror, um Massenüberwachung voranzubringen. Zentral ist dabei die Vorratsdatenspeicherung. Geplant ist aber auch, den in die NSU-Morde verstrickten sogenannten Verfassungsschutzes mit mehr Befugnisse auszustatten sowie der Einsatz von Staatstrojanern, die für den Einsatz von Staatstrojanern benötigt werden.\r\n→ Mehr dazu: Hallo CDU: Vorratsdatenspeicherung und Verfassungsschutz sind nicht die Lösung \r\nhttps://digitalcourage.de/Blog/2019/hallo-cdu-vorratsdatenspeicherung-und-verfassungsschutz-sind-nicht-die-loesung\r\n\r\nMit unserer Kritik an dieser Politik, wenden wir uns an deutsche Parlamentarier und argumentieren: Eine anlasslose Vorratsdatenspeicherung erfasst alles – auch, wer wann in eine Synagoge, eine Moschee, in eine Kirche, in ein Gewerkschaftshaus oder auf eine Demonstration geht.  \r\nWir dürfen nicht vergessen, was schon einmal bitter gelernt wurde: Datensammlungen können tödlich sein. Eine Lehre aus den Verbrechen des deutschen Nationalsozialismus ist, dass die Bevölkerung vor Übergriffen des Staates geschützt werden muss. \r\nAus diesem Grund darf es in Deutschland keinen zentralen Katalog geben, in dem erfasst ist, wer welcher Religion angehört. Das selbe gilt für Parteimitgliedschaften oder die sexuelle Orientierung. Folglich darf es in Rechtsstaaten keine Vorratsdatenspeicherungen von Kommunikationsdaten geben.\r\nDie 1933 gewählte nationalsozialistische Regierung hat auf Vorrat gesammelte Daten genutzt, um gezielt Menschen zu verfolgen, zu inhaftieren und zu töten. Die technisch-organisatorische Grundlage für die systematische Vernichtung von Juden war eine umfangreiche  Datenverarbeitung von Informationen, die kein Staat über die Bürgerinnen und Bürger erfassen darf.\r\n\r\nDie Gefahr von Massenüberwachung lässt sich nicht beschränken\r\nEinschränkungen für den Zugriff auf Vorratsdaten, wie Richtervorbehalte oder minimal beschränkende Vorgaben für Maximal- und Mindestspeicherfristen können die Bevölkerung langfristig vor den Gefahren dieser Massenüberwachung nicht schützen. Denn Überwachungsgesetze werden stets verschärft, aber so gut wie nie zurückgefahren. Eine Partei, die diese Daten nutzen will, wird die Schutzschranken einreißen.\r\n\r\nGibt es auch gute Nachrichten?\r\nDank der existierenden Transparenzgesetze, engagierter Parlamentarier.innen und Aktivist.innen ist die aktuelle Kampagne für Massenüberwachung durchschaubar, ebenso die Ausnutzung von Terror-Angriffen. Unserer Auffassung nach, muss sie als Sicherheitstheater enttarnt werden, denn das Ziel ist Überwachung und nicht Sicherheit. Belegt ist diese Interpretation bereits dadurch, dass grundrechtsfreundliche Optionen für die Verbesserung von Ermittlungs- und Aufklärungsarbeit weder geprüft noch diskutiert werden. Eine Rechtgrundlage für ein Quick-Freeze-Verfahren könnte längst existieren und bei der Kriminalitätsbekämpfung helfen, wird aber von Politiker.innen, denen es um Überwachung geht, blockiert. \r\n\r\nWas ist zu tun?\r\n\r\nIch hoffe, an dieser Stelle aktuelle Beispiele aus unseren kommenden Aktionen präsentieren zu können.\r\n\r\nAus unserer Sicht, kann viel gegen Überwachungspolitik getan werden:\r\n\r\n(1) Sicherheitstheater bei jeder Gelegenheit entlarven\r\n→ mehr dazu unter: „So können Sie auf Sicherheitstheater reagieren“\r\nhttps://digitalcourage.de/sicherheitstheater\r\n\r\n(2) Immer wieder gegen Vorratsdatenspeicherungen argumentieren, beispielseise: im Netz, in der eigenen Partei, Politiker.innen freundlich und sachlich kontaktieren. \r\n\r\n(3) Juristische Arbeit gegen Vorratsdatenspeicherung unterstützen.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 159,
                    "code": "JVMVTH",
                    "public_name": "Friedemann",
                    "biography": "Working with Digitalcourage since 2014: data retention, surveillance & up-to-date hardware.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 204,
                "guid": "3359ab2c-635c-5cce-af51-07b302314a4b",
                "logo": "/media/36c3/images/JUK87C/image.gif",
                "date": "2019-12-29T13:00:00+01:00",
                "start": "13:00",
                "duration": "00:20",
                "room": "Chaos-West Bühne",
                "slug": "JUK87C",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/JUK87C/",
                "title": "Programmieren Lernen für Kids - in Minecraft",
                "subtitle": "",
                "track": "All about computers",
                "type": "Einfacher Slot",
                "language": "de",
                "abstract": null,
                "description": "Viele Kinder lieben „Minecraft“ – sie sind oft richtige Experten in der Welt von Alex und Steve! Diese Begeisterung kann man nutzen, um Neues zu lernen! Das geht nämlich dann am besten, wenn man gar nicht merkt, dass man was lernt, sondern einfach nur etwas Tolles baut und dabei Spaß hat!\r\nInspiriert von dem Talk \"Programmieren in Minecraft\" auf der GPN 2019 habe ich mit dieses Jahr mit über 40 Kindern Workshops durchgeführt, in dem man die Grundkenntnisse des Programmierens in der bunten Klötzchen-Welt von Alex und Steve lernen kann. In meinen Talk möchte ich von Erfahrungen aus diesen Kursen berichten, wie man solche Kurse am besten aufbaut und strukturiert, was gut funktioniert, wie man Aufgaben spielerisch gestalten kann und das ganze auch technisch einfach im Griff haben kann.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 151,
                    "code": "AJMUCX",
                    "public_name": "Gregor Walter",
                    "biography": "Seit 2 Jahren aktiv beim SearchWing Projekt an Bord!",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 258,
                "guid": "181feefc-1651-5425-ad94-08d34e5696d4",
                "logo": "",
                "date": "2019-12-29T13:30:00+01:00",
                "start": "13:30",
                "duration": "00:20",
                "room": "Chaos-West Bühne",
                "slug": "M8WDGC",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/M8WDGC/",
                "title": "Wie man ein klimafreundliches Haus baut",
                "subtitle": "",
                "track": "Klimakatastrophe",
                "type": "Einfacher Slot",
                "language": "de",
                "abstract": null,
                "description": "Description: Heizung von Häusern ist für etwa ein Drittel der Treibhausgasemissionen Deutschlands verantwortlich. Dabei gibt es bessere Möglichkeiten als einfach irgendeinen Brennstoff anzuzünden. Dieses Problem muss und kann gelöst werden. Der Vortrag beschreibt Möglichkeiten, komfortabel zu bewohnende Häuser fast ohne Heizung zu bauen. In diesem Vortrag werden nur neu zu bauende Gebäude betrachtet. Die gezeigten Methoden sind für Wohn- und Nichtwohngebäude aller Größen verwendbar.\r\n\r\nEs geht um folgende Details:\r\n* Wärmeverluste: Wo geht die Wärme raus? Wo müssen wir also ran?\r\n* Zuerst isolieren: Wände, Fenster, Dach, Boden\r\n* Dann Wärme zurückgewinnen: Maschinelle Lüftung mit Wärmerückgewinnung\r\n* Vorhandene Wärme nutzen: Solare und innere Gewinne\r\n* Restwärmebedarf und Warmwasser erzeugen\r\n* Wie lebt es sich darin? Thermoskannengefühl oder komfortabel?, Langzeiterfahrungen\r\n* Standards: KfW-Effizienzhaus, Passivhaus, Efffizienzhaus-Plus\r\n* \"Free Money\": Heizkosten, Mehrkosten und Zuschüsse beim Bau in Deutschland\r\n* Warum nicht einfach erneuerbare Energie für die Wärmeerzeugung nehmen?",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 205,
                    "code": "EJ93LC",
                    "public_name": "Gunnar Thöle",
                    "biography": "Bitte ergänzen",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 251,
                "guid": "626da982-aac8-5eca-9577-826e0a825049",
                "logo": "",
                "date": "2019-12-29T14:00:00+01:00",
                "start": "14:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "LF3YYH",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/LF3YYH/",
                "title": "Public Money? Public Code! A campaign framework to promote software freedom",
                "subtitle": "",
                "track": "The real basic about Bits and Nibbles",
                "type": "Doppelter Slot",
                "language": "en",
                "abstract": null,
                "description": "Do you want to promote Free Software in public administrations? Then the campaign framework of \"Public Money? Public Code!\" might be the right choice for you; no matter if you want to do it as an individual or as a group; no matter if you have a small or large time budget. \r\n\r\nMore than 170 organisations, and more than 26,000 individuals demand that publicly financed software should be made publicly available under Free Software licenses. Together we contacted politicians and civil servants on all levels -- from the European Union and national governments, to city mayors and the heads of public libraries about this demand. This did not just lead to important discussions about software freedom with decision makers, but also already to specific policy changes.\r\n\r\nIn the talk, we will explain how the campaign framework including the website publiccode.eu, the videos, the open letter, the expert brochure,and example letters can be used to push for the adoption of Free Software friendly policies in your area; be it your public administration, your library, your university, your city, your region, or your country.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 201,
                    "code": "GBQW73",
                    "public_name": "Bonnie Mehring",
                    "biography": "Bitte nachtragen",
                    "answers": []
                  },
                  {
                    "id": 173,
                    "code": "Y3LKK7",
                    "public_name": "Matthias Kirschner",
                    "biography": "Matthias Kirschner is President of FSFE. In 1999 he started using GNU/Linux and realised that software is deeply involved in all aspects of our lives. Matthias is convinced that this technology has to empower society not restrict it. While studying Political and Administrative Science he joined FSFE in 2004.\r\n\r\nHe helps other organisations, companies and governments to understand how they can benefit from Free Software -- which gives everybody the rights to use, understand, adapt and share software -- and how those rights help to support freedom of speech, freedom of press or privacy.\r\n\r\nMatthias loves playing with his children, and in his spare time assists in wilderness first aid seminars, enjoys comics like XKCD and Transmetropolitan; and Die Ärzte.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 174,
                "guid": "56a5c6da-625b-55e0-a919-647418670069",
                "logo": "/media/36c3/images/PQALSP/circus_logo_transparent.png",
                "date": "2019-12-29T16:00:00+01:00",
                "start": "16:00",
                "duration": "00:20",
                "room": "Chaos-West Bühne",
                "slug": "PQALSP",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/PQALSP/",
                "title": "CTF in a box",
                "subtitle": "",
                "track": "All about computers",
                "type": "Einfacher Slot",
                "language": "en",
                "abstract": null,
                "description": "A situation loads of passionate CTF players will recognize: You are bored and looking up some CTF on ctftime. You finally find one and it's hosted on some fork of CTFd running on what feels like a raspberry pi 1. Notherless, you decide to play, but the first web challenge you look at has a conveniently placed php shell in the webroot. Yay! one shared web service!. After we had the same issue with multiple platforms, we decided that this had to change. The main problems we noticed were that all players compete on one service or receive a static challenge and that the platforms don't always scale well. We solved this in a new project: CIRCUS. This is the story of what can break when unleashing a lot of people on a service allowing them to spawn containers on demand and what can be done to counteract those problems.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 122,
                    "code": "SVETJC",
                    "public_name": "hanemile",
                    "biography": "CS: @hhu_de | Foo: @chaosdorf | CTF: @flexerilla_team | Go, Python | est. 0x7d0\r\n\r\nSimulating Galaxies, Honeypot fanatic, operating a CIRCUS, ...",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 187,
                "guid": "fe422b75-92b5-5d69-a3ba-0fad356de0aa",
                "logo": "",
                "date": "2019-12-29T16:30:00+01:00",
                "start": "16:30",
                "duration": "00:20",
                "room": "Chaos-West Bühne",
                "slug": "WYZGGQ",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/WYZGGQ/",
                "title": "X11 and Wayland: A tale of two implementations",
                "subtitle": "",
                "track": "All about computers",
                "type": "Einfacher Slot",
                "language": "en",
                "abstract": null,
                "description": "In this talk I will outline my journey implementing my X11 window manager `hikari` and the corresponding Wayland compositor shortly after. `hikari` is a stacking window manager/compositor with some tiling capabilities. It is still more or less work in progress and currently targets FreeBSD only but will be ported to Linux and other operating systems supporting Wayland once it has reached some degree of stability and feature completeness.\r\n\r\n     \r\nThis talk covers:     \r\n     \r\n* a brief explanation regarding differences between X and Wayland     \r\n* some of `hikari`'s design goals and motivation     \r\n* choice of programming language     \r\n* an overview of libraries that were used     \r\n* tools for ensuring code quality and robustness     \r\n* obstacles     \r\n* resources that helped me to implement the whole thing",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 131,
                    "code": "QJCAQX",
                    "public_name": "raichoo",
                    "biography": "I mainly do Haskell and FreeBSD, I contribute to Open Source projects I use. You might know me from movies like…",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 248,
                "guid": "4b80f175-0c42-53e6-911d-2445cc25fd59",
                "logo": "",
                "date": "2019-12-29T17:00:00+01:00",
                "start": "17:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "R33ZSA",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/R33ZSA/",
                "title": "Sexualisierter Gewalt und die Verantwortung von Gesellschaft und Communities",
                "subtitle": "",
                "track": "Nicht Computers",
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": null,
                "description": "Sexualisierte Gewalt ist Alltag in Deutschland. Leider. „Laut einer deutschlandweiten Repräsentativstudie erlebt jede 7. Frau in Deutschland im Lauf ihres Lebens strafrechtlich relevante sexualisierte Gewalt. 60% aller Frauen in Deutschland haben sexuelle Belästigung erlebt.\" schreibt der Bundesverbands Frauenberatungsstellen und Frauennotrufe. \" Jährlich werden der Polizei 11.000 Fälle sexuellen Missbrauchs von Kindern bekannt. Die Dunkelziffer im Bereich sexualisierter Gewalt ist hoch.“ (https://www.frauen-gegen-gewalt.de/de/was-ist-das-187.html) Sexualisierte Gewalt geht in den seltensten Fällen von Fremden aus, meist wird sie durch Personen aus dem Bekannten- und Familienkreis ausgeübt.\r\nViel zu kurz kommt hingegen die Auseinandersetzung mit dieser Thematik, mit den Folgen für Betroffene, Möglichkeiten der Prävention und der Unterstützung von Betroffenen. Auf gesellschaftlicher Ebene, aber auch in Communities. Das Ausmaß sexualisierter Gewalt ist seit Jahrzehnten unverändert. Sexualisierte Gewalt ist nach wie vor ein Tabuthema - und das macht es so schwierig, etwas zu verändern. Es ist wichtig, das Schweigen zu durchbrechen und Betroffenen* Angebote zur Unterstützung zu machen. Hier stehen wir alle in der Verantwortung, auch in der Chaos-Community.\r\nIndem wir eine Atmosphäre schaffen, in der über Erfahrungen mit sexualisierter Gewalt geredet werden kann, können wir Betroffene in der Bearbeitung unterstützenund insgesamt zur Sensibilisierung beitragen. Gruppen zur Unterstützung Betroffener und Awarenessgruppen sind eine Möglichkeit, um Betroffene von sexualisierter Gewalt zu stärken und ein Bewusstsein für Veränderung zu schaffen. Professionelle Organisationen klären auf, beraten und begleiten Betroffene.  \r\nHacken ist nicht ausschließlich eine technische, sondern auch eine politische und soziale Aktion und ebenso eine interaktive Handlung. Lasst uns die Tabuisierung des Themas sexualisierte Gewalt hacken und zusammen daran arbeiten, unsere Community zu einem besseren Ort zu machen.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 192,
                    "code": "REJYAY",
                    "public_name": "Ann",
                    "biography": "Ann Wiesental ist Autorin des Buches \"Antisexistische Awareness: Ein Handbuch\", Unrast Verlag und Mitautortin des Buches \"Was tun bei sexualisierter Gewalt?\" Handbuch für eine Transformative Arbeit mit gewaltausübenden Personen, RESPONS, Unrast Verlag\r\nSie hat verschiedene Awarenessgruppen mitgegründet und macht seit Jahren Unterstützungsarbeit auf großen Festivals, auf Partys und begleitet Betroffene* über einen längeren Zeitraum.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 180,
                "guid": "07d665c5-5009-59fa-965d-1345a2822db5",
                "logo": "",
                "date": "2019-12-29T18:00:00+01:00",
                "start": "18:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "AFYZ3V",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/AFYZ3V/",
                "title": "Linux auf dem Desktop",
                "subtitle": "",
                "track": "The real basic about Bits and Nibbles",
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": null,
                "description": "2019 ist das Jahr des Linux auf dem Desktop!\r\n\r\nIch zeichne gerne Architekturdiagramme auf Whiteboards während dem [Pythonfoo](https://wiki.chaosdorf.de/Pythonfoo) im [Chaosdorf](https://chaosdorf.de). Weil daran anscheinend allgemeines Interesse besteht, habe ich in den letzten Monaten unregelmäßig die aktuellen Konzepte von modernen Desktop-Linux-Distributionen erklärt im Rahmen des [Freitagsfoo](https://wiki.chaosdorf.de/Freitagsfoo).\r\n\r\nDies richtet sich hauptsächlich an Leute, die Linux oder irgendein BSD benutzen - ich habe von Windows oder macOS leider wenig Ahnung und werde in die Richtung daher wohl eher weniger Querverweise machen können. Ich hoffe, das ist trotzdem interessant - oder es dauert wenigstens nicht zu lange.\r\n\r\nLeute, die vollständige moderne Desktopumgebungen benutzen, erfahren wie das eigentlich hinter den Kulissen alles funktioniert. Leute mit Arch+i3 lernen, was ihnen fehlt bzw. wie sie das nachrüsten können.",
                "recording_license": "",
                "do_not_record": true,
                "persons": [
                  {
                    "id": 47,
                    "code": "WLYDWU",
                    "public_name": "ytvwld",
                    "biography": "Ich mache Dinge im Chaosdorf, hauptsächlich mit Software. Und ich rede (zu) viel.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 254,
                "guid": "8e581acd-efbb-5bd7-a5a8-b32a75eca8ec",
                "logo": "",
                "date": "2019-12-29T19:00:00+01:00",
                "start": "19:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "MAFMDL",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/MAFMDL/",
                "title": "Die Ereignisse in Hong Kong - Der Versuch einer Zusammenfassung",
                "subtitle": "",
                "track": "Nicht Computers",
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": null,
                "description": "Was passiert überhaupt, wo und warum eigentlich? Diese Frage habe ich mir im Frühsommer diesen Jahres gestellt und da Twitter sich zwar \r\nsehr gut zur schnellen Verbreitung von Nachrichten, aber nicht zur längeren Archivierung eignet, habe ich angefangen für mich \r\nInformationen zu sammeln. Daraus entstanden ist eine relativ große Sammlung an Fotos, Tweets, Vides/Livestreams und aufgeschriebenen \r\nErfahrungen und Meinungen, von Menschen, die da waren oder noch sind zu vielen verschiedenen Themen. Was waren eigentlich die Auslöser der Proteste? Aus welchen gesellschaftlichen und politischen Gruppierungen speisen sich die Proteste? Wie lief die Mobilisierung? Was gab es für Probleme und wie wurde mit ihnen umgegangen? Dieser Vortrag wird ein, sehr grober und garantiert unvollständiger, Versuch eines Überblicks um Menschen den Einstieg in die Thematik zu erleichtern und ein kleiner Appell, sich in Zeiten in denen immer mehr Menschen nach rechts rücken und die Welt immer unfreier wird, sich auch mal mit Ereignissen zu beschäftigen, die einen vermeintlich nicht betreffen (Kleiner Spoiler: tun sie meißtens doch, weil die Errosion von Grund-, Menschen-, und Freiheitsrechten uns halt doch alle angehen auch, wenn es in knapp 9000 Kilometern Entfernung passiert.).",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 171,
                    "code": "YPMTZT",
                    "public_name": "raketenlurch",
                    "biography": "Macht was mit Computern und Politik und hat deswegen oft schlechte Laune.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 199,
                "guid": "0968ef0d-4e19-5751-94f4-f24b8b9758a3",
                "logo": "/media/36c3/images/83YJMS/Digitalcourage_Sicherheitstheater_-_Aufkleber_bahnsteigkarte.jpg",
                "date": "2019-12-29T20:00:00+01:00",
                "start": "20:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "83YJMS",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/83YJMS/",
                "title": "Aus Sicherheitsgründen muss das Grundgesetz leider abgeschafft werden - Schluss mit dem Sicherheitstheater",
                "subtitle": "",
                "track": "Antifaschimus",
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": null,
                "description": "Die Gleichsetzung von Sicherheit und Repression ist gefährlich. Erstens werden damit Grundrechtseinschnitte gerechtfertigt, die uns in Gefahr bringen. Zweitens unterbleiben wichtige Maßnahmen, die wirklich der Sicherheit dienen würden.\r\n\r\nWas in Politik und Wirtschaft als „Sicherheit“ verkauft wird, ist reines Puppentheater. Menschen wird Angst eingeredet, um diese Angst sodann mit Repression und Überwachung zu „beruhigen“. Sicherheit und Freiheit bedingen sich gegenseitig. Eine Politik, die Freiheit angreift und scheibchenweise verhökert, verdient nicht „Sicherheitspolitik“ genannt zu werden. Sie ist reines Theater und einer Demokratie nicht würdig. Schlimmer noch: Sie leistet einem autoritären Gedankengut Vorschub, das uns garantiert nicht sicher macht. \r\n\r\nDer Vortrag widmet sich einerseits der Erklärung, weshalb diese Gleichsetzung gefährlich ist: Überwachung hilft gar nicht, hat gefährliche Nebenwirkungen und zersetzt den größten Garanten für unsere Sicherheit, die Freiheit.\r\n\r\nZum anderen geht es um die Frage, welche Maßnahmen wirklich sinnvoll wären. Das fängt bei einem echten Kampf gegen den Faschismus an, geht über unabhängige Kontrolle der Polizei, Klimaschutz, Verkehrspolitik und endet nicht erst in der Forderung nach einer besseren Regulierung von Antibiotika.\r\n\r\nEs ist wichtig, dass der Wunsch nach Sicherheit nicht weiter instrumentalisiert wird. Repression ist gefährlich und dient nun wirklich nicht der Sicherheit. Besonders wütend sollte uns das machen, wenn gleichzeitig lange nötige Maßnahmen, beispielsweise beim Kampf gegen Rechts oder gegen digitale Gewalt unterbleiben. Denn hier sind wir wirklich in Gefahr.\r\n\r\nDieses ewige \"aus Sicherheitsgründen\" muss endlich ein Ende haben. Wir können mithelfen, indem wir uns einen Spaß machen und die Begründung genau so inflationär benutzen, wie die Politik. Einfache Begründungen können wir schließlich alle gebrauchen. Und wenn es um Sicherheit geht, wird ja wohl niemand diskutieren wollen. Wir üben das mal gemeinsam: Aus Sicherheitsgründen sollten sich alle diesen Vortrag ansehen.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 144,
                    "code": "FJ8PMN",
                    "public_name": "Leena Simon",
                    "biography": "Ich bin graduierte Philosophin, mit dem Hauptthema Netzphilosophie (= Technikphilosophie) und speziell Digitale Mündigkeit, an dem ich seit meinem Studium (Beginn 2004), aber so richtig seit 2009 herumforsche. Zum Thema [Digitale Mündigkeit](https://muendigkeit.digital) habe ich auf dem 29C3 bereits einen [Vortrag](https://media.ccc.de/v/29c3-5179-de-en-hacking_philosophy_h264) gehalten. \r\n\r\nMit [Digitalcourage](https://digitalcourage.de) mache ich häufig inhaltliche Projekte um Argumente zu schärfen.\r\nFür das [Anti-Stalking-Projekt](https://anti-stalking-projekt.de) arbeite ich als IT-Beraterin. Dort erlebe ich tagtäglich welches Drama sich auf den Geräten der „ganz normalen Menschen“ abspielt, und übe mich darin Computerthemen in einfacherer Sprache rüberzubringen. Außerdem halte ich Fortbildungen und Vorträge zur Digitalen Selbstverteidigung.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 212,
                "guid": "46015fa7-8746-5997-9cae-3aee08dca254",
                "logo": "/media/36c3/images/PGHLLG/kleinquer.png",
                "date": "2019-12-29T21:00:00+01:00",
                "start": "21:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "PGHLLG",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/PGHLLG/",
                "title": "Feierliche Verlesung des gesammelten Ärgers",
                "subtitle": "",
                "track": "Spiele sind wichtig für die Revolution!",
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": null,
                "description": "**Anger Exchange Point — MIT ÄRGER-GARANTIE!** \r\n\r\nWir halten, was wir versprechen!\r\n\r\nHaben Sie sich geärgert?\r\nKein Klopapier mehr da? Zu viele Menschen? Versehentlich etwas dummes gesagt? Die Klimakatastrophe rollt unaufhaltsam auf uns zu und niemand tut etwas? \r\n\r\nÄrgerlich, oder?\r\nAber es ist doch viel schöner, wenn sich jemand anderes ärgert! Am AEP in der Haecksen-Assembly gibt es die ÄRGER-GARANTIE! Wir garantieren: Über jeden Ärger wird sich einmal¹ geärgert! \r\n\r\nIn dieser eigens für Sie konzipierten Veranstaltung lösen wir unser Versprechen an Sie ein: Die übriggebliebenen Ärger werden verlesen und professionell zerärgert.\r\n**Hier wird Ihr Ärger gewürdigt!** Für allen übriggebliebenen Ärger haben die Haecksen zwei international führende Ärgerinnen engagiert, um speziell auf Ihren Ärger einzugehen! \r\n\r\nMit Zeit-Zurück-Garantie²!\r\n\r\n\r\n*****\r\n\r\n¹ Abweichungen innerhalb einer Größenordnung vorbehalten.\r\n\r\n² investierte Zeit wird vom 01. bis zum 06.01.2020 auf dem Messegelände Leipzig zurückerstattet oder für die Verwendung des AEP vom 10. bis zum 13.04.2020 gutgeschrieben.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 155,
                    "code": "VYEZFD",
                    "public_name": "Piko",
                    "biography": "Piko von den Haecksen kümmert sich beruflich um laute Dinge. Ziel ist meistens, sie noch lauter zu machen.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 169,
                "guid": "8b754f19-169e-55f9-a938-2515efe90f81",
                "logo": "/media/36c3/images/AK87QJ/MODcard.png",
                "date": "2019-12-29T22:00:00+01:00",
                "start": "22:00",
                "duration": "01:50",
                "room": "Chaos-West Bühne",
                "slug": "AK87QJ",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/AK87QJ/",
                "title": "Die Dönerwaffel Show",
                "subtitle": "",
                "track": "Spiele sind wichtig für die Revolution!",
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": "\"Pervers aber Geil!\"\r\n=================\r\n\r\nSo wurde damals am 35c3 die aller erste Dönerwaffel™ des C3WOC bezeichnet.\r\n\r\nNun feiern wir ein Jahr Jubiläum.\r\n\r\n\r\n<!-- Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet.   \r\n\r\nDuis autem vel eum iriure dolor in hendrerit in vulputate velit esse molestie consequat, vel illum dolore eu feugiat nulla facilisis at vero eros et accumsan et iusto odio dignissim qui blandit praesent luptatum zzril delenit augue duis dolore te feugait nulla facilisi. Lorem ipsum dolor sit amet, -->",
                "description": "\"Pervers aber Geil!\"\r\n=================\r\n\r\nSo wurde damals am 35c3 die aller erste Dönerwaffel™ des C3WOC bezeichnet.\r\n\r\nNun feiern wir ein Jahr Jubiläum.\r\n\r\n> \"Es schmeckt nach Garten. \r\n> Aber ansonsten ist es interessant!\r\n> Mein Gehirn kann sich nicht entscheiden was es gerade schmeckt...\r\n> Da ist Rum drin?\r\n> Es hat Potential!\"\r\nDas ist eine Einschätzung zu der Dönerwaffel  von Obelix!\r\n\r\nZum Dönerwaffeljubiläum laden wir einige Gäste ein und arbeiten die Geschichte der Dönerwaffel auf.\r\n\r\nSelbstverständlich mit Selbstversuchen, realistischen Beispielen und Liveschaltung.\r\n\r\n<!-- Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet.   \r\n\r\nDuis autem vel eum iriure dolor in hendrerit in vulputate velit esse molestie consequat, vel illum dolore eu feugiat nulla facilisis at vero eros et accumsan et iusto odio dignissim qui blandit praesent luptatum zzril delenit augue duis dolore te feugait nulla facilisi. Lorem ipsum dolor sit amet, Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet.   \r\n\r\nDuis autem vel eum iriure dolor in hendrerit in vulputate velit esse molestie consequat, vel illum dolore eu feugiat nulla facilisis at vero eros et accumsan et iusto odio dignissim qui blandit praesent luptatum zzril delenit augue duis dolore te feugait nulla facilisi. Lorem ipsum dolor sit amet, Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet. Lorem ipsum dolor sit amet, consetetur sadipscing elitr, sed diam nonumy eirmod tempor invidunt ut labore et dolore magna aliquyam erat, sed diam voluptua. At vero eos et accusam et justo duo dolores et ea rebum. Stet clita kasd gubergren, no sea takimata sanctus est Lorem ipsum dolor sit amet.   \r\n\r\nDuis autem vel eum iriure dolor in hendrerit in vulputate velit esse molestie consequat, vel illum dolore eu feugiat nulla facilisis at vero eros et accumsan et iusto odio dignissim qui blandit praesent luptatum zzril delenit augue duis dolore te feugait nulla facilisi. Lorem ipsum dolor sit amet, -->",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 117,
                    "code": "DHUGJ3",
                    "public_name": "Dampfkadse",
                    "biography": "ich war nie gut in Bio",
                    "answers": []
                  },
                  {
                    "id": 116,
                    "code": "LJHGFB",
                    "public_name": "L3D",
                    "biography": "Datenreisender vom Bodensee.\r\nMacht manchmal bei diesem [C3WOC](https://c3woc.de) mit.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 265,
                "guid": "0bb8fde0-0b12-54a1-9199-e52520d9e9b6",
                "logo": "",
                "date": "2019-12-30T00:00:00+01:00",
                "start": "00:00",
                "duration": "04:00",
                "room": "Chaos-West Bühne",
                "slug": "XLFXYN",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/XLFXYN/",
                "title": "Monoschwarz aka. Alle Farben",
                "subtitle": "",
                "track": "Klangteppich",
                "type": "Klangteppich",
                "language": "en",
                "abstract": null,
                "description": "",
                "recording_license": "",
                "do_not_record": true,
                "persons": [
                  {
                    "id": 85,
                    "code": "XVCJLF",
                    "public_name": "Chaos-West",
                    "biography": null,
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              }
            ],
            "Workshop": [
              {
                "id": 344,
                "guid": "312560c7-7ce7-5c81-97b4-7692b2d9a240",
                "logo": "/media/36c3-oio/images/HHZQAY/meetup_1920_ssHGXLa.png",
                "date": "2019-12-29T13:50:00+01:00",
                "start": "13:50",
                "duration": "02:00",
                "room": "Workshop",
                "slug": "HHZQAY",
                "url": "https://talks.oio.social/36c3-oio/talk/HHZQAY/",
                "title": "Open Communication Meetup! - Adhoc mesh routing protocols",
                "subtitle": "",
                "track": null,
                "type": "Workshop 2 hours",
                "language": "en",
                "abstract": "We will discuss and document mobile ad-hoc mesh routing protocols.",
                "description": "The goal behind [open-communication.net](https://open-communication.net) is to build a knowledge base on open decentralized communication tools. This is done collectively and collaboratively in 'Open Communication Meetups'.\r\n\r\nIn this meetup we will discuss and document existing open and decentralized mesh routing protocols. \r\n\r\nhttps://open-communication.net",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 120,
                    "code": "G78ZPE",
                    "public_name": "Mathias Jud",
                    "biography": "Mathias Jud is a berlin based artist. Since over twenty years, he works together with Christoph Wachter.\r\nTheir art works include open-source projects that uncover forms of censorship of the Internet, undermine the concentration of political power and even resolve the dependency on infrastructure.\r\n\r\nhttps://www.wachter-jud.net/",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 349,
                "guid": "c8793eb8-53be-5a90-b549-f5789da4d174",
                "logo": "/media/36c3-oio/images/PATB9E/lynXified-amirouche-anonymous-v3_C4S2fqs.png",
                "date": "2019-12-29T16:00:00+01:00",
                "start": "16:00",
                "duration": "01:00",
                "room": "Workshop",
                "slug": "PATB9E",
                "url": "https://talks.oio.social/36c3-oio/talk/PATB9E/",
                "title": "GNUnet e.V. annual assembly",
                "subtitle": "",
                "track": null,
                "type": "Workshop 1 hour",
                "language": "en",
                "abstract": "https://gnunet.org/ e.V. annually meets to discuss all things GNUnet e.V.-related (including finances, elections, and community update). The full agenda will be determined closer to the event.",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 123,
                    "code": "JXPKXS",
                    "public_name": "Christian Grothoff",
                    "biography": "https://grothoff.org/christian/",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 355,
                "guid": "6d1b8adb-0f77-5693-a768-fabf2c252929",
                "logo": "/media/36c3-oio/images/VHZQKJ/LoRaWAN5_apfiK6P.png",
                "date": "2019-12-29T17:10:00+01:00",
                "start": "17:10",
                "duration": "02:00",
                "room": "Workshop",
                "slug": "VHZQKJ",
                "url": "https://talks.oio.social/36c3-oio/talk/VHZQKJ/",
                "title": "Getting started connecting your Devices using LoRaWAN",
                "subtitle": "",
                "track": null,
                "type": "Workshop 2 hours",
                "language": "en",
                "abstract": "LoRaWAN is a **Lo**ng **Ra**nge **W**ide **A**rea **N**etwork that can connect devices over several kilometres while operating on very low power. It uses freely available frequencies, and with successful community project *The Things Network* there exists an open and free network. This makes LoRaWAN ideal for that small gadgets you want to deploy out in the field and also really interesting for a hacker community. Let's get working on it!",
                "description": "We will be going through the whole process of how to build, program, and setup a simple LoRaWAN connected device using an *Arduino* and *The Things Network*. The workshop will start with an introduction to how LoRaWAN works, but the session is planed to be a more interactive format where we get a bit of work done together.\r\n\r\nIf you need an introduction, why LoRaWAN is interesting, you can watch our 20min talk from last year: <br>\r\nhttps://media.ccc.de/v/35c3chaoswest-27-long-range-radio-communication-for-everyone-using-lorawan-\r\n\r\nIf you want to know how you can come prepared, go to: <br>\r\nhttps://www.deepcyber.de/36c3/lorawan",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 129,
                    "code": "YRX8PJ",
                    "public_name": "Peer Springstübe",
                    "biography": "Have done my Diploma in Informatik (that's *Computer Science* in Germany) and got a side order of Physics and Philosophy with it. Tried out robotics and deep learning while at university. I am now working with a company that does industrial IoT focused on NB-IoT and LoRaWAN. \r\n\r\nI am heavily involved with [deep cyber](https://www.deepcyber.de) &ndash; check out our assembly at 36c3!",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 385,
                "guid": "f3e731fa-1a62-5238-969a-7f28e5812334",
                "logo": "",
                "date": "2019-12-29T20:50:00+01:00",
                "start": "20:50",
                "duration": "01:00",
                "room": "Workshop",
                "slug": "8PGUXK",
                "url": "https://talks.oio.social/36c3-oio/talk/8PGUXK/",
                "title": "Global Innovation Gathering meetup",
                "subtitle": "",
                "track": null,
                "type": "Workshop 1 hour",
                "language": "en",
                "abstract": "The Global Innovation Gathering (GIG) is a diverse community of innovation hubs, makerspaces, hackerspaces and other grassroot innovation community spaces and initiatives as well as individual innovators, makers, technologists and changemakers.\r\n\r\nWith strong roots in the global south, we share, collaborate and work together globally. GIG provides a platform for meaningful exchange by fostering knowledge exchange and collaboration between its members. We have a non-profit organisation registered in Germany.\r\n\r\nGIG is pursuing a new vision for global cooperation based on equality, openness and sharing. We aim to enable more diversity in the production of technology, and global innovation processes and support open and sustainable solutions developed by grassroot innovators.\r\n\r\nWhat can we create together?",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 96,
                    "code": "P3GLDY",
                    "public_name": "Sandra GIG",
                    "biography": "Sandra Mamitzsch baut seit 2018 das Berliner Büro des Global Innovation Gathering e.V., einem globalen Netzwerk von Makern und Innovatoren, auf und beschäftigt sich daher viel damit, wie dezentrale Zusammenarbeit und offene Organisationsformen funktionieren. Hauptsächlich ist sie im Verein für das Horizon2020-Förderprojekt Careables.org verantwortlich, dass innerhalb von Makerspace-Communities dabei hilft, mit offenen Technologien und Co-Design in Gesundheit und Pflege das Leben von Menschen zu verbessern. Von 2012-2017 war sie Programmdirektorin der re:publica und arbeitet dort weiterhin als freie Beraterin und Kuratorin. Nebenbei ist sie Mitglied bei European Digital Rights (EDRi) und beim Digitale Gesellschaft e.V.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              }
            ]
          }
        },
        {
          "index": 5,
          "date": "2019-12-30",
          "day_start": "2019-12-30T06:00:00+01:00",
          "day_end": "2019-12-31T04:00:00+01:00",
          "rooms": {
            "Lecture room 11": [],
            "Seminar room 14-15": [],
            "Seminar room 13": [],
            "Lecture room M1": [],
            "Lecture room M2": [],
            "Lecture room M3": [],
            "Kidspace": [],
            "CCL Saal 3": [],
            "Chaos West Bühne": [],
            "ChaosZone": [],
            "OIO Stage": [
              {
                "id": 356,
                "guid": "6eeb1e22-ff82-54be-af15-08e562eca26f",
                "logo": "",
                "date": "2019-12-30T12:00:00+01:00",
                "start": "12:00",
                "duration": "00:30",
                "room": "OIO Stage",
                "slug": "GGV8G3",
                "url": "https://talks.oio.social/36c3-oio/talk/GGV8G3/",
                "title": "Cryptography of Killing Proof-of-Work [YBTI/wefixthenet session]",
                "subtitle": "",
                "track": null,
                "type": "Talk 20 minutes + 5 minutes Q&A",
                "language": "en",
                "abstract": "We briefly discuss the range of cryptographic primitives being used by protocols that seek to make proof-of-work protocols obsolete. We shall focus primarily on these cryptographic building blocks themselves, not overly on the different protocols built form them.",
                "description": "There are a handful of protocols consuming enormous amounts of energy in proof-of-work schemes, which provide only rather tenuous security assurances. In practice, proof-of-work also invalidates these protocols original goal of being distributed.\r\n\r\nThere is also a zoo of protocols designs, both new and from the 80s, that provide far stronger security than proof-of-work at minimal cost. We shall discuss the distinctive cryptographic primitives used by these protocols, without examining any of these critters too closely.\r\n\r\nIn essence, our taxonomy splits as blind signatures vs. verifiable random functions (VRFs) vs. randomness beacons, with the latter consisting of publicly verifiable secret sharing (PVSS) and verifiable delay functions (VDFs). We only have time for a cursory look at the mathematics usable to build each of these, but this should explain some of their uses, strengths, and weaknesses.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 128,
                    "code": "MCE83P",
                    "public_name": "dvn",
                    "biography": "p2p communications and privacy researcher and developer\r\n\r\nCurrently organizing a \"youbroketheinternet/wefixthenet\" session at 36c3, representing GNUnet.",
                    "answers": []
                  },
                  {
                    "id": 130,
                    "code": "BQ99TB",
                    "public_name": "Jeffrey Burdges",
                    "biography": "Jeff Burdges is an applied cryptography researcher working with the [Web3 foundation](https://research.web3.foundation/en/latest/), where he works on cryptography for decentralized and/or privacy preserving protocols.\r\n\r\nJeff's work often involves collaborative randomness, specialized signature schemes like verifiable random functions (VRFs) or anonymous credentials, and increasingly both zero-knowledge proofs and incentives or mechanism design using VRFs.  Jeff is also researching a peer-to-peer private messaging service that will use mix networks.\r\n\r\nJeff previously worked on [Taler](https://taler.net/en/) and [GNUNet](https://gnunet.org/en/) as a postdoc for Christian Grothoff at Inria, Rennes, where he worked on anonymity protocols primarily mix networks, blind signatures, security proofs, distributed authentication, forward-secure ratchets, and pairing-based protocols.  Jeff holds a PhD degree in Mathematics from Rutgers University in New Jersey.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 380,
                "guid": "9f137ade-314d-5531-9e55-e0020824464a",
                "logo": "",
                "date": "2019-12-30T17:30:00+01:00",
                "start": "17:30",
                "duration": "00:25",
                "room": "OIO Stage",
                "slug": "GM9RV3",
                "url": "https://talks.oio.social/36c3-oio/talk/GM9RV3/",
                "title": "Closing Session",
                "subtitle": "",
                "track": null,
                "type": "Talk 20 minutes + 5 minutes Q&A",
                "language": "de",
                "abstract": "Verabschiedung und Details zum Abbau",
                "description": "",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 7,
                    "code": "USJAK9",
                    "public_name": "Andreas Bräu",
                    "biography": null,
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              }
            ],
            "Chaos-West Bühne": [
              {
                "id": 226,
                "guid": "b546675d-5ca9-5891-9d63-6de8ad98e637",
                "logo": "",
                "date": "2019-12-30T11:00:00+01:00",
                "start": "11:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "CHBLH8",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/CHBLH8/",
                "title": "Datacenter - was wir wissen sollten (und trotzdem oft nicht erfahren)",
                "subtitle": "",
                "track": "The real basic about Bits and Nibbles",
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": null,
                "description": "**Eine Reise zu den Fundamenten der digitalen Welt**. \r\n\r\nWas ist eigentlich ein **Rechenzentrum** und wie funktioniert es? Welche Bedeutung haben **Datacenter** für das Internet und den ganzen digitalen Rest?\r\n**Strom**, **Kühlung** und **Sicherheit** im Überblick. Was muss alles passieren, damit Server, Storages und Netzwerke immer laufen können. \r\nWarum werden die Datacenter immer größer, wo doch die Elektronik immer kleiner wird? Welche Konsequenzen ergeben sich daraus?\r\nWieviel Strom verbraucht eine Suchanfrage oder ein Videostream und warum ist das relevant? \r\nIst Deutschland ein guter Standort für (neue) Rechenzentren und warum?\r\nUnd was hat das alles mit **Klimawandel** und **Nachhaltigkeit** zu tun? \r\nKann es *GreenIT* ohne grüne Datacenter geben? Wie sollten die aussehen? Was muss in den kommenden Jahren geändert werden, damit auch Rechenzentren ihrer Rolle beim globalen CO2-Ausstoß gerecht werden? \r\n\r\nÜberraschende Einblicke in *Planung*, *Bau* und *Betrieb* von großen Rechenzentren.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 172,
                    "code": "VYCFKR",
                    "public_name": "Günter Eggers",
                    "biography": "Schon seit über 25 Jahren bin ich in *Telekommunikation* und *IT* unterwegs. \r\nSeit 2012 sammle ich firmenübergreifenden Erfahrungen in der *Datacenter*-Branche. \r\nMeine Themen sind technische, kommerzielle und auch regulatorische Fragen rund um die Planung und den Betrieb von Rechenzentren. Dazu gehören auch *Energieversorgung* und *Nachhaltigkeit*.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 185,
                "guid": "d59d30e9-5db5-5941-9b23-92bd9cc9f316",
                "logo": "/media/36c3/images/CAVFZP/title.jpg",
                "date": "2019-12-30T12:00:00+01:00",
                "start": "12:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "CAVFZP",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/CAVFZP/",
                "title": "Verbrannte Wörter – Sprache des Nationalsozialismus gestern und heute",
                "subtitle": "",
                "track": "Antifaschimus",
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": null,
                "description": "Sprache schafft Bewusstsein. Als ein Gegenpol zum rechten \"Das wird man doch wohl noch sagen dürfen\"-Narrativ soll es in diesem Vortrag um verbrannte Wörter gehen. Wörter, die durch die Nationalsozialisten derart negativ besetzt wurden, dass ihr Gebrauch wohl überlegt sein will. Dieser Vortrag wird den historischen Kontext zu bestimmten Worten oder Wendungen erklären, sei es zum Beispiel die \"Aktion\", \"asozial\", die \"Überfremdung\" oder \"versifft\". \r\nDen Zuhörenden soll hier dabei geholfen werden, bestimmte nationalsozialistische Denkmuster durch ihre Sprache nicht aktiv zu reproduzieren und dabei helfen, eine geschichtsbewusstere Sprache zu etablieren. An einigen Stellen wird die Analyse von Worten oder Wendungen auch einen klaren Bezug zur Sprache der neuen Rechten in Deutschland enthalten.\r\nDer Vortrag ist als Präsentation konzipiert und wird schrittweise verschiedene Worte genauer analysieren, der Vortrag kann dann im Abschluss aber gerne durch einen etwas längeren Fragenteil abgerundet werden.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 129,
                    "code": "SFLRAB",
                    "public_name": "Bianca Kastl",
                    "biography": "@bkastl\r\n\r\nWebdevelopment als Job, <br/>\r\nAccessibility und Datenschutz immer im Sinn,<br/>\r\nqueer als Mensch, <br/>\r\nund in letzter Zeit stets bemüht, verantwortungsvoll mit der deutschen Geschichte umzugehen, speziell der Zeit des Nationalsozialismus.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 231,
                "guid": "c2a08c53-3f8b-533e-8ec3-764a7ef9c5bb",
                "logo": "",
                "date": "2019-12-30T13:00:00+01:00",
                "start": "13:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "ZQP3NG",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/ZQP3NG/",
                "title": "The dire Reality of the Climate Crisis",
                "subtitle": "",
                "track": "Klimakatastrophe",
                "type": "Doppelter Slot",
                "language": "en",
                "abstract": null,
                "description": "Heat waves, wildfires and new movements like Fridays for Future and Extinction Rebellion have brought the climate crisis back into the news. If the world continues to emit greenhouse gases like today, the world will heat up by at least 3 degree celsius, potentially much more. Yet despite increased attention for the climate crisis no political action even remotely sufficient to tackle the problem is in sight.\r\n\r\nThe talk will give a brief overview of the state of the science of climate change, the politics and the scale of the challenge. It'll also give an overview of some - more or less scientific - worst case predictions that sometimes lead to claims that it's just \"too late to do something\", which may become a new form of justification for not doing anything.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 169,
                    "code": "WSXYRQ",
                    "public_name": "Hanno Böck",
                    "biography": "Hanno is a tech journalist and IT security professional. He regularly writes for Golem.de and is the author of the monthly Bulletproof TLS Newsletter. He has discovered various security vulnerabilities in the past.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 176,
                "guid": "9da34e1b-b51c-5c43-9769-a71ae015028b",
                "logo": "",
                "date": "2019-12-30T14:00:00+01:00",
                "start": "14:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "GVQMJW",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/GVQMJW/",
                "title": "Technische Kompetenzen vermitteln - nur wie?",
                "subtitle": "",
                "track": "The real basic about Bits and Nibbles",
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": null,
                "description": "Während Marketingabteilungen mit Buzzwords wie \"KI\", \"IoT\" und \"Blockchain\" um sich werfen, schütteln die meisten hier den Kopf. Und womit? Mit Recht. Vielen Anwender*innen und polizischen Entscheidungsträger*innen fehlt es aber schlicht an technischer Kompetenz, um Probleme wie Stalkerware, politische Einflussnahme durch soziale Medien und Algorithmen(ethik) im Kern zu begreifen.\r\n\r\nAber wie können wir die Erfahrungen und das Wissen in dieses Draußen vermitteln, um den Menschen eine Chance zu geben, nicht bei jeder kleinsten Gelegenheit auf die Dummschwätzer reinzufallen? Wie können wir positiv Einfluss nehmen auf die Gesellschaft, damit informierte Entscheidungen überhaupt möglich sind? Wie kriegen wir vermittelt, was technisch bereits alles möglich ist und was (noch) nicht?\r\n\r\nIn vier Jahren PrivacyWeek haben wir die Themenbreite der \"Digitalisierung\" (BINGO!) mehrfach durchgearbeitet und gemeinsam mit den Vortragenden kommen wir immer wieder zum selben Schluss: Es braucht mehr Aufklärung und technische Kompetenz in der Bevölkerung, um die Probleme, die die weltweite Vernetzung mit sich bringt, überhaupt zu begreifen und ihnen begegnen zu können. Und letztlich bleibt die Frage, wo wollen wir als CCC letztlich hin? Wie können wir einen Informationstransfer forcieren, der über einige im eigenen Saft kochenden Initiativen hinausgehnt? Und wollen wir das überhaupt?\r\n\r\nEine Zusammenstellung der inhaltlichen Learnings von vier Jahren PrivacyWeek.",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 37,
                    "code": "SGAYBT",
                    "public_name": "jinxx",
                    "biography": "Klaudia Zotzmann-Koch, aka jinxx, ist Autorin, Podcasterin und Datenschutzexpertin. Seit Ende 2015 ist sie aktiv im Chaos und seit 2016 in der Kernorga der jährlichen PrivacyWeek in Wien. Sie ist aktiv bei Chaos macht Schule beteiligt, hält Workshops für Vereine, NGOs und Firmen, gibt Kurse zu Medienkompetenz an der VHS und schreibt Sachbücher im Bereich Datenschutz.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 233,
                "guid": "86094db0-3c31-5eae-8c4a-85b03d191069",
                "logo": "/media/36c3/images/JYS88M/talk_image.jpeg",
                "date": "2019-12-30T16:00:00+01:00",
                "start": "16:00",
                "duration": "00:50",
                "room": "Chaos-West Bühne",
                "slug": "JYS88M",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/JYS88M/",
                "title": "Lithium-Ion Batteries: Why do they work? Do they even work?? And why do they get so angery when you poke them?",
                "subtitle": "",
                "track": "Nicht Computers",
                "type": "Doppelter Slot",
                "language": "en",
                "abstract": null,
                "description": "Lithium-Ion batteries are everywhere and are here to stay. They're wonderful to bring mechanical and electronic creations to life, but can also be dangerous if one is not careful with them. Many come with dedicated protection features or at least claim to do so, while others rely on different features to make them safe. Due to how the materials are sourced and which materials are used the environmental and geopolitical factor of them also can’t be neglected.\r\nThis talk is for you if you're someone tinkering with electronics or if you're just curious and want to know more about the strange creatures batteries are.\r\n\r\nThis is an introduction and overview, covering the essentials of:\r\n- Safety, or how to not burn your house down\r\n- Chemistries and why some can perfectly cope at -40°C and others won't\r\n- Failure is optional and why some just don't burn or explode\r\n- The major do's and dont's\r\n- Charging, Discharging and why is it empty it said 20% left\r\n- Recycling and when you can and when you shouldn't reuse old batteries\r\n- Ethics and politics\r\n- What does the future hold?",
                "recording_license": "",
                "do_not_record": false,
                "persons": [
                  {
                    "id": 179,
                    "code": "3RK3QW",
                    "public_name": "ln",
                    "biography": "I'm a maker, tinkerer and recovering infosec addict now on a path to build better electronics. With the help of others I'm trying to build a collective of hackers to build hardware and software for a better and more repairable future.",
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              },
              {
                "id": 263,
                "guid": "5f831695-3b2e-55d0-aaf9-1ec4d05c0605",
                "logo": "",
                "date": "2019-12-30T17:10:00+01:00",
                "start": "17:10",
                "duration": "01:00",
                "room": "Chaos-West Bühne",
                "slug": "PWQQ7U",
                "url": "https://fahrplan.chaos-west.de/36c3/talk/PWQQ7U/",
                "title": "36C3 Closing - STREAM",
                "subtitle": "",
                "track": null,
                "type": "Doppelter Slot",
                "language": "de",
                "abstract": null,
                "description": "",
                "recording_license": "",
                "do_not_record": true,
                "persons": [
                  {
                    "id": 85,
                    "code": "XVCJLF",
                    "public_name": "Chaos-West",
                    "biography": null,
                    "answers": []
                  }
                ],
                "links": [],
                "attachments": [],
                "answers": []
              }
            ]
          }
        }
      ]
    }
  }
}