{
  "id": 1339,
  "guid": "02b4a4d4-11da-4511-86b7-9b6c972a59cb",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:JHT:_Spiel_und_Spa%C3%9F_mit_der_vierten_Dimension",
  "logo": null,
  "date": "2019-12-28T11:00:00+01:00",
  "start": "11:00",
  "duration": "3:30",
  "room": "Assembly:Pseudoroom",
  "slug": "36c3-1339-session_jht_spiel_und_spass_mit_der_vierten_dimension",
  "title": "JHT: Spiel und Spaß mit der vierten Dimension",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "hands-on",
  "language": "de",
  "abstract": "",
  "description": "(für Kinder) In unserer Welt können wir uns nach links und rechts, nach hinten und vorne sowie nach unten und oben bewegen. Weitere Richtungen gibt es nicht. Das muss aber nicht so sein! In der Mathematik ist auch eine weitere Dimension vorstellbar. In diesem Workshop lernen wir diese vierte Dimension spielerisch und anschaulich kennen.\nIn unserer Welt können wir uns nach links und rechts, nach hinten und vorne sowie nach unten und oben bewegen. Weitere Richtungen gibt es nicht. Das muss aber nicht so sein! In der Mathematik ist auch eine weitere Dimension vorstellbar.Anhand eines interaktiven vierdimensionalen Labyrinths erkunden wir in diesem Workshop spielerisch die vierte Dimension. In der vierten Dimension gibt es neue wundersame Formen zu bestaunen, gewöhnliche dreidimensionale Gefängnisse wären nicht mehr ausbruchssicher und Schnürsenkel würden sich ständig von selbst entknoten.Dieser Workshop richtet sich vor allem an Kinder (ab vierte Klasse). Von 11:00 Uhr bis 14:30 Uhr kann man jederzeit kommen und gehen, eine Anmeldung ist nicht erforderlich. Die Location geben wir hier noch bekannt. Wer schon etwas älter ist (ab etwa achte Klasse) und Englisch ganz gut versteht, kann statt zu diesem Workshop auch zum 60-minütigen Vortrag zum Thema kommen.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Iblech",
      "public_name": "Iblech"
    }
  ],
  "links": []
}