{
  "id": 358,
  "guid": "031fc5c8-09c3-5490-ad8e-3858d391763b",
  "logo": "",
  "date": "2019-12-27T16:45:00+01:00",
  "start": "16:45",
  "duration": "00:55",
  "room": "OIO Stage",
  "slug": "GWFPXV",
  "url": "https://talks.oio.social/36c3-oio/talk/GWFPXV/",
  "title": "Observations on societal and technological changes in the DPRK",
  "subtitle": "",
  "track": null,
  "type": "Talk 45 minutes + 10 minutes Q&A",
  "language": "en",
  "abstract": "The Democratic People's Republic of Korea (North Korea) is a hot topic in the media. The peninsula is changing rapidly, but how is that reflected in life on the ground? What is it like to live in Pyongyang? Are the externally reported societal changes and developments in technology also visible in everyday life? This talk will describe modern urban life in Pyongyang, and the recent forces driving change.",
  "description": "The talk will particularly focus on observations around the state of youth mindset towards change and technology. For example, what are the future elites' attitudes towards entrepreneurship in an officially communist country? What small signals of changing attitudes can we observe that might influence the opening of the county? Presenting the realities of this environment leads us to the demo of consumer technology, and presented that opportunities for both societal change and technological development might be broader than we often see. We will present this deep dive to North Korea from the perspective of two foreigners who have been spending months at a time in Pyongyang and have been studying it since 2012.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 131,
      "code": "9LVDDR",
      "public_name": "Jukka-Pekka Heikkilä",
      "biography": "A scholar, co-creator, culture hacker and entrepreneurship educator specialized in extreme settings.\r\n\r\nJukka-Pekka has taught entrepreneurship courses and organized startup and science diplomacy events in Pyongyang between 2012 - 2017. He is a co-founder of WTSUP! Beirut aims to foster equality and volunteerism culture in the Middle East and a founder of Burning Stories research project that aims to study the transformation of Burning Man participants and its impact on society. From academic affiliations, Jukka-Pekka is a Newton Fellow of the Royal Society (UK) and British Academy, an Academy of Finland post-doctoral Fellow based in Aalto University, Finland, and a visiting scholar at Stanford University. In Finland, he works as a board member with The Shortcut, a sister organisation of Slush and an initiative that aims to integrate immigrants to the Finnish society via tech entrepreneurship education.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}