{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10517.html",
  "id": 10517,
  "guid": "032d1724-b643-4fa0-9435-3410e9ad333a",
  "logo": null,
  "date": "2019-12-28T20:50:00+01:00",
  "start": "20:50",
  "duration": "01:00",
  "room": "Borg",
  "slug": "36c3-10517-megatons_to_megawatts",
  "title": "Megatons to Megawatts",
  "subtitle": "Military warheads as a source of nuclear fuel",
  "track": "Science",
  "type": "lecture",
  "language": "de",
  "abstract": "Can nuclear warheads be used as energy sources instead of exhausting resources? And if, how does this even work? ",
  "description": "Concerns during the cold war era mainly focused on the diversion of Uranium intended for commercial nuclear power towards usage in weapons. During the 1990s, these concerns gave way to a focus on the role of military Uranium as a major source of fuel for commercial nuclear power. \r\n\r\nCan nuclear warheads be used as energy sources instead of exhausting resources? And if, how does this even work? \r\n\r\nIn the late 1980s the United States and countries of the former Soviet Union signed a series of disarmament treaties to reduce the world's nuclear arsenals. Since then, lots of nuclear materials have been converted into fuel for commercial nuclear reactors. \r\n\r\nHighly-enriched uranium in US and Russian weapons and other military stockpiles amounts to about 1500 tonnes, equivalent to about seven times the annual world Uranium mine production. These existing resources can be used instead of exploiting natural Uranium reserves, which are as limited as all other non-renewable energy sources. Uranium mining is a dirty, polluting, hazardous business which possibly could be stopped altogether if existing resources would be used instead.\r\n\r\nThis talk is a primer in nuclear physics with focus on conversion of weapon grade Uranium and Plutonium into fuel for civil nuclear power plants.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 8978,
      "public_name": "Julia Riede"
    }
  ],
  "links": [],
  "attachments": []
}