{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10693.html",
  "id": 10693,
  "guid": "049a34da-5074-499e-a388-dab768f9e032",
  "logo": "/system/events/logos/000/010/693/large/index.png?1572041322",
  "date": "2019-12-29T18:50:00+01:00",
  "start": "18:50",
  "duration": "01:00",
  "room": "Clarke",
  "slug": "36c3-10693-no_body_s_business_but_mine_a_dive_into_menstruation_apps",
  "title": "No Body's Business But Mine, a dive into Menstruation Apps",
  "subtitle": " The Not-So Secret Data Sharing Practices Of Menstruation Apps",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "en",
  "abstract": "In September 2019, Privacy International released exclusive research on the data-sharing practices of menstruation apps. Using traffic analysis, we shed lights on the shady practices of companies that shared your most intimate data with Facebook and other third parties.",
  "description": "In this talk we will go over the findings of this research, sharing the tools we have used and explaining why this is not just a privacy problem, but also a cybersecurity one. This talk will also be a call to action to app developers whose tools have concrete impact on the lives of their users.\r\n\r\nDoes anyone – aside from the person you had sex with – know when you last had sex? Would you like them to know if your partner used a condom or not? Would you share the date of your last period with them? Does that person know how you feel on any particular day? Do they know about your medical history? Do they know when you masturbate? Chances are this person does not exist, as there is only so much we want to share, even with our most intimate partner. Yet this is all information that menstruation apps expect their users to fill. \r\n\r\nWith all this private information you would expect those apps to uphold the highest standards when it comes to handling the data they collect. So, Privacy International set out to look at the most commonly used menstruation apps to find out if that was the case. Using traffic analysis, we wanted to see if those apps were sharing data with third parties and Facebook in particular, through the Facebook SDK.\r\n\r\nOur research shed light on the horrific practices of some menstruation apps that shared their users’ most intimate data – about their sexual life, their health and lifestyle – with Facebook and others.\r\n\r\nIn this talk, we will take you through the research we have conducted by using Privacy International’s publicly available and free testing environment. We will briefly explain how the testing environment work and we will showcase the menstruation apps that have the most problematic practices to show you how very granular and intimate data is shared with third parties and security implications.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 7699,
      "public_name": "Eva Blum-Dumontet"
    },
    {
      "id": 8597,
      "public_name": "Christopher Weatherhead"
    }
  ],
  "links": [
    {
      "url": "https://privacyinternational.org/long-read/3196/no-bodys-business-mine-how-menstruation-apps-are-sharing-your-data",
      "title": "Project Page on Privacy International's website"
    },
    {
      "url": "https://privacyintyqcroe.onion/long-read/3196/no-bodys-business-mine-how-menstruation-apps-are-sharing-your-data",
      "title": "Project Page on Privacy International's website (Onion)"
    },
    {
      "url": "https://privacyinternational.org/campaigns/no-bodys-business-mine",
      "title": "Campaigns Page on this topic on Privacy Internationals website"
    }
  ],
  "attachments": [
    {
      "url": "/system/event_attachments/attachments/000/004/104/original/PDF_36c3_No_body_business_but_mine-Sunday29th.pdf?1577638803",
      "title": "PDF_36c3_No_body_business_but_mine-Sunday29th.pdf"
    },
    {
      "url": "/attachments/original/missing.png",
      "title": "file"
    }
  ]
}