{
  "id": 198,
  "guid": "04a2ab95-c74a-58d7-93ac-e65046a56866",
  "logo": "",
  "date": "2019-12-28T11:00:00+01:00",
  "start": "11:00",
  "duration": "00:50",
  "room": "Chaos-West Bühne",
  "slug": "AQSTLX",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/AQSTLX/",
  "title": "A Hacker's Guide to Healthcare: How to Improve Lives with Data",
  "subtitle": "",
  "track": "Nicht Computers",
  "type": "Doppelter Slot",
  "language": "en",
  "abstract": null,
  "description": "Health related personal data is highly sensitive -- and yet it promises an outright methodology shift for the surprisingly conservative healthcare system. This talk provides an overview of beneficial uses of health data, and formulates ways to get involved to make sure the benefits are reaped in a conscientious manner.\r\n\r\nHealthcare is rapidly becoming digital: security and data privacy call for active participation. But so do questions of quantified fairness and certification of digital medical devices. Hackers can play a crucial part to ensure this benefits patients and citizens, by championing data transparency and standards of evidence. My talk will outline ways to get creative with data beyond scrutinizing governments on information security.\r\n\r\nFor the past year I worked for the German Ministry of Health's in-house think tank (hih) as an advisor on artificial intelligence. I will present my personal views, not those of the Federal Government.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 143,
      "code": "XQLGNP",
      "public_name": "Lars Roemheld",
      "biography": "Lars Roemheld is Director of AI & Data at the health innovation hub, the German Ministry of Health’s own thinktank. He previously held senior positions at the AI specialist QuantCo, where he used machine learning to develop anti-fraud and pricing solutions for financial, retail, and healthcare organizations in the US and Europe. A Data Scientist and Philosopher, he holds degrees from Stanford University and University of Heidelberg.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}