{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10800.html",
  "id": 10800,
  "guid": "05930be8-d978-4499-ad35-6068d0575666",
  "logo": "/system/events/logos/000/010/800/large/megaphone.jpg?1577341577",
  "date": "2019-12-28T22:10:00+01:00",
  "start": "22:10",
  "duration": "01:00",
  "room": "Clarke",
  "slug": "36c3-10800-creating_resilient_and_sustainable_mobile_phones",
  "title": "Creating Resilient and Sustainable Mobile Phones",
  "subtitle": "Be prepared for the coming Digital Winter. And play Impossible Mission.",
  "track": "Resilience & Sustainability",
  "type": "lecture",
  "language": "en",
  "abstract": "Civil society depends on the continuing ability of citizens to communicate with one another, without fear of interference, deprivation or eavesdropping. As the international political climate changes alongside that of our physical climatic environment, we must find ways to create mobile communications systems that are truly resilient and sustainable in the face of such shocks. We have therefore identified a number of freedoms that are required for resilient mobile phones: Energy, Communications, Security, Innovation, Maintenance and Scale-Dependency. These can be summarised as making it possible for people to create, maintain and develop mobile communications solutions, without requiring the capital and resources of a large company to do so. In this lecture I will explain why each of these is necessary, as well as describing how we are incorporating these principles into the MEGAphone open, resilient and secure smart-phone project.",
  "description": "In the humanitiarian sector we talk about how without energy there is no communications, and without communications there is no organisation, and how without organisation people die.  As we see increasing frequency of natural disasters, man-made disasters like wars and unrest, and the distressing intersection of these events, we have been convinced that we need to be able to create mobile communications devices that can not only survive in such events, but be sustained in the long term, and into what we call the coming Digital Winter. \r\n\r\nThe Digital Winter is the situation where the freedoms to create and innovation digital systems will become impossible or highly limited due to any of various interrelated factors, such as further movement towards totalitarian governments, the failure of international supply systems (or their becoming so untrustworthy to be usable), the failure of various forms of critical infrastructure and so on.\r\n\r\nFortunately the Digital Winter has not yet arrived, but the signs of the Digital Autumn are already upon us: The cold winds chilling our personal freedoms can already be felt in various places.  Thus we have the imperative to act now, while the fruit of summer and autumn still hangs on the trees, so that we can make a harvest that will in the least sustain us through the Digital Winter with resilient, secure and sustainable communications systems, and hopefully either stave off the onset of the winter, bring it to a sooner end, and/or make the winter less bitter and destructive for the common person.\r\n\r\nIt is in this context that we have begun thinking about what is necessary to achieve this, and have identified six freedoms that are required to not merely create digital solutions that can survive the Digital Winter, but hopefully allow such solutions to continue to be developed during the Digital Winter, so that we can continue to react to the storms that will come and the predators that will seek to devour our freedoms like hungry wolves.  The six freedoms are:\r\n\r\n1. Freedom from Energy Infrastructure, so that we cannot be deprived of the energy we need to communicate.\r\n2. Freedom from Communications Infrastructure, so that we cannot be deprived of the communications we need to organise and sustain communities.\r\n3. Freedom from depending on vendors for the security of our devices, so that we can patch security problems promptly as they emerge, so that we can sustain communications and privacy.\r\n4. Freedom to continue to innovate and improve our digital artefacts and systems, so that we can react to emergy threats and opportunities.\r\n5. Freedom to maintain our devices, both their hardware and software, so that our ability to communicate and organise our communities cannot be easily eroded by the passage of time.\r\n6. Freedom from Scale-Dependency, so that individuals and small groups can fully enjoy the ability to communicate and exercise the preceding freedoms, without relying on large corporations and capital, and also allowing minimising of environmental impact.\r\n\r\nIn this lecture I will explore these issues, as well as describe how we are putting them into practice to create truly resilient and sustainable mobile phones and similar devices, including in the MEGAphone open-source/open-hardware smart phone.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 8890,
      "public_name": "Paul Gardner-Stephen"
    }
  ],
  "links": [
    {
      "url": "mega65.org",
      "title": "MEGA65 Home Page"
    },
    {
      "url": "c65blogspot.com.au",
      "title": "MEGA65 Blog"
    },
    {
      "url": "github.com/mega65/mega65-core",
      "title": "MEGA65 Source Repository"
    }
  ],
  "attachments": []
}