{
  "id": 178,
  "guid": "059f517a-6650-5cd5-82df-ece4f7b0adae",
  "logo": "",
  "date": "2019-12-28T12:00:00+01:00",
  "start": "12:00",
  "duration": "00:50",
  "room": "Chaos-West Bühne",
  "slug": "EMK8WQ",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/EMK8WQ/",
  "title": "NOTH1NG T0 HID3: go out and fix privacy!",
  "subtitle": "",
  "track": "Nicht Computers",
  "type": "Doppelter Slot",
  "language": "en",
  "abstract": null,
  "description": "After the highly-successful presentation \"Toll of personal privacy in 2018\" at Chaos-West 35C3 where I talked about my personal experiences with trying to protect my privacy, this year I return with a completely* different talk that tries to convince the audience — you should care about privacy too!\r\n\r\nThis talk revisits the theme of personal privacy in the digital world, this time centring around the \"I've got nothing to hide\" argument. A beam of intensive light is shed upon the motivation behind caring about one's privacy. We go in depth into what we can do to stay private and should we even try to do it at all. We talk about where we as an global society were able to fix privacy and where we have failed. New topics previously not covered are discussed, such as herd immunity and certification programs.\r\n\r\n\\* 97%+",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 44,
      "code": "8N8CRM",
      "public_name": "Kirils Solovjovs",
      "biography": "Kirils Solovjovs is Lead Researcher at Possible Security, bug bounty hunter, IT policy activist, and the most visible white-hat hacker in Latvia having discovered and responsibly disclosed or reported multiple security vulnerabilities in information systems of both national and international significance. Kirils has developed the jailbreak tool for Mikrotik RouterOS. He has extensive experience in social engineering, penetration testing, network flow analysis, reverse engineering, and the legal dimension.\r\n\r\nHe has spoken at many amazing conferences including Hack In The Box, Hack in Paris, Hackfest, Nullcon, SHA2017, 35C3 Chaos-West, CONFidence, BalCCon, and TyphoonCon.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}