{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Lineup/events/11282.html",
  "id": 11282,
  "guid": "065d8c48-b8ce-447e-8d90-e8675676f521",
  "logo": "/system/events/logos/000/011/282/large/pkirn.jpg?1577207142",
  "date": "2019-12-30T16:00:00+01:00",
  "start": "16:00",
  "duration": "01:00",
  "room": "Discotheque Nouveauancien",
  "slug": "36c3-abfahrplan-11282-peter_kirn_workshop",
  "title": "Peter Kirn Workshop",
  "subtitle": "techno as folk instrument: Open technology for music making, and its potential",
  "track": "Music",
  "type": "other",
  "language": "en",
  "abstract": "",
  "description": "Who's afraid of a planet of producers? Musical computation by necessity was once restricted to advanced laboratories. But electronic noise has come in cycles of democratization, liberation, and creative misuse.\r\n\r\nA new wave of tools makes powerful sonic capabilities available in free and open source platforms for software and hardware. Here's an overview of the state of some of those tools. We'll focus in particular on VCV Rack, the software recreation of modular synthesizers, which is both open to developers and still provides a pathway for software and hardware makers to earn a living for their products. We'll try a brief hands-on to see how this makes modular synthesis concepts accessible, via free software on Mac/Windows/Linux. Then, we'll zoom out to the larger landscape of tools and how they could reshape music production and instrument making. \r\n\r\nRather than see technology alone as a faceless cultural force, these tools - and techno as genre - demonstrate the potential of participatory technology. The communities around them can become more powerful as they grow, rather than extractive or limited, sharing information and developing audiences and makers in parallel.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [],
  "links": [
    {
      "url": "https://soundcloud.com/peterkirn",
      "title": "Peter Kirn on Soundcloud"
    },
    {
      "url": "https://vcvrack.com",
      "title": "VCV Rack"
    },
    {
      "url": "https://cdm.link ",
      "title": "cdm"
    }
  ],
  "attachments": []
}