{
  "id": 4135,
  "guid": "067b3fc1-f3c3-5704-a1bf-2346ea8e1e9a",
  "logo": "/media/36c3/images/UESZPA/untitled_Re__4th_eviction_of_Hambach_forest__web_XAccvJF.jpg",
  "date": "2019-12-29T14:30:00+01:00",
  "start": "14:30",
  "duration": "00:34",
  "room": "Art-and-Play Stage",
  "slug": "UESZPA",
  "url": "https://stage.artesmobiles.art/36c3/talk/UESZPA/",
  "title": "untitled [Re: 4th eviction of Hambach forest]",
  "subtitle": "",
  "track": "Screening",
  "type": "Screening",
  "language": "en",
  "abstract": "\\#artistic documentary \\#2019 \\#34 min + Q&A \\#german language",
  "description": "While working on a dissertation on the political struggle near Europe’s largest open lignite pit in the Rhineland area, heaps of imagery were produced, in particular during the forest eviction of Hambach forest in autumn 2018 – which was one of Germany's largest police mass actions to date. This led to the production of a photo exhibition and the short movie \"untitled [Re: 4th eviction of Hambach forest]\".\r\n\r\nDestruction may be considered a predominant theme here: destruction of ancient natural habitats and groundwater reserves, destruction and devastation of whole landscapes, destruction of nearby villages and communities, destruction of the world's climate and our common future. Still, the photo exhibition also sheds light on the stark contrast of destruction vs. construction: the demolished homes of Manheim on the one hand, re-building the forest occupation and settling into new tree house homes on the other hand.\r\n\r\nThe work initially evolved around a central question: does the artistic act interfere with activism (and vice-versa)? During the process, this potential conflict of interests became clearer. It's a thin line between art impacting activism and activism influencing art, with each bearing possible adverse but also positive effects on the other. One may think that producing imagery is a photographer's priority. But artistic ideals and integrity cannot be seen in total isolation of their surrounding circumstances. Hence, a more accurate description of the artist's work would be \"Resistance by means of documentation\".",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 27,
      "code": "KDBFGM",
      "public_name": "Angie",
      "biography": null,
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}