{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/11234.html",
  "id": 11234,
  "guid": "06928e7a-4459-4b07-8752-6f9a7697cd8b",
  "logo": null,
  "date": "2019-12-29T22:50:00+01:00",
  "start": "22:50",
  "duration": "00:40",
  "room": "Eliza",
  "slug": "36c3-11234-speaking_fiction_to_power",
  "title": "Speaking Fiction To Power",
  "subtitle": "Strategies and tactics to ‘hack’ public spaces and social conventions",
  "track": "Art & Culture",
  "type": "lecture",
  "language": "en",
  "abstract": "Louise Ashcroft will talk through strategies and tactics she uses to ‘hack’ public spaces and social conventions in order to suggest new ways of living which challenge rules and hierarchies. ",
  "description": "Louise Ashcroft is a performance artist and filmmaker whose playfully disruptive fieldwork in public spaces like shopping centres, trade fairs and the street) seek to challenge the socio-economic status-quo and reveal the absurdity of the power systems that govern how we live. For example, mailing boxes of soil from former public land to its new overseas owners, leading 'backwards shopping' workshops, smuggling strange products into supermarkets and attempting to buy them, or running conceptual cleaning services for people's hopes and dreams. Such public interventions are humorously retold in the form of stage performances. Louise has exhibited widely including at Arebyte Gallery, BQ Berlin, Latitude Festival, Supernormal Festival, Wellcome Collection, Museum of London and on BBC radio; residencies include Tate Learning, Camden Arts Centre, and Z.U.T Lisbon. Louise cofounded the free art school AltMFA and teaches art at Goldsmiths College. She hates capitalism but loves sneakers. ",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9867,
      "public_name": "Louise Ashcroft"
    }
  ],
  "links": [
    {
      "url": "https://www.louiseashcroft.org/",
      "title": "louiseashcroft.org"
    }
  ],
  "attachments": [
    {
      "url": "/system/event_attachments/attachments/000/004/095/original/36C3_talk_Louise_Ashcroft_compressed.pdf?1577623402",
      "title": "Speaking Fiction to Power - Talk slides (for looking at only, copyright Louise Ashcroft)"
    }
  ]
}