{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10858.html",
  "id": 10858,
  "guid": "0886b5ea-6e90-4619-8f9c-038ebf9b4241",
  "logo": "/system/events/logos/000/010/858/large/campiaperti-500x500.jpeg?1572012801",
  "date": "2019-12-29T20:50:00+01:00",
  "start": "20:50",
  "duration": "00:40",
  "room": "Dijkstra",
  "slug": "36c3-10858-infrastructures_in_a_horizontal_farmers_community",
  "title": "Infrastructures in a horizontal farmers community",
  "subtitle": "Human agreements, comunication infrastructures, services in Campi Aperti, Bologna, Italy",
  "track": "Resilience & Sustainability",
  "type": "lecture",
  "language": "en",
  "abstract": "We will analyze the approach to tecnology (decisional method, mesh network and cloud) of a farming community near Bologna: Campi Aperti.\r\n\r\nSpeaking about: human organization, connectivity, managing of a server, resources and incidents handler, femminism, maintaining and growing in a non-gerarchical organization. Technologies involved: humans, antennas, orchestrator of containers.",
  "description": "Summarize the experience of this last 15 years of a group of farmers, the strong political impact about take care of the near territory, decide what grow and what eat and share this decisions with the consumers in the city, settled a method that is called \"shared warranty\", garanzia partecipata, for the organic vegetables, refuse the big distribution of the food and how this principles, with also some femminist ideas, can bring  us to think in a different way our tech organizations and our tools. In the last 3 years the group Campiaperti and Genuino Clandestino, the italian network of self-managed farmers, started to make questions and solution about tecnologies and started slowly to mantain their services.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9628,
      "public_name": "Andrea Zappa"
    }
  ],
  "links": [
    {
      "url": "https://www.campiaperti.org/",
      "title": "Campi Aperti"
    },
    {
      "url": "https://www.campiaperti.org/documentazione/",
      "title": "Documentazione Campiaperti"
    },
    {
      "url": "https://git.autistici.org/ai3/float#float",
      "title": "Float - minimal container orchestrator"
    }
  ],
  "attachments": []
}