{
  "id": 199,
  "guid": "0968ef0d-4e19-5751-94f4-f24b8b9758a3",
  "logo": "/media/36c3/images/83YJMS/Digitalcourage_Sicherheitstheater_-_Aufkleber_bahnsteigkarte.jpg",
  "date": "2019-12-29T20:00:00+01:00",
  "start": "20:00",
  "duration": "00:50",
  "room": "Chaos-West Bühne",
  "slug": "83YJMS",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/83YJMS/",
  "title": "Aus Sicherheitsgründen muss das Grundgesetz leider abgeschafft werden - Schluss mit dem Sicherheitstheater",
  "subtitle": "",
  "track": "Antifaschimus",
  "type": "Doppelter Slot",
  "language": "de",
  "abstract": null,
  "description": "Die Gleichsetzung von Sicherheit und Repression ist gefährlich. Erstens werden damit Grundrechtseinschnitte gerechtfertigt, die uns in Gefahr bringen. Zweitens unterbleiben wichtige Maßnahmen, die wirklich der Sicherheit dienen würden.\r\n\r\nWas in Politik und Wirtschaft als „Sicherheit“ verkauft wird, ist reines Puppentheater. Menschen wird Angst eingeredet, um diese Angst sodann mit Repression und Überwachung zu „beruhigen“. Sicherheit und Freiheit bedingen sich gegenseitig. Eine Politik, die Freiheit angreift und scheibchenweise verhökert, verdient nicht „Sicherheitspolitik“ genannt zu werden. Sie ist reines Theater und einer Demokratie nicht würdig. Schlimmer noch: Sie leistet einem autoritären Gedankengut Vorschub, das uns garantiert nicht sicher macht. \r\n\r\nDer Vortrag widmet sich einerseits der Erklärung, weshalb diese Gleichsetzung gefährlich ist: Überwachung hilft gar nicht, hat gefährliche Nebenwirkungen und zersetzt den größten Garanten für unsere Sicherheit, die Freiheit.\r\n\r\nZum anderen geht es um die Frage, welche Maßnahmen wirklich sinnvoll wären. Das fängt bei einem echten Kampf gegen den Faschismus an, geht über unabhängige Kontrolle der Polizei, Klimaschutz, Verkehrspolitik und endet nicht erst in der Forderung nach einer besseren Regulierung von Antibiotika.\r\n\r\nEs ist wichtig, dass der Wunsch nach Sicherheit nicht weiter instrumentalisiert wird. Repression ist gefährlich und dient nun wirklich nicht der Sicherheit. Besonders wütend sollte uns das machen, wenn gleichzeitig lange nötige Maßnahmen, beispielsweise beim Kampf gegen Rechts oder gegen digitale Gewalt unterbleiben. Denn hier sind wir wirklich in Gefahr.\r\n\r\nDieses ewige \"aus Sicherheitsgründen\" muss endlich ein Ende haben. Wir können mithelfen, indem wir uns einen Spaß machen und die Begründung genau so inflationär benutzen, wie die Politik. Einfache Begründungen können wir schließlich alle gebrauchen. Und wenn es um Sicherheit geht, wird ja wohl niemand diskutieren wollen. Wir üben das mal gemeinsam: Aus Sicherheitsgründen sollten sich alle diesen Vortrag ansehen.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 144,
      "code": "FJ8PMN",
      "public_name": "Leena Simon",
      "biography": "Ich bin graduierte Philosophin, mit dem Hauptthema Netzphilosophie (= Technikphilosophie) und speziell Digitale Mündigkeit, an dem ich seit meinem Studium (Beginn 2004), aber so richtig seit 2009 herumforsche. Zum Thema [Digitale Mündigkeit](https://muendigkeit.digital) habe ich auf dem 29C3 bereits einen [Vortrag](https://media.ccc.de/v/29c3-5179-de-en-hacking_philosophy_h264) gehalten. \r\n\r\nMit [Digitalcourage](https://digitalcourage.de) mache ich häufig inhaltliche Projekte um Argumente zu schärfen.\r\nFür das [Anti-Stalking-Projekt](https://anti-stalking-projekt.de) arbeite ich als IT-Beraterin. Dort erlebe ich tagtäglich welches Drama sich auf den Geräten der „ganz normalen Menschen“ abspielt, und übe mich darin Computerthemen in einfacherer Sprache rüberzubringen. Außerdem halte ich Fortbildungen und Vorträge zur Digitalen Selbstverteidigung.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}