{
  "id": 4128,
  "guid": "0b463b92-5a51-59ef-862f-60d5b02880f3",
  "logo": "/media/36c3/images/8NC7PK/Vision_des_OstHub__web_kOzLHGW.jpg",
  "date": "2019-12-28T13:00:00+01:00",
  "start": "13:00",
  "duration": "00:30",
  "room": "Art-and-Play Stage",
  "slug": "8NC7PK",
  "url": "https://stage.artesmobiles.art/36c3/talk/8NC7PK/",
  "title": "Vision des \"OstHub\" im Leipziger Osten: Center for immersive media art and technology (ZIMT), co-working space, media laboratory",
  "subtitle": "",
  "track": "Lecture",
  "type": "Lecture",
  "language": "en",
  "abstract": "\\#co-working space \\#media laboratory \\#center for immersive media art and technology \\#talk and Q&A 30min",
  "description": "In 2020, a new space called \"OstHub\" will be developed in the East of Leipzig. Within 400m2, a co-working space, a centre of immersive media art and technology and several media production studios (film, 3d audio and programming) will find their place. A hybrid of culture and creative industries joining production and research in the fields of art, design, music, film and game industry. Laboratories, workshops, media (art) festivals, talks, exhibitions, 3D audio concerts, film screenings and many more formats will form the core of the program and can be realised in the location. The initiator of the OstHub is the Wisp Kollektiv, a studio for digital art, design and culture. For several years the studio creates free and commissioned artistic works with sound and light in space such as installations, compositions, sound designs, performances and concert productions for exhibitions and live shows.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 22,
      "code": "F9XASN",
      "public_name": "Wisp Kollektiv (Paul Schengber)",
      "biography": "As a cultural institution Wisp Kollektiv is dedicated to the support and execution of artistic and creative forms of expressions and hosts an annually growing program of artist residencies, digital art labs, workshops and events.\r\n\r\nhttp://wisp-kollektiv.de\r\nhttp://facebook.com/wispcrew\r\nhttps://instagram.com/wisp_kollektiv",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}