{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10988.html",
  "id": 10988,
  "guid": "0bc48f52-1052-4db9-a4e9-a38fb71e65e4",
  "logo": "/system/events/logos/000/010/988/large/wohnungsbot-twitter.png?1572101097",
  "date": "2019-12-30T13:30:00+01:00",
  "start": "13:30",
  "duration": "00:40",
  "room": "Clarke",
  "slug": "36c3-10988-wohnungsbot_an_automation-drama_in_three_acts",
  "title": "Wohnungsbot: An Automation-Drama in Three Acts",
  "subtitle": "A media-art project which automates the search for flats in Berlin and challenges automation narratives",
  "track": "Art & Culture",
  "type": "lecture",
  "language": "en",
  "abstract": "At the center of Clemens Schöll's latest art project is the \"Wohnungsbot\" (flat-bot), which automates flat searching in Berlin. But it doesn't only try to search flats for everybody, it fundamentally questions power-relationships in (flat-searching) online platforms. Where are the utopias about public automation? Who should be able to automate what, and how?",
  "description": "<p>With increasing urbanization and financial speculation on the housing market the search for a flat in any big city has become an activity that consumes a lot of resources for people in need of housing: beyond the emotional load a significant share of your supposed leisure time is being consumed by repetitive tasks. Online platforms force us to refresh pages, scroll, click here, click there, look at a few pictures and eventually copy-paste our default text over and over again. If you're ambitious you maybe adjust the lessor's name or the street. But honestly, why do we do this? It could be so easily automated.</p>\r\n\r\n<p>The 'automation drama in three acts' by media artist Clemens Schöll titled <i>\"Von einem der auszog eine Wohnung in Berlin zu finden\" (Of someone who went forth to find a flat in Berlin)</i> speculates about alternative strategies and narratives for both the housing market as well as automation itself. At the center of the multi-exhibition project stands the Wohnungsbot (literally: flat-bot), a free open source software to automate flat-searching and applications in Berlin, released to the public in June 2019.</p>\r\n\r\n<p>But the Wohnungsbot is about much more than just rejecting the out-of-control housing situation. There are no technological fixes for social problems. By reclaiming de-facto working time a fundamental utopia of automation is opened once again. Who should be able to automate, what should they be able to automate, and how?<br/>\r\nBut even if these tools are publicly available – who is aware of them and who is able to use them?</p>\r\n\r\n<p>Looking back in history we find that automation has always been accompanied with struggles of power and labor. How have we reached a state where only institutions, be it private companies (usually for-profit) and the state, are allowed or able to automate? Why has automation become a synonym to nightmares of many people, such as mass unemployment? If we're not asked for consent (or don't want to give it) to being dehumanized by automated processes, how can we oppose these practices?</p>\r\n\r\n<p>Ultimately, we can look at ourselves (at Congress) and ask: where do we stand in this? With many of us being <i>\"people who write code\"</i> (title of a previous artistic research project by Clemens Schöll) we must reflect if and how we shape this tension with our work and existence.</p>",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 8330,
      "public_name": "Clemens Schöll"
    }
  ],
  "links": [
    {
      "url": "https://wohnung.neopostmodern.com",
      "title": "Wohnungsbot-Website"
    }
  ],
  "attachments": []
}