{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10567.html",
  "id": 10567,
  "guid": "0ca86585-29d6-4662-bb8a-c4d830ad3b35",
  "logo": null,
  "date": "2019-12-28T22:10:00+01:00",
  "start": "22:10",
  "duration": "01:00",
  "room": "Borg",
  "slug": "36c3-10567-hacking_sony_playstation_blu-ray_drives",
  "title": "Hacking Sony PlayStation Blu-ray Drives",
  "subtitle": "",
  "track": "Security",
  "type": "lecture",
  "language": "en",
  "abstract": "Xbox 360 video game console had a number of widely known hacks for firmware of its optical disc drives. However, it was never the case with Blu-ray disc drives of Sony PlayStation video game consoles. In fact, up until recently there was no much information available on this subject publicly.",
  "description": "In this presentation, I would like to share my journey of delving deep into internals and security of Sony PlayStation Blu-ray disc drives. As games are distributed within optical media, those embedded devices were intended to contain the best security possible. I will demonstrate a multiple hardware hacks and several software vulnerabilities that allowed to dump firmware and get code execution on multiple models of Sony PlayStation Blu-ray disc drives.\r\n\r\nIn this presentation, I will share the following:\r\n1)\tI will provide in-depth analysis of vulnerabilities and their exploitation to achieve code execution on multiple models of Sony PlayStation Blu-ray disc drives\r\n2)\tI will discuss problems that I’ve encountered while reverse engineering the firmware and how I solved (some of) them\r\n3)\tI will talk about security features of Sony PlayStation Blu-ray disc drives\r\n4)\tI will explain what engineers did right and how achieving code execution on the drive doesn’t lead to full compromise of security",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9330,
      "public_name": "oct0xor"
    }
  ],
  "links": [],
  "attachments": []
}