{
  "id": 244,
  "guid": "0f020c49-a754-5758-b794-25d84e0ac19a",
  "logo": "/media/36c3/images/KPKBDU/ArcoLinux_2019-11-24_20-48-54.png",
  "date": "2019-12-27T14:30:00+01:00",
  "start": "14:30",
  "duration": "00:20",
  "room": "Chaos-West Bühne",
  "slug": "KPKBDU",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/KPKBDU/",
  "title": "Freedombone - DIY Soziale Veränderung in Zeiten des Überwachungskapitalismus",
  "subtitle": "",
  "track": "The real basic about Bits and Nibbles",
  "type": "Einfacher Slot",
  "language": "de",
  "abstract": null,
  "description": "Was wäre, wenn das Internet nicht wie ein feudaler Besitz regiert würde? Was\r\nwäre, wenn es von und für Leute, die es benutzen, betrieben würde?\r\n\r\nIch benutze Freedombone um der Geselschaft sowie auch allen Individuen zu\r\nermöglichen, die Datensouveränität aus dem free-to-use Model des\r\nÜberwachungskapitalismus zurück zu gewinnen. Durch die Möglichkeit [\"Server\r\nApps\"] ohne technisches Wissen mit 4 Klicks über einer Web UI zu installieren,\r\nist es möglich, dass Hobby-Admins ohne viel Zeit, sowie auch in Umgang mit\r\nServern und Hosting unerfahrene Menschen nicht bei der Inbetriebnahme scheitern.\r\n\r\nSomit kann jede Einzelperson oder eine Community das Internet als freies\r\nKommunikationmiittel wieder nutzen.Bei diesem Talk liegt der Fokus auf dem\r\nFediverse, die Vernetztung sozialer Bewegungen und dem nutzen Dienstprogramme.\r\n[\"Server Apps\"](https://freedombone.net/apps.html)\r\n\r\n\r\nEs ist eine Tatsache, dass Mainstream-Software kaputt ist und die Unternehmen,\r\ndie sie entwickeln, unzuverlässig und datenhungrig sind.\r\n\r\nDaher ist zu folgern, dass wir einen Bruchpunkt in der Gesichte des menschlichen\r\nInformationsaustausches erreicht haben. Die Rückgewinnung der Datensouveränität\r\nist bei Freedombone ein Selbstverständnis. **Du willst also deine eigenen\r\nInternetdienste betreiben, aber hast keine Zeit dies umzusetzen?**\r\n\r\n\r\nDie Konfiguration von Diensten wie E-Mail, Chat, VoIP, Websiten,\r\nDateisynchronisation, Wikis, Blogs, soziale Netzwerken (pleroma, zap, pixelfeed,\r\nua.), Medienhosting, Backups, VPN sind an sich schon ein nicht triviales\r\nUnterfangen. Das Ziel von \\[Freedombones\\](https://freedombone.net/) ist es die\r\nKonfiguration zu übernehmen. Freedombone ist ein Home-Server-System, mit dem du\r\nall diese Dinge von deinem Wohn- oder Hackerzimmer hosten kannst. Für die\r\nEinrichtung wird eine .img.xz [Image] auf einen USB Stick geladen. Nach dem\r\nersten Boot ist ein Email Server schon funktionsfähig. Standartmässig sind alle\r\nDienste im Internet über DNS im Clearnet aber auch im Darknet über TOR\r\nerreichbar.\r\n\r\nFreedombone ist ein AGPLv3 Open Source Projekt.\r\n[Git](https://code.freedombone.net/bashrc/freedombone)\r\n\r\nMein aktuelles Ziel, in diesem Jahr, war die Einbindung von Freifunk. Die\r\nWeboberfläche zeigt alle öffentlich bekannten Freifunk Nodes einer lokalen\r\nFreifunk Gruppe auf einer Karte an. Der Admin wählt den Konfig einer Freifunk\r\nGruppe. Seit Frühjahr arbeite ich auch an an einem GitlabCI System, welches das\r\nZiel hat die Wartung der Software des Projektes zu erleichtern.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 188,
      "code": "WGSPN3",
      "public_name": "Sw0rdDoom",
      "biography": "Studies Life, especially Computer Science in Bremen at Day, Makes Computers do things at Night.\r\n\r\nI am currently doing my bachelor in Computer Science at the University Bremen. I work there as a student research assistant at the Cyber-Physical Systems Institute of German Research Centre for Artificial Intelligence.   https://www-cps.hb.dfki.de/\r\n\r\nAt NIght I like Data Science and Social Responsibility\r\nSee my Last Meeting at [Fiffkon19](https://2019.fiffkon.de/program/events/37.html)",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}