{
  "id": 1232,
  "guid": "0f96e65a-15a3-4c4f-8798-d99dedd90cc9",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Introduction_to_Tempeh_Making",
  "logo": null,
  "date": "2019-12-27T14:00:00+01:00",
  "start": "14:00",
  "duration": "2:00",
  "room": "Assembly:Foodhackingbase",
  "slug": "36c3-1232-session_introduction_to_tempeh_making",
  "title": "Introduction to Tempeh Making",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "hands-on",
  "language": "en",
  "abstract": "",
  "description": "Workshop as an introduction to soybean fermentation. It will take you through the preparation of the soybeans or other legumes.\n[https://dudle.inf.tu-dresden.de/tempehmaking36c3 To secure spot on this workshop please sign in here.][[Image:800px-Tempeh_cloth_overview_faa05092017.jpg|thumb|right|Tempeh made in cloth]][[Image:800px-Tempeh_banana_leave_ready_1600_faa08092017.jpg|thumb|right|Tempeh in banana leave]][[Image:800px-Tempeh_banana_leave_cut_close_up_1600_faa08092017.jpg|thumb|right|Tempeh cut close up]][https://foodhackingbase.org/wiki/Recipe:Tempeh_making_manual_-_short_workshop_form Workshop manual is shared here.]This workshop is an introduction to soybean fermentation. It will take you through the preparation of the soybeans or other legumes (most likely chickpeas), inoculation of the beans with the microbial culture and the subsequent harvesting and aging - your ferment should be ready for preparation and eating on the Day 3. We will focus on [https://en.wikipedia.org/wiki/Tempeh tempeh] cultured by ''[https://en.wikipedia.org/wiki/Rhizopus_oligosporus Rhizopus oligosporus]'' which is nice and easy opening for beginners.The diversity of the ferments which can be prepared from soybeans (and other legumes) is truly amazing, depending on the cultures (microbes) being used and conditions/techniques applied (and of course the treatment of the beans). In this workshop we will go through the basic steps which will secure proper preparation of the chickpeas/beans as a substrate for the microbes to inoculate it with. Optimal fermentation conditions will be discussed and devices making it easy to establish them suggested ([https://foodhackingbase.org/wiki/Experimental_Incubator Experimental Incubator] for example). We will be also harvesting/preparing the previously made tempeh and as usually tasting samples of the final products. The results of this workshop should be ready for tasting on Day 3 (48 hours of fermentation at 25-30°C is sufficient). We are going to provide the participants with adequate starter cultures for their experiments, at least for few first batches, you should however get your own starter for later experiments, more info below.This workshop is based on '''donation at your will no one turned away for lack of funds'''. If you can afford to donate, please do, during the years I have found out that if people donate during the workshop between €5-15 per person, things go well for me and I can cover most of the expenses so I can keep coming to the events. For the past three years or so we are using [https://www.topcultures.com/ starter from Topcultures] company based in Belgium. It works very well and it is well priced, for €20-30 you will have enough to play for a year or so I would say. However as mentioned above, part of the \"package\" is small dosage of the starter for you for few to several first batches.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:0x378",
      "public_name": "0x378"
    }
  ],
  "links": [
    "https://foodhackingbase.org/wiki/Tempeh_making_36c3"
  ]
}