{
  "id": 1231,
  "guid": "10157073-60ae-4806-b73d-592265cff09c",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Introduction_to_Beef_Jerky_Drying_Boxes",
  "logo": null,
  "date": "2019-12-27T16:00:00+01:00",
  "start": "16:00",
  "duration": "1:00",
  "room": "Assembly:Foodhackingbase",
  "slug": "36c3-1231-session_introduction_to_beef_jerky_drying_boxes",
  "title": "Introduction to Beef Jerky Drying Boxes",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "workshop",
  "language": "en",
  "abstract": "",
  "description": "This workshop is an introduction to a cheap and simple beef jerky drying box. It will take you through making the box from provided materials.\nTo secure spot on this workshop please sign in [https://dudle.inf.tu-dresden.de/jerky-fhb-36c3/ here] when the sign in system is ready.[[Image:800px-Box_open_IMG_20181209_222125_521_s.png|thumb|right|Jerky, drying in the Box]][[Image:651px-Box_closed_IMG_20181209_222149_274.png|thumb|right|The complete Box]][[Image:800px-Box_with_battery_IMG_20181209_222021_007_s.png|thumb|right|A better view on a quick and dirty power supply of the Box]]This workshop is an introduction to a cheap and simple beef jerky drying box. It will take you through making the box from provided materials. After that the preparation of meat for drying will be handled.There will be samples for participants, to try what kind of jerky can be made with these boxes. [https://foodhackingbase.org/wiki/Recipe:Beef_Jerky Workshop recipe is shared here.]In this workshop you will be provided with everything you need for building a beef jerky box. This box is designed to be small, lightweight, flexible and cheap. It is very simple but works fine. The box can be folded nicely and takes little space when folded together. There are several possibilities for hanging the meat while drying, the \"standard\" method simply folds away as the box is collapsed. After use, the box can be easily cleaned, even sticky marinade rinses off.There is space for drying around 200gr of meat at once, more or less. I'm sure this could be even more if more fishing line is added, but that might impact drying time.The number of parts is small and the potential for future hacking is definitely there. Some suggested adding an air filter (for filtering out dust from the incoming air) for example. This can easily be done, there is space left for that!The old 9V clip to power the box has been replaced by 5V (USB) power, but a power supply that directly delivers 12V is tested the most. The 5V way uses a step up converter and should work just fine, but there have been no long term tests.We have enough material for 9 people.This workshop is based on '''donation at your will no one turned away for lack of funds'''. If you can afford to donate, please do.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:0x378",
      "public_name": "0x378"
    }
  ],
  "links": [
    "https://foodhackingbase.org/wiki/Beef_Jerky_Box_Making_363"
  ]
}