{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10738.html",
  "id": 10738,
  "guid": "110bffee-288c-48df-948f-05cdca65b2b5",
  "logo": "/system/events/logos/000/010/738/large/XR_Berlin.jpg?1571867685",
  "date": "2019-12-28T17:10:00+01:00",
  "start": "17:10",
  "duration": "00:40",
  "room": "Clarke",
  "slug": "36c3-10738-extinction_rebellion",
  "title": "Extinction Rebellion ",
  "subtitle": "Jahresrückblick 2019",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "de",
  "abstract": "Extinction Rebellion (XR) ist eine global agierende, schnell wachsende, klimaaktivistische Graswurzel-Bewegung, die mit gewaltfreien Aktionen zivilen Ungehorsams auf die drohende Klimakatastrophe hinweist und Regierungen zum Handeln bewegen will. Die Ortsgruppe Berlin präsentiert in einer Art Jahresrückblick eine Auswahl an aktuellen Aktionen und stellt vor, wo wir als Bewegung gerade stehen, was wir bislang erreicht haben und was weiterhin gebraucht wird, um ein dringend notwendiges politisches Umsteuern einzuleiten. Let's act now.",
  "description": "Extinction Rebellion (XR) hat ein turbulentes erstes Jahr hinter sich. Im letzten Herbst wurden in London die fünf wichtigsten Brücken über die Themse besetzt und die drohende Klimakatastrophe begann – endlich! – ins öffentliche Bewusstsein zu rücken. In diesem Herbst gab es koordinierte Aktionen und Blockaden mit Zehntausenden Teilnehmer:innen bereits in über 60 Metropolen auf der ganzen Welt. Über zweitausend Menschen sind dabei verhaftetet worden.\r\n\r\nKlimapolitisch hat sich dennoch so gut wie nichts getan. Während Regierungen entweder regungslos verharren oder aber den Klimanotstand ausrufen und zugleich neue Infrastruktur für fossile Brennstoffe bewilligen, arbeitet die Leugner:innenmaschinerie auf Hochtouren und bemüht sich um die Konstruktion alternativer Fakten. \r\n\r\nGleichzeitig erleben wir immer wieder, dass unsere wissenschaftlichen Prognosen nicht stimmen und sich der Klimawandel in seinem Verlauf schneller und heftiger vollzieht als vorhergesagt. Hitzewellen, Waldbrände, Dürren, Ernteausfälle, Wasserknappheit sind nicht mehr zu ignorieren.\r\n\r\nEs ist daher unumgänglich, den politischen Druck zu erhöhen, indem mehr Aktionen an mehr Orten mit noch viel mehr Menschen und auf vielen verschiedenen Ebenen durchgeführt werden. XR kann jede Art von Unterstützung gut gebrauchen – egal ob es um Nachhilfe in puncto Privacy geht, um Operational Security, um Soft- und Hardware oder um eigenständigen Hacktivismus. Wichtig ist nur: Wir müssen uns jetzt aufraffen, zusammentun und aktiv werden. The time is now.",
  "recording_license": "",
  "do_not_record": true,
  "persons": [
    {
      "id": 9118,
      "public_name": "Maria"
    },
    {
      "id": 9888,
      "public_name": "Lu Yen Roloff"
    },
    {
      "id": 9895,
      "public_name": "sina"
    }
  ],
  "links": [
    {
      "url": "https://extinctionrebellion.de/",
      "title": "Extinction Rebellion Deutschland"
    },
    {
      "url": "https://rebellion.earth/",
      "title": "Extinction Rebellion "
    }
  ],
  "attachments": []
}