{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Lineup/events/11274.html",
  "id": 11274,
  "guid": "130a2509-f733-4349-b9ba-95748ba59fff",
  "logo": "/system/events/logos/000/011/274/large/David_Dorad_01.jpg?1577320337",
  "date": "2019-12-30T01:00:00+01:00",
  "start": "01:00",
  "duration": "02:00",
  "room": "Discotheque Nouveauancien",
  "slug": "36c3-abfahrplan-11274-david_dorad",
  "title": "David Dorad",
  "subtitle": "Techno",
  "track": "Music",
  "type": "djset",
  "language": "en",
  "abstract": "",
  "description": "David Dorad—whose surname sounds like a fish dish ordered in the Spanish isles—has, through\r\nhis two decade electronic romance, become a key element in the German dance scene. Born\r\nout of wedlock to techno and house, he delivers honest and driving sets that take us up and\r\nover, just before jolting us sideways.\r\nTravelling through the hotbed of the Berlin rave culture led him to be an integral part of its pro-\r\nvocative history. Founding Bachstelzen with friends at the flip of the millennium, these parties\r\npaved the pay for a subculture where dance floors became utopic adult playgrounds. Around\r\nthe same time, the infamous Bar25 opened its doors. Here, his dynamic stage persona found\r\na weekend home, and on all the other ones he gathered the troops at parties around the rest\r\nof Europe. Today he continues to move this way and is a regular at the likes of Fusion Festival\r\nand Garbicz while travelling between Europe, Asia and the Americas. Whether in foreign lands\r\nor home haunts, his powerful feeling for people and deep intuition for sound lights up the night\r\nand blooms through the morning.\r\nDorad’s sets are unshazamable, dance floor hysterical and quietly historical. Cutting tracks\r\ntogether with as much care and finesse as a Japanese sushi chef, he creates stories from\r\na kicking selection of tunes. When woven together, they create a very sonic collage of “Hello\r\ndance floor my old friend”. In his former life, he supervised continuity on the film set, now every\r\nset he plays is based on a strong sense of continuity, too. Whether solid and future-forward or\r\nbeautiful and minimalistic, his superb taste in techno, house and its close relatives wake us up\r\nand turn us on like a switch.\r\nWhether he was a child piano prodigy at age six who grew up feeding on the sounds of abs-\r\ntract jazz music, or if he grew up in East Germany as a punk kid behind the iron curtain, we don’t\r\ncare anyway. David Dorad is about right now, and right now, like he’s done forever, he turns on\r\nthe moment just at the moment when he turns on the night.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [],
  "links": [
    {
      "url": "https://soundcloud.com/david-dorad",
      "title": "David Dorad on Soundcloud"
    }
  ],
  "attachments": []
}