{
  "id": 1524,
  "guid": "13f4fff9-56a5-4982-b447-e54da1429952",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:What_is_the_Tinkering_To_Come%3F",
  "logo": null,
  "date": "2019-12-28T15:00:00+01:00",
  "start": "15:00",
  "duration": "0:20",
  "room": "Assembly:The Tinkering To Come - bstly",
  "slug": "36c3-1524-session_what_is_the_tinkering_to_come_",
  "title": "What is the Tinkering To Come?",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "talk",
  "language": "de",
  "abstract": "",
  "description": "The Secretary of the Tinkering To Come explains the Mission\nThe Secretary of The Tinkering To Come explains everything concerning the Tinkering To Come and how you can participate.\"We are a group of hacker attracted people who founded The Tinkering To Come as an opportunity to work together on cultural and political projects and at least the big plan to find a place to shape for creativity and sustainability use and to let different events happen there. In the last couple of years we came up with four main measures: 1. The \"digitale bstly\", as a digital place outside the big social networks with our own infrastructure. 2. The \"Sekretariat dKB\" as an office to handle financial and bureaucratic task and to support the happening of events. There for a registered association is necessary. As chairman in a voluntary culture association the knowledge is given for this step. 3. The \"Kongress der Kommenden Bastelei\" as yearly meetup to see each other and talk about future plans. 4. At least the \"Bastelei in der Bredouille\" to found a terrain for constructions and gardening.- Our assembly on congress is just a place to meet with other communities and to discuss and explore our ideas and possibilities. Of course there are professions where we need some help and we want to use the nice congress atmosphere to talk and tinker together! \"",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Louisfabu",
      "public_name": "Louisfabu"
    }
  ],
  "links": [
    "http://bstly.de"
  ]
}