{
  "id": 590,
  "guid": "14299031-3b3a-5f01-a970-903ea39d96de",
  "logo": "",
  "date": "2019-12-28T12:00:00+01:00",
  "start": "12:00",
  "duration": "01:30",
  "room": "WikiPaka WG: Bibliothek",
  "slug": "HXVTTM",
  "url": "https://cfp.verschwoerhaus.de/36c3/talk/HXVTTM/",
  "title": "Demo-Aktionstraining",
  "subtitle": "",
  "track": "Resilience & Sustainability",
  "type": "Workshop",
  "language": "de",
  "abstract": "Eine theoretische und praktische Einführung für aktionsorientierte Demonstrationen.",
  "description": "Bei Demonstrationen setzen sich Menschen für Werte und Ideale ein, für die sie einstehen und machen auf für sie wichtige Themen aufmerksam. Gerade im letzten Jahr durften wir in Deutschland und weltweit erleben, wie sich vermehrt junge Menschen vor allem für Umweltthemen bei Demonstrationen einsetzen.\r\n\r\nDabei bietet sich bei aktionsorientierten Demonstrationen eine Vielzahl an Möglichkeiten, wie sich durch Zivilcourage aktiv für ein Thema eingesetzt werden kann, jedoch auch ein erhöhtes Konfliktpotential. Für eine erfolgreiche Demonstration ist es gut, zu wissen, mit welchem Verhalten Konflikte und Gefahren vermieden und Möglichkeiten ausgeschöpft werden können.\r\n\r\nKonkret: Wir verbinden Theorie und Praxis. Im ersten Teil werden rechtliche Grundlagen, Verhalten auf Versammlungen und gängige Konzepte (Bezugsgruppen, Demorucksack, usw.) vorgestellt. Im zweiten Teil werden Mittel des Zivilen Ungehorsams geprobt und Techniken zur Vermeidung von Verletzungen erlernt. Zum Abschluss werden die erlebten Erfahrungen reflektiert und wir tauschen uns darüber aus, um z. B. auch die Wirkung auf die Polizei besser zu verstehen und gezielt einsetzen zu können.",
  "recording_license": "",
  "do_not_record": true,
  "persons": [
    {
      "id": 86,
      "code": "8FHGUJ",
      "public_name": "SAY IT LOUD e.V.",
      "biography": "Der SAY IT LOUD e.V. wurde vor vier Jahren als gemeinnütziger Verein gegründet, mit dem Ziel politische Initiativen und Organisationen in Leipzig mit diversen Infrastrukturellen Mitteln zu unterstützen. Das Hauptanliegen des Vereins ist die Unterstützung zur Organisierung und Durchführung von Versammlungen und Veranstaltungen. Ein weiterer Schwerpunkt liegt in der Wissensvermittlung zum Organisieren von Versammlungen und dem Verhalten in Demonstrationen. Der Verein dient als Träger für verschieden Projekte und stellt regelmäßig für Demos in Leipzig und Sachsen Lautsprecher-Wägen und Technik bereit.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}