{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10991.html",
  "id": 10991,
  "guid": "170c8a30-2d88-406a-8b6e-4575a2cf156d",
  "logo": "/system/events/logos/000/010/991/large/sf4_logo_b.png?1572101990",
  "date": "2019-12-27T20:50:00+01:00",
  "start": "20:50",
  "duration": "01:00",
  "room": "Dijkstra",
  "slug": "36c3-10991-science_for_future",
  "title": "Science for future?",
  "subtitle": "What we can and need to change to keep climate change low - the scientist view",
  "track": "Science",
  "type": "lecture",
  "language": "en",
  "abstract": "This talk is to show the current state of the discussion on climate change and the necessary and possible changes from a scientific perpesctive. It is to give some typical relevant answers and to foster the resiliance against climate sceptic questioning. This is one of the main tasks the scientist for future are trying to tackle.",
  "description": "The climate crisis is already existing and it is going to become worse. Looking at the pure facts of the changing climate, the acidication of the oceans, the slowly but steady rising of the sea level and the strengthening earth response effects, which make thing worse, it is hard to stay optimistic on the development of human kind on this planet. This lead to the largest social movement in Germany since the second world war fighting for a limitation of climate change to a maximum average temperature increase of 1.5°C.\r\nOn the other hand, this movement is often disputed. Since the necessary changes are not liked by everyone, the engagement of especially students was attacked also by politicians – even declaring that they should leave such issues to the professionals. At this point scientist for future joined together to support the demands of the students and declare, „they are right“.\r\nThis support is urgently needed. People have many open questions. The necessary changes are involving all societies in the world. In Germany, one of the most disputed topics is the field of energy, its generation, distribution and use. Is it actually possible to go for 100% renewable energies? What would this lead to? These are typical questions – which are not easy to answer. \r\nOther typical questions are more fundamental, since climate sceptics are increasing in their relevance and their social media outreach. Thus a lot of people encouter questions, they cannot answer.\r\nThis talk is to show the current state of the discussion on climate change and the necessary and possible changes from a scientific perpesctive. It is to give some typical relevant answers and to foster the resiliance against climate sceptic questioning. This is one of the main tasks the scientist for future are trying to tackle.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 1405,
      "public_name": "Bernhard Stoevesandt"
    }
  ],
  "links": [
    {
      "url": "https://www.scientists4future.org/",
      "title": "Scientists for Future"
    }
  ],
  "attachments": [
    {
      "url": "/system/event_attachments/attachments/000/004/094/original/20191227_Climate_Change.pdf?1577623007",
      "title": "Presentation (with additional slides in German)"
    }
  ]
}