{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10600.html",
  "id": 10600,
  "guid": "1773b17c-3598-4d09-a7b9-6023bb282fb9",
  "logo": null,
  "date": "2019-12-28T11:30:00+01:00",
  "start": "11:30",
  "duration": "01:00",
  "room": "Eliza",
  "slug": "36c3-10600-was_tun_bevor_es_brennt_-_wie_grunde_ich_eigentlich_einen_betriebsrat",
  "title": "Was tun bevor es brennt - wie gründe ich eigentlich einen Betriebsrat?",
  "subtitle": "Wie gründe ich einen Betriebsrat, bevor die Kacke dampft?",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "de",
  "abstract": "Aktiv werden zur rechten Zeit - Stand up for Your Right!\r\n\r\nBetriebsrat - klingt für viele IT-ler*innen doch nach letztem Jahrtausend. Dabei ist dies ein hart erkämpftes und wichtiges Instrument, um der Stimme der Beschäftigten bei der Geschäftsleitung Ausdruck zu verleihen. Wir  schildern anhand eines konkreten Beispiels, wie ein Betriebsrat gegründet wird, ohne dass die Chefetage zwischendurch schon den Stecker zieht. ",
  "description": "Das deutsche Arbeitsrecht in Form des Betriebsverfassungsgesetzes garantiert die Mitsprache der Belegschaft in jeder Firma mit mehr als fünf Arbeitnehmer*innen. Dabei ist vieles zu beachten - und ohne eine professionelle Begleitung z.B. durch eine Gewerkschaft kaum zu schaffen.\r\n\r\nIn unserer Firma geht es ab: Massenentlassungen aufgrund ökonomischer Turbulenzen. Die Geschäftsleitung spielt dirty und schaut, womit sie durchkommt. Höchste Zeit für einen Betriebsrat! \r\n\r\n• Um zu erfahren, dass man gemeinsam stark sein kann.\r\n• Um der Gechäftsleitung klarzumachen. was geht und was nicht. \r\n• Um bei Einstellungen und Entlassungen Fairplay zu gewährleisten. \r\n• Um die verbrieften Rechte  der Beschäftigten durchzusetzen. \r\n\r\nAm Beispiel einer Berliner Großraumdiskothek und einem ebenso in Berlin ansässigen Musikinstrumenteherstellers, welches kürzlich einem Fünftel seiner Belegschaft betriebsbedingt gekündigt hat, zeigen wir wie das geht mit der Betriebsratsgründung, worauf unbedingt zu achten ist und wo Interessierte professionelle Unterstützung für dieses organisatorischen Kraftakt finden können. \r\n\r\nDen Talk halten wir zu viert: eine Beschäftigte der Diskothek, ein Beschäftigter des Musikinstrumenteherstellers, ein Vertreter der IG Metall und ein Vertreter von ver.di. \r\n\r\nAm besten geht das von der Hand, bevor es ungemütlich wird. \r\n",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9260,
      "public_name": "Hüpno"
    },
    {
      "id": 9821,
      "public_name": "Lissim"
    },
    {
      "id": 9824,
      "public_name": "Ole "
    },
    {
      "id": 9820,
      "public_name": "Thomas Weber"
    }
  ],
  "links": [],
  "attachments": []
}