{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10574.html",
  "id": 10574,
  "guid": "1994b28a-5725-4b4a-a289-e759eb647dd8",
  "logo": null,
  "date": "2019-12-29T17:30:00+01:00",
  "start": "17:30",
  "duration": "01:00",
  "room": "Ada",
  "slug": "36c3-10574-human_rights_at_a_global_crossroads",
  "title": "Human Rights at a Global Crossroads",
  "subtitle": "Whistleblowers and the Cases of The Snowden Refugees and Edward Snowden",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "en",
  "abstract": "An update on the circumstances of Mr Snowden and the Snowden Refugees will be provided at the 36C3 event and venue in December 2019. There have been many significant events and incidents during 2019.",
  "description": "Of these significant events is the major success of Vanessa Rodel and her daughter Keana being granted refugee status by Canada and resettled in Montreal, Canada in late March 2019. Vanessa’s journey to Canada will be discussed. \r\n\r\nMore significantly the issue of  the Canadian government having left Supun and his family and Ajith behind in Canada has split up a family namely Keana in Montreal from her father Supun and siblings Sethumdi and Dinath in Hong Kong.  \r\n\r\nIn further context of the emerging police state that Hong Kong has become and its arbitrary and disproportionate use of violence against protesters and innocent civilian bystanders and breaches of constitutional rights and under international law, this has re-traumatized The Snowden Refugees in Hong Kong and has put them all at heightened risk. \r\n\r\nThe lecture will cover the current global erosion and dismantling of international refugee and constitutional law by increasingly authoritarian democracies and loss of international protection for whistleblowers and those who protect whistleblowers. It will be discussed how this has impacted upon the cases of Mr Snowden and The Snowden Refugees.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 8588,
      "public_name": "Robert Tibbo"
    },
    {
      "id": 8026,
      "public_name": "Edward Snowden"
    }
  ],
  "links": [],
  "attachments": []
}