{
  "id": 201,
  "guid": "1a12a734-c498-535b-9292-831e529a14c2",
  "logo": "",
  "date": "2019-12-27T21:00:00+01:00",
  "start": "21:00",
  "duration": "00:50",
  "room": "Chaos-West Bühne",
  "slug": "GZGQK3",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/GZGQK3/",
  "title": "Rosa Listen",
  "subtitle": "",
  "track": "Queer",
  "type": "Doppelter Slot",
  "language": "de",
  "abstract": null,
  "description": "\"Eine Regierung hat auch die Pflicht uns vor zukünftigen Regimen zu schützen.\" Anhand der Rosa Liste möchte ich aufzeigen weshalb das ein wichtiger Grundsatz moderner Demokratien ist.\r\n\r\nIn der Weimarer Republik und der Ersten Republik Österreich wurden Listen angelegt in denen zahlreiche Daten über tatsächliche oder vermeintliche Homosexuelle gesammelt und auf Vorrat gespeichert wurden. In der NS-Diktatur wurden diese Listen genutzt, um eine möglichst große Anzahl Homosexueller in Konzentrationslager (KZ) zu bringen. In diesen bekamen sie den berühmten Rosa Winkel als Kennzeichnung, wodurch sie auch Repressalie von anderen Insassen ausgesetzt waren. Noch heute gilt die Rosa Liste als eines der schlimmsten Beispiele wie auf Vorrat gespeicherte Daten missbraucht werden können.\r\n\r\nAls Datenschützer und Bisexueller möchte ich näher auf diesen besonderen Teil der Geschichte eingehen und aufzeigen was daraus lernen sollten.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 146,
      "code": "TWFMUJ",
      "public_name": "Erwin Ernst 'eest9' Steinhammer",
      "biography": "Erwin Ernst Steinhammer ist netzpolitischer Aktivist und studiert Politikwissenschaft. Er war lange Zeit als Software Consultant tätig und hat sich im Zuge dessen auch mit den gesellschaftlichen Auswirkungen der Automatisierung beschäftigt. Als Verfechter von Grundrechten, insbesondere dem Informationsfreiheitsgesetz, interessierte er sich bald auch für das Staatsschutzgesetz. Als später die Einführung eines Bundestrojaners beschlossen werden sollte, war er einer der Ersten, die im parlamentarischen Begutachtungsverfahren Kritik äußerten. Heute behält er für epicenter.works die netzpolitischen Entwicklungen, im Parlament und in der Regierung, genau im Auge.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}