{
  "id": 221,
  "guid": "1a8d5fce-a813-5272-83d2-8c21a54a6516",
  "logo": "/media/36c3/images/CBGVT9/logo-quadrat-vector.jpg",
  "date": "2019-12-27T19:00:00+01:00",
  "start": "19:00",
  "duration": "00:50",
  "room": "Chaos-West Bühne",
  "slug": "CBGVT9",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/CBGVT9/",
  "title": "\"Unvorstellbare Einzelfälle\" und \"neue Phänomene\"? - Kontinuitäten des rechten Terrors",
  "subtitle": "",
  "track": "Antifaschimus",
  "type": "Doppelter Slot",
  "language": "de",
  "abstract": null,
  "description": "Christchurch, El Paso, Walter Lübcke, Halle – seit 2019 verbinden wir diese Orte und Namen mit rechtem Terror. Auf jeden Anschlag folgte auch in diesem Jahr eine öffentliche Debatte, in der rechter Terror meist als neues Phänomen erscheint. Je größer jedoch die Häufung der Anschläge, desto absurder erscheinen die Worte von „unvorstellbaren Einzelfällen“, begangen von „verrückten Einzeltätern“. Diese Erzählungen haben einen anderen Zweck, als rechten Terror die Grundlage zu entziehen. Sie sollen sagen: ‚Wir hätten es nicht wissen können, hätten nichts tun können und werden auch zukünftig nichts verhindern‘. \r\n\r\nDabei ist das Gegenteil der Fall: Rechter Terror hat auch nach 1945 nie aufgehört und obwohl an jedem Fall etwas Spezielles ist, so gibt es doch Gemeinsamkeiten und Kontinuitätslinien. Rechtsterroristen und Rechtsterroristinnen wie etwa der NSU oder Anders Breivik kämpften immer mit den Mitteln der Zeit für die Umsetzung ihrer Ziele: Der Umsturz der Gesellschaft durch massive Gewalt, um ihre wahlweise autoritäre, heteronormative, völkische Vision einer Volksgemeinschaft verwirklichen zu können. Aus dieser Geschichte des rechten Terrors und den gesellschaftlichen Reaktionen darauf können wir lernen ihnen etwas entgegenzusetzen.\r\n\r\nCaro Keller von NSU-Watch wird anhand exemplarischer Fälle die wichtigen Kontinuitätslinien herausarbeiten. Vor diesem Hintergrund nimmt sie auch den aktuellen rechten Terror, Phänomene wie toxische Männlichkeit oder „Gamification of Terror“ in den Blick. Es wird aufgezeigt, ob und wie wir als Antifaschist*innen und Gesellschaft dieses Wissen gegen rechten Terror einsetzen können.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 168,
      "code": "QN3REG",
      "public_name": "Caro Keller",
      "biography": "Caro Keller ist seit 2013 Teil des antifaschistischen Bündnisses NSU-Watch, seit Ende 2016 dort auch Redakteurin, verantwortlich u.a. für Website- und Social Media Output sowie den Podcast \"NSU-Watch: Aufklären & Einmischen  -Der Podcast über den NSU-Komplex, rechten Terror und Rassismus\". \r\n\r\nDas bundesweite antifaschistische Bündnis „NSU-Watch: Aufklären und Einmischen” recherchiert Hintergründe und dokumentiert aktuelle Entwicklungen zum NSU-Komplex und rechtem Terror. NSU-Watch begleitet die verschiedenen juristischen und parlamentarischen Aufklärungsbemühungen von rechtem Terror kritisch. Die unabhängige Beobachtungsstelle wurde von antifaschistischen und antirassistischen Projekten aus dem gesamten Bundesgebiet gegründet, die teilweise seit mehr als zwei Jahrzehnten die extreme Rechte beobachten.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}