{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/11045.html",
  "id": 11045,
  "guid": "1c7eab0e-c799-49cd-b0f3-46acf5e1ab60",
  "logo": null,
  "date": "2019-12-28T22:10:00+01:00",
  "start": "22:10",
  "duration": "01:00",
  "room": "Eliza",
  "slug": "36c3-11045-confessions_of_a_future_terrorist",
  "title": "Confessions of a future terrorist",
  "subtitle": "A rough guide to over-regulating free speech with anti-terrorist measures",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "en",
  "abstract": "We will examine the European Commission’s proposal for a regulation on preventing the dissemination of terrorist content from as a radical form of censorship. Looking at the rationale and arguments of policy-makers in Brussels, we will discuss normalisation of a “do something doctrine” and “policy-based evidence”. How can citizens and activists influence that legislative process? And what does it mean if they won’t?",
  "description": "Fear of terrorism as a tool for dissent management in the society is utilised almost everywhere in the world. This fear facilitates the emergence of laws that give multiple powers to law enforcement, permanently raising threat levels in cities around the world to “code yellow”. A sequel of that show is now coming to a liberal democracy near you, to the European Union. The objective of the terrorist content regulation is not to catch the bad guys and girls, but to clean the internet from images and voices that incite violence. But what else will be cleaned from in front of our eyes with this law with wide definitions and disproportionate measures? \r\n\r\nIn the Brussels debate, human rights organisations navigate a difficult landscape. On one hand, acts of terrorism should be prevented and radicalisation should be counteracted; on the other, how these objectives can be achieved with such a bad law? Why are Member States ready to resign from judicial oversight over free speech and hand that power to social media platforms? Many projects documenting human rights violations are already affected by arbitrary content removal decisions taken by these private entities. Who will be next?\r\n\r\nIn the digital rights movement we believe that the rigorous application of principle of proportionality is the only way to ensure that laws and subsequent practices will not harm the ways we exercise the freedom of speech online. Reaching to my experience as a lobbyist for protection of human rights in the digital environment, I want to engage participants in the conversation about the global society of the near future. Do we want laws that err on the side of free speech and enable exposure to difficult realities at the risk of keeping online the content that promotes or depicts terrorism? Or do we “go after the terrorists” at the price of stifling citizen dissent and obscuring that difficult reality? What can we do to finally have that discussion in Europe now that there is still time to act? \r\n",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9724,
      "public_name": "Anna Mazgal"
    }
  ],
  "links": [],
  "attachments": []
}