{
  "id": 1244,
  "guid": "1d78e5c5-6395-47de-9888-9fed5a22f59f",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Cidre_Making",
  "logo": null,
  "date": "2019-12-27T19:00:00+01:00",
  "start": "19:00",
  "duration": "3:00",
  "room": "Assembly:Foodhackingbase",
  "slug": "36c3-1244-session_cidre_making",
  "title": "Cidre Making",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "hands-on",
  "language": "en",
  "abstract": "",
  "description": "This workshop is heavily hands on (and also shoulders, arms and so on) with some demonstrations and of course product tasting. The idea is to share knowledge about cider making.\n[[Image:800px-Pressage_garcons_en_action_faa102019.jpg|thumb|garçons in action]][[Image:800px-Pressage_nettoyage_faa102019.jpg|thumb|piscine de pommes]][[Image:800px-Moi_nuren_1600_faa05122019.jpg|thumb|feeding the rap]][[Image:800px-Pressage_pressoir_mout_faa102019.jpg|thumb|marc being pressed]][[Image:800px-Marc_pommes_1600_faa05122019.jpg|thumb|pressed marc de pommes]][[Image:800px-Cider_sample_testing_ferme_du_vastel_29012017.jpg|thumb|cidre density measurement]][[Image:800px-Soutirage_cubbi_ibc_1600_faa112019.jpg|thumb|soutirage/racking 10 hl IBC]][[Fhb_36c3|<<<Back to the main page>>>]][https://dudle.inf.tu-dresden.de/cidremaking36c3/ To secure spot on this workshop please sign in here.]This workshop is heavily hands on (and also shoulders, arms and so on) with some demonstrations and of course product tasting. The idea is to share as much knowledge about cider making which I got during my formation at [http://cfppa.le-robillard.fr/ le Robillard] and from my own brewing within this limited time as possible. It is suitable for people who are already doing cider and for the ones who are really interested. Not all of the things which I ([[User:Algoldor|Algoldor]]) plan to do with you are going to happen because of the biological and chemical limitations, like défécation for example. During the event you can count on tasting and crashing the different cider variety apples which I bring for you from France and this time with names attached. The focus will be on amère (bitters) and douce-amère (bitter-sweets) varieties which are out of France and UK. After crashing we will do pressing (first designated for cider) and after that rémiage (adding water to already pressed marc) to get second press which is traditionally fermented into less alcoholic petit cidre. We will do also measurement of density and will talk about how to do it properly. Alcohol test on pectin shouldn't also be a problem. If all goes well, but as said above who knows, we may be able to have chapeau brun or chapeau blanc so you can see it in real life and if so we can do proper separation by soutirage/racking. Soutirage will be done one way or other by gravity or pump on another batch or water. I plan to bring non-self priming pump so you will also learn how to use it. It may sounds simple but if you have never done it before and you for example buy it second hand like me, there are some \"cliffhangers\" which we can overcome in one session instead of getting \"f\" during season or two. If anyone can get hands on decent pH meter and microscope, than we could do also proper measurements and possibly counting of yeast cells but that really depends if we get this equipment or not, I do not have it at the moment. Of course part of the workshop will be small tasting of what we pressed, some young cider and some ciders, plus I'll try to get some specific defects - much harder to get hands on than good cider by the way. Well as you can see there is plenty to talk about and even more to do. It would be a good idea to bring some \"non VIP cloths\", you know what happens if you stand on the wrong end of the hose ...'''This workshop is donation based no one turned away for lack of funds'''. With limited amount of spots and because of the complexity any help from the ones who actually \"have\" would be appreciated. I do estimate the overall costs of the workshop around €200 and lets be honest I'm more or less \"forgetting\" all the time needed to make it happen. For me this is really a passion and something what I feel like I'm starting to have quite pretty good expertise in, it would be hard for you to get this info somewhere else quickly so I it makes sense to me to share it with you.[[category:36c3]]",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Algoldor",
      "public_name": "Algoldor"
    }
  ],
  "links": [
    "https://foodhackingbase.org/wiki/Cidre_making_36c3"
  ]
}