{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Lineup/events/11271.html",
  "id": 11271,
  "guid": "1db63fa5-55a3-4c1b-9e38-61b9c2b90917",
  "logo": "/system/events/logos/000/011/271/large/Madmotormiquel.jpg?1577204315",
  "date": "2019-12-29T18:00:00+01:00",
  "start": "18:00",
  "duration": "03:00",
  "room": "Discotheque Nouveauancien",
  "slug": "36c3-abfahrplan-11271-madmotormiquel",
  "title": "Madmotormiquel",
  "subtitle": "House",
  "track": "Music",
  "type": "djset",
  "language": "en",
  "abstract": "",
  "description": "Since the magical 1980’s, the species known as Raver focused on creating the perfect dance move to express on this dance-floor of life. Around the same time, Michael Neigenfend, a young boy from the limited-travel zone of West Berlin decided he wanted to find a sound that knew no limits to their dedication. Oh shit, another DJ is born.\r\n\r\nArmed with an expanding taste in classic punk rock and hip-hop, soon he was led into the world of powerful beats that the future-forming kids around him loved so much. He met them in the church of acid techno, big-beat and drum and bass—a place where he jockeyed the discs for many weekends until it was clear he needed to have a say on those beats himself. Here, under the light of a crescent moon, a new producer is born.\r\n\r\nBy now the Berlin Wall was well and truly down and you could even buy small pieces of it from the shop, meaning that his home city was filled with more space than the ravers knew how to sing and dance about. So they squatted its old factories and made techno rituals in the neighbouring fields and danced and played and danced and played until one day someone said ‘Hey, why not bring all the ideas of all the different people together and start something that will blow everyone away?’ This is when the Bachstelzen came alive, and when the name Madmotormiquel became synonymous with everything the Berlin house music parade has been known for since.\r\n\r\nIn the midst of this happening, along with Sebo and Soukie & Windish, he formed the label URSL which some claim is a code word meaning ‘Good Times’.   Whether that’s true or not, the success of the label continues to bring the good times fast and thick.  With his releases spreading to all corners of the planet and giving him the chance to make up for all the limited travel of his past, he now spends his weekends playing his music in exotic locations with nice people, helping us to perfect the art of shape-making and movement creation one dance-floor at a time.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [],
  "links": [
    {
      "url": "https://soundcloud.com/madmotormiquel",
      "title": "Madmotormiquel auf Soundcloud"
    }
  ],
  "attachments": []
}