{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/11043.html",
  "id": 11043,
  "guid": "1dc2e3b8-8437-4b1e-8252-412be2b6ec5a",
  "logo": "/system/events/logos/000/011/043/large/hs_logo_-_black.png?1572116221",
  "date": "2019-12-29T14:10:00+01:00",
  "start": "14:10",
  "duration": "01:00",
  "room": "Eliza",
  "slug": "36c3-11043-humus_sapiens",
  "title": "HUMUS sapiens",
  "subtitle": "Open Soil Research",
  "track": "Resilience & Sustainability",
  "type": "lecture",
  "language": "en",
  "abstract": "<p>HUMUS sapiens represents a compilation of soil explorations emerging from the networks of mikroBIOMIK, Hackteria, and Gasthaus – with the ambition to bring DIY (do-it-yourself) and DIWO(do-it-with-others) approaches as well as an open-source-based “hacker spirit” into soil ecology. Participants are invited to reflect on current scientific discourses and critical societal challenges through hands-on tinkering and curiosity-driven research.</p>",
  "description": "<p>Far more than just the dirt under our feet, soil is a truly complex and dynamic ecosystem. It is a constantly changing mix of minerals, living organisms, decaying organic matter, air, and water. It is the living skin of our planet, allowing new forms of life to come into being, incorporating the nutrients left there by organisms of the past. Soil is bursting with life and can be vastly different from one square centimeter to the next. From plants, earthworms, insects, and fungi to invisible amoeba, nematodes, algae, and bacteria – each creature provides their own essential role in the soil ecosystem. The shared nature of the soil habitat manifests not only through the highly interconnected so-called “soil food web” – which is mainly driven by microbial metabolism – but also in regard to humans and their dependence on the productivity of edible plants. It is this dependency that motivates Homo sapiens to manipulate natural ecosystems, while at the same time failing to understand them. Human impact on the soil, especially intensive agricultural practices (deforestation, overgrazing, use of agrochemicals, etc.) and urbanization, leads to compaction, loss of soil structure, nutrient degradation,and contamination – ultimately, the breaking down of these ecosystems and eroding of the soil to infertile desert.</p>\r\n\r\n<p>HUMUS sapiens aims to reexamine these problems from an ecosystem's viewpoint and to support the paradigm shift from an anthropocentric ideology to a more biocentric philosophy of life.</p>\r\n",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 8644,
      "public_name": "Julian mikroBIOMIK.org"
    },
    {
      "id": 9735,
      "public_name": "Moritz Chollet"
    },
    {
      "id": 9736,
      "public_name": "Hellmut von Koerber"
    },
    {
      "id": 9877,
      "public_name": "Malte Larsen"
    }
  ],
  "links": [
    {
      "url": "https://mikrobiomik.org/en/",
      "title": "mikroBIOMIK Society"
    },
    {
      "url": "https://www.hackteria.org/",
      "title": "International Hackteria Network"
    }
  ],
  "attachments": []
}