{
  "id": 220,
  "guid": "1e6d2e5d-31b2-5877-97aa-b03e8bf8dffd",
  "logo": "/media/36c3/images/7PERQN/53761191_1876875599091269_7223011896578801664_o.png",
  "date": "2019-12-29T02:00:00+01:00",
  "start": "02:00",
  "duration": "02:00",
  "room": "Chaos-West Bühne",
  "slug": "7PERQN",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/7PERQN/",
  "title": "intergalactic gas distribution (light)",
  "subtitle": "",
  "track": "Klangteppich",
  "type": "Klangteppich",
  "language": "en",
  "abstract": null,
  "description": "Improvised music, visualised and influenced through artificial intelligence. Dialogue in space, interaction, improvisation, live sampling, as well as the creative use of traditional and experimental instruments, synthesizers, electronic effects and everyday life objects -- all of which turns into music under the influence of AI. Evolving from this is a unique, atmospheric sound and non-repeatable sound experience. The employed AI consists of a neural network, thus an exemplary reproduction of brain functions. The data sets which are used to train the network includes behavioural modelling data as and the distribution of gases in space. Glitches and non-perfect behavior is strongly appreciated! The \"light\" version is just the dialog between algorithm and modular. live Ambient / Drone / Soundscape",
  "recording_license": "",
  "do_not_record": true,
  "persons": [
    {
      "id": 167,
      "code": "PCHHEA",
      "public_name": "timodufner",
      "biography": "Timo Dufner is a musician, media artist and computer scientist. His work focuses on testing limits of hard- and software. In doing so, glitches are an unavoidable component he consciously puts up with. Characteristic features of his work also include direct interaction between sound and image and an exchange between audience and piece. All of his works are created real-time – in the very moment – and thus each performance is different. Real-time audio processing, machine learning and AI, live coding and numerous electronical instruments are being deployed.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}