{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10709.html",
  "id": 10709,
  "guid": "1f817e1c-c8cc-4d48-8215-a0d016360fd7",
  "logo": null,
  "date": "2019-12-27T16:10:00+01:00",
  "start": "16:10",
  "duration": "01:00",
  "room": "Eliza",
  "slug": "36c3-10709-a_deep_dive_into_unconstrained_code_execution_on_siemens_s7_plcs",
  "title": "A Deep Dive Into Unconstrained Code Execution on Siemens S7 PLCs",
  "subtitle": "",
  "track": "Security",
  "type": "lecture",
  "language": "en",
  "abstract": "A deep dive investigation into Siemens S7 PLCs bootloader and ADONIS Operating System.",
  "description": "Siemens is a leading provider of industrial automation components for critical infrastructures, and their S7 PLC series is one of the most widely used PLCs in the industry. In recent years, Siemens integrated various security measures into their PLCs. This includes, among others, firmware integrity verification at boot time using a separate bootloader code. This code is baked in a separated SPI flash, and its firmware is not accessible via Siemens' website. In this talk, we present our investigation of the code running in the Siemens S7-1200 PLC bootloader and its security implications. Specifically, we will demonstrate that this bootloader, which to the best of our knowledge was running at least on Siemens S7-1200 PLCs since 2013, contains an undocumented \"special access feature\". This special access feature can be activated when the user sends a specific command via UART within the first half-second of the PLC booting. The special access feature provides functionalities such as limited read and writes to memory at boot time via the UART interface. We discovered that a combination of those protocol features could be exploited to execute arbitrary code in the PLC and dump the entire PLC memory using a cold-boot style attack. With that, this feature can be used to violate the existing security ecosystem established by Siemens. On a positive note, once discovered by the asset owner, this feature can also be used for good, e.g., as a forensic interface for Siemens PLCs. The talk will be accompanied by the demo of our findings.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9236,
      "public_name": "Ali Abbasi"
    },
    {
      "id": 9787,
      "public_name": "Tobias Scharnowski"
    }
  ],
  "links": [],
  "attachments": []
}