{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10892.html",
  "id": 10892,
  "guid": "1fa314fd-c59a-450b-8347-05224b473972",
  "logo": null,
  "date": "2019-12-28T14:10:00+01:00",
  "start": "14:10",
  "duration": "01:00",
  "room": "Eliza",
  "slug": "36c3-10892-schweiz_netzpolitik_zwischen_bodensee_und_matterhorn",
  "title": "Schweiz: Netzpolitik zwischen Bodensee und Matterhorn",
  "subtitle": "E-ID, E-Voting, Netzsperren und andere netzpolitische Schauplätze in der Schweiz",
  "track": "CCC",
  "type": "lecture",
  "language": "de",
  "abstract": "Die Intensität des Kampfes um die Freiheit im digitalen Raum lässt auch in der Schweiz nicht nach. Wir blicken auf das netzpolitische Jahr 2019 in der Schweiz zwischen Bodensee und Matterhorn zurück. Wir behandeln jene Themen, die relevant waren und relevant bleiben. Weiter zeigen wir, was von der Digitalen Gesellschaft in der Schweiz im neuen Jahr zu erwarten ist.",
  "description": "Die Intensität des Kampfes um die Freiheit im digitalen Raum lässt auch in der Schweiz nicht nach. Wir blicken auf das netzpolitische Jahr 2019 in der Schweiz zwischen Bodensee und Matterhorn zurück. Wir behandeln jene Themen, die relevant waren und relevant bleiben. Weiter zeigen wir, was von der Digitalen Gesellschaft in der Schweiz im neuen Jahr zu erwarten ist.\r\n\r\nThemen sind unter anderem:\r\n<ul>\r\n    <li><b>Elektronische Identifizierung (E-ID):</b> Das Gesetz, welches die elektronische Identifizierung regelt, ist verabschiedet worden. Der digitale Ausweis soll von privaten Unternehmen herausgegeben werden. Wir haben das Referendum gegen das Gesetz ergriffen.</li>\r\n\r\n    <li><b>E-Voting:</b> Ein öffentlicher Test des letzten sich im Rennen befindenden Systems war vernichtend. Wie es nun weitergeht im Kampf für das Vertrauen in die direkte Demokratie in der Schweiz.</li>\r\n\r\n    <li><b>Netzsperren:</b> Das erste Gesetz in dem Netzsperren explizit verankert sind, ist dieses Jahr in Kraft getreten. Wie es in der Umsetzung aussieht</li>\r\n\r\n    <li><b>Leistungsschutzrecht:</b> Was es ins neue Urheberrechtsgesetz geschafft hat - und wie das Leistungsschutzrecht gebodigt wurde.</li>\r\n\r\n    <li><b>Datenschutz:</b> Wo in der Schweiz besonders viel «Datenreichtum» zu beobachten war und was es mit der Login- bzw. Tracking-Allianz auf sich hat.</li>\r\n\r\n    <li><b>Netzneutralität:</b> Nach einem langen Kampf erhält die Schweiz eine gesetzlich verankerte Netzneutralität. Im kommenden Jahr wird das Gesetz in Kraft treten.</li>\r\n\r\n    <li><b>Digitale Gesellschaft in der Schweiz:</b> Winterkongress, Big Brother Awards und andere Aktivitäten.</li>\r\n</ul>\r\n\r\nNach  dem Vortrag sind alle interessierten Personen eingeladen, die Diskussion an einem Workshop fortzusetzen. Es werden Aktivistinnen und Aktivisten von verschiedenen Organisationen der Netzpolitik in der Schweiz anwesend sein (Digitale Gesellschaft, CCC-CH, CCCZH, Piratenpartei Schweiz).",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 6351,
      "public_name": "Patrick \"packi\" Stählin"
    },
    {
      "id": 7723,
      "public_name": "Kire"
    },
    {
      "id": 6379,
      "public_name": "Hakuna MaMate"
    }
  ],
  "links": [],
  "attachments": []
}