{
  "id": 191,
  "guid": "20e8e532-a5c8-5c46-b1e8-ee648ca653a9",
  "logo": "",
  "date": "2019-12-27T13:00:00+01:00",
  "start": "13:00",
  "duration": "00:50",
  "room": "Chaos-West Bühne",
  "slug": "RKMAKL",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/RKMAKL/",
  "title": "Risky Business?! – Rechte und Pflichten von IT-SicherheitsforscherInnen",
  "subtitle": "",
  "track": "All about computers",
  "type": "Doppelter Slot",
  "language": "de",
  "abstract": null,
  "description": "In einem Gespräch über die Hackertool-Paragraphen des Strafgesetzbuches in LNP 296 sagte Frank zu Linus: „Damals haben wir juristisch noch ein bisschen was dazugelernt, nämlich dass die Begründung bzw. Erläuterung des Gesetzes in der deutschen Jurisprudenz mit herangezogen wird.“ Diese Kenntnis reicht für das Lesen von Gesetzen und Gerichtsurteilen aus. Für die IT-Sicherheitsforschung und die Analyse beispielsweise leicht auffindbarer Login-Daten bedarf es aber umfangreicherer Kenntnisse. Fragt man dazu einen Juristen, ist die Antwort oft komplex und führt zum \"buffer overflow\" und einer \"brain resource exhaustion\" des Fragenden.\r\n\r\nDamit ForscherInnen beider Gebiete und Interessierte \"ressourcenschonender\" kommunizieren können und um das juristische Verständnis zu erweitern, fasst dieser Vortrag in einem Überblick die wichtigsten Punkte verständlich zusammen. Betrachtet werden das hauptsächlich Datenschutz- und IT-Sicherheitsrecht, am Rande auch erwähnte,  relevante Strafrechtsnormen. Die (prozessuale) Thematik der Hausdurchsuchung bleibt wegen des Talks vom 35c3 (https://media.ccc.de/v/35c3-10018-verhalten_bei_hausdurchsuchungen) außen vor.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 136,
      "code": "XXUL7E",
      "public_name": "Oliver Vettermann",
      "biography": "Oliver Vettermann ist Jurist und wissenschaftlicher Mitarbeiter im Team für Immaterialgüterrechte von Prof. Franziska Boehm. Für FIZ Karlsruhe betreut er interdisziplinäre Forschungsprojekte – vor allem in der IT-Sicherheit – im Datenschutz- und IT-Sicherheitsrecht. Bei seiner Tätigkeit an der Universität Leipzig widmet er sich für seine Promotion dem verfassungsrechtlichen Schutz der digitalen Identität. Zwischen diesen kopflastigen Tätigkeiten fährt er Fahrrad, schreibt englische Videospiel-Reviews und twittert sich mit Gifs als @magnus_cerebrum durch die Welt.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}