{
  "id": 1346,
  "guid": "218a0da9-ae64-4f6e-aae7-ff47817a9bbc",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Mobile_App_Entwicklung_f%C3%BCr_totale_Anf%C3%A4nger",
  "logo": null,
  "date": "2019-12-27T22:30:00+01:00",
  "start": "22:30",
  "duration": "1:30",
  "room": "Seminar room 14-15",
  "slug": "36c3-1346-session_mobile_app_entwicklung_fuer_totale_anfaenger",
  "title": "Mobile App Entwicklung für totale Anfänger",
  "subtitle": "Interaktive Live-Programmierung (also possible in English if desired)",
  "track": "self organized sessions",
  "type": "workshop",
  "language": "de",
  "abstract": "",
  "description": "Wir entwicklen gemeinsam eine kleine App für iPhones und Android Smartphones - und erklären dabei jeden einzelnen Schritt (We'll develop a simple mobile app - and explain each and every step along the way)\nWir entwicklen gemeinsam eine kleine App für Android und iOS. Dabei erkläre ich jeden einzelnen Schritt, lasse nichts aus, und programmiere so, wie man als Anfänger programmiert - mit viel Online-Recherche - sodass du danach direkt deine eigene App entwickeln kannst. Die App, die wir gemeinsam entwickeln, kannst du am Ende der Session ganz einfach auf deinem eigenen Smartphone nutzen. Ich zeige dir wie!Ein Computer muss nicht mitgebracht werden. Es ist wohl sinnvoller, meiner Live-Programmierung ohne eigenen PC zu folgen, um dann gezielt fragen stellen zu können. Du kannst aber auch gerne deinen eigenen Laptop mitbringen, wenn du magst.Welche Werkzeuge werden wir nutzen?- Wir werden das beliebteste und meist verbreiteste Werkzeug zur Entwicklung moderner Apps für das iPhone und Android Smartphones nutzen. Es heißt \"React Native\". Außerdem nutzen wir \"Expo\", mit dem wir ganz schnell entwickeln und die App sehr leicht auf anderen Smartphones testen können.---------------English version:This workshop is advertised in German, but everyone is very welcome to attend! If you don't speak German, I'll switch to German in case it's fine for everyone or repeat the most important steps in English otherwise.A few words about this workshop in English: In this interactive session we'll develop a small mobile app for Android and iOS. We won't skip any step to make it accessible for complete beginners. I'll live code in the manner a beginner would do it - with browsing for solutions online - to give you a feel of how you really do mobile development ;-)In the end, you'll be able to use the app on your own smartphone. I'll teach you about a great tool which makes mobile development easy.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Andru",
      "public_name": "Andru"
    }
  ],
  "links": [
    "https://docs.google.com/presentation/d/1SRET00zlK8-jbwDSuPjmKNOL4gCwnX2KHSRCOui2WUE/",
    "https://github.com/Andruschenko/simple-react-native-app"
  ]
}