{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10993.html",
  "id": 10993,
  "guid": "223072ad-66d0-4fea-ac7a-0cf6c384d3b0",
  "logo": "/system/events/logos/000/010/993/large/Screenshot_2019-11-17_17.20.55.jpg?1574007797",
  "date": "2019-12-27T14:10:00+01:00",
  "start": "14:10",
  "duration": "01:00",
  "room": "Borg",
  "slug": "36c3-10993-vom_ich_zum_wir",
  "title": "Vom Ich zum Wir",
  "subtitle": "Gesellschaftlicher Wandel in den Reden im Bundestag",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "de",
  "abstract": "Ein von Zeit Online entwickeltes Tool macht es möglich, die Plenarprotokolle des Bundestags grafisch und inhaltlich auszuwerten, und zwar seit seiner ersten Sitzung 1949 bis heute. In den 200 Millionen Wörtern zeigen sich historische Zäsuren, sie machen gesellschaftliche und sprachliche Entwicklungen sichtbar: Wie ernst nahm der Bundestag in den vergangenen Jahren den Klimawandel? Wie häufig redeten die Abgeordneten über Datenschutz, über Arbeitslosigkeit, über Rechtsextremismus, über Geflüchtete? Es wird sichtbar und vergleichbar, zu welchem Zeitpunkt welche Themen debattiert wurden, wie sich die politische Aufmerksamkeit über die Jahre verändert hat. Und die Daten belegen, wie die Sprache selbst sich verändert, nicht nur weil neue Themen aufkommen, sondern auch weil sich der Sprachgebrauch wandelt. ",
  "description": "Die Protokolle des Bundestags decken einen Zeitraum von siebzig Jahren ab. In dieser Zeit hat sich die Bundesrepublik stark verändert und damit natürlich auch die im Bundestag verwendete Sprache. Manche Dinge sind trivial, z.B. dass Flüchtlinge einst Vertriebene waren oder dass mit Computernetzen zusammenhängende Wörter erst in neuerer Zeit auftauchen. Andere überraschen, z.B. dass dem Wort \"Lüge\" zeitweise der Ausdruck \"Unwahrheit\" vorgezogen wurde oder dass seit der Wiedervereinigung mehr von Ostdeutschen als von Westdeutschen gesprochen wird. Anhand von einschlägigen Beispielen wollen wir erläutern, wie sich Sprache und mit ihr Politik verändert hat. Wir untersuchen die Rhetorik alter und neuer Rechter, die Rhetorik des \"Marktes\", der Krisen und natürlich auch die des gepflegten Beschimpfens.\r\n\r\nMit dem Tool lässt sich zeigen, welche Debatten groß und wortreich geführt wurden, welche klein und unbedeutend blieben, obwohl es vielleicht wichtig gewesen wäre, über die Themen zu debattieren. Die Sprache ist somit der Zugang zur Analyse der Politik des Parlaments.\r\n\r\nWoher stammen unsere Daten? \r\nWir haben die Protokolle aller Sitzungen des Deutschen Bundestages analysiert: 4.217 Protokolle aus 19 Legislaturperioden, insgesamt rund 200 Millionen Wörter. Sie stammen aus dem Open Data Portal des Bundestages. Jede Sitzung wird dort von Stenografen genau dokumentiert und auf diesem Portal veröffentlicht. Unsere Auswertung beginnt mit der ersten Sitzung am 7. September 1949 und endet mit der letzten Sitzung vor der Sommerpause 2019 — der Sondersitzung zur Vereidigung von Annegret Kramp-Karrenbauer als Verteidigungsministerin am 24. Juli 2019.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 2588,
      "public_name": "maha"
    },
    {
      "id": 6349,
      "public_name": "Kai Biermann"
    }
  ],
  "links": [],
  "attachments": []
}