{
  "id": 1715,
  "guid": "2456fdf7-f4d2-458a-9b85-2313058f9ec8",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Google-Sensei_and_Contract_Work_-_IT_in_Japan",
  "logo": null,
  "date": "2019-12-29T18:45:00+01:00",
  "start": "18:45",
  "duration": "1:15",
  "room": "Lecture room 12",
  "slug": "36c3-1715-session_google_sensei_and_contract_work_it_in_japan",
  "title": "Google-Sensei and Contract Work - IT in Japan",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "talk",
  "language": "en",
  "abstract": "",
  "description": "Japan is especially known for its technology among other things. Games and hardware of all kinds from Japan are everywhere but does anyone know good Japanese software? What IT in Japan looks like from inside and if Japan really is as high-tech as it is made out to be is the topic of this talk as experienced by a young German.\n'''THIS IS THE EXACT SAME TALK AS THIS MORNING, but again and in English.'''After I finished studying Japanology I went to Japan and without any knowledge landed an IT job. My euphoria of becoming an engineer (\"Enjinia\") was quickly replaced by the harsh reality of rote memorization, E-Mails that are 70% formalities and learning how to correctly exchange business cards. But despite all these curiosities there were valuable experiences along the way like taking part as an STM (\"Shownet Team Member\") for ShowNet, or a big presentation of bleeding-edge network technology at the Interop Tokyo (https://www.interop.jp/shownet/?lang=en). From April 2017 until June 2019 I experienced IT in Japan up close and now I want to tell you about it. I'll talk about wacky things like how Japan's Minister for Cyber Security doesn't know how to use a USB Stick (https://www.theguardian.com/world/2018/nov/15/japan-cyber-security-ministernever-used-computer-yoshitaka-sakurada)), general problems (e.g. education system, lack of English skills) and how they work around all of it (e.g. lots of meetups and communities).   This talk is less about technical stuff and more anecdotal experience showcase. It is for everyone who is interested in Japan or working with companies from there or thinking about doing so.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Mona144",
      "public_name": "Mona144"
    }
  ],
  "links": []
}