{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10720.html",
  "id": 10720,
  "guid": "24c6b9ca-d6f8-4e82-934d-4ea5dab47682",
  "logo": null,
  "date": "2019-12-29T21:50:00+01:00",
  "start": "21:50",
  "duration": "00:40",
  "room": "Eliza",
  "slug": "36c3-10720-how_data-driven_technology_helps_the_expansion_of_solar_and_wind_energy_in_south_korea",
  "title": "How Data-driven Technology Helps the Expansion of Solar and Wind Energy in South Korea",
  "subtitle": "",
  "track": "Resilience & Sustainability",
  "type": "lecture",
  "language": "en",
  "abstract": "Different from conventional fossil fuel power of total predictability, the power generation of volatile renewable energy (e.g., wind and solar) is intermittent and largely dependent on the weather. Because a reliable electric supply is more essential to increase the mix of volatile renewable energy, the precise prediction of its generation a key to bring forward the energy transition.\r\n\r\nThis talk will present experimental results of South Korean solar and wind power plants as a promising example of applying solar and wind power forecasting. These results will address the influence of rising environmental problems, such as micro-dusts and typhoons. A micro-dust (or fine dust, Asian dust) has been arisen as a disastrous issue in Asia due to the recent severe air pollution problems. Also the climate change has led to more frequent and stronger occurrences of typhoons in East Asia.\r\n",
  "description": "In order to push forward the energy transition to renewable energy, while ensuring the reliable supply of the electricity and the proper management of distributed energy resources, we must resolve the following problem: accurate forecasting of solar and wind power generation.\r\n\r\nNevertheless this is a quite challenging task involving the prediction of meteorological variables (irradiance, cloud index, wind speed, pressure, temperature and more) and the simulation of power plants with taking shadows for solar, turbulence for wind, and the directions and land types of installments into account. The appropriate strategies for predicting those meteorological variables and conditions of power plants vary up to forecasting horizon also in\r\nterms of whether to use surface observation data, numerical weather prediction, or satellite data.\r\n\r\nIn this talk, we will present cases of\r\n\r\n(1) developing a solar map in Korea;\r\n\r\n(2) applying solar power forecasting on Korean solar power plants;\r\n\r\n(3) applying wind power forecasting on wind power plants in Jeju, an island in Korea; and\r\n\r\n(4) analyzing the influence of micro-dusts and typhoons to solar energy generation in Korea.\r\n\r\nBoth micro-dusts and typhoons have recently arisen as crucial issues due to the recent severe air pollution problem in Asia and the more frequent and stronger occurrences of typhoons as a result of the climate change. \r\n\r\nAlong with the talk we would like to emphasize that the advancement of the current forecasting technology is the result of interdisciplinary research of many fascinating fields: from data assimilation based on meteorology and historical physical simulation to image analysis for satellite data based on the recent AI technology. This is only possible because a large part of those data is publicly available as open data. Open data and open source projects are playing a vital role in accelerating the further development of interdisciplinary collaboration, now that more data for surface observatories, meteorological predictions, satellites and power plants have become publicly available as well as related libraries for accessing satellite data and simulating power plants.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9535,
      "public_name": "Heuna Kim"
    }
  ],
  "links": [],
  "attachments": []
}