{
  "id": 1608,
  "guid": "25601f7b-e9a9-49fe-af8e-2b3920d3d53e",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:An_introduction_to_the_post-apocalyptic_skill_of_spinning_yarn",
  "logo": null,
  "date": "2019-12-29T12:50:00+01:00",
  "start": "12:50",
  "duration": "2:10",
  "room": "Assembly:Pseudoroom",
  "slug": "36c3-1608-session_an_introduction_to_the_post_apocalyptic_skill_of_spinning_yarn",
  "title": "An introduction to the post-apocalyptic skill of spinning yarn",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "hands-on",
  "language": "de",
  "abstract": "",
  "description": "We will show you and explain how to make your own yarn from wool and other fibres.\n++ Wir treffen uns für möglichst viel Tageslicht unten im CCL auf der Fläche am Wasserbecken (unter der Rolltreppe). ++Wir werden euch erklären und zeigen, wie man aus Wolle und anderen Fasern sein eigenes Garn herstellt.Wir haben Wolle und einige fertige Handspindeln dabei sowie ein paar Bausätze um euch eigene Holzspindeln zu bauen.Grundsätzlich können auch Kinder, erfahrungsgemäß etwa ab Vorschul-/Grundschulalter, Handspinnen lernen. Allerdings braucht es am Anfang einiges an Geduld und Motivation und wir werden zu zweit Kinder nicht sinnvoll betreuen können. Wenn ihr aber gemeinsam mit Kindern teilnehmen möchtet ist das natürlich kein Problem.Links zum Workshop: https://www.wollkanal.de/2019/12/29/links-fuer-spinnanfaenger/---++ We will meet at the lowest level in the CCL around the water basin (under the escalator) to have as much daylight as possible. ++We will show you and explain how to make your own yarn from wool and other fibres.We bring wool and a hand full of ready-made hand spindles as well as some kits to build your own wooden spindle.In general, children can definitely learn to spin yarn, usually from pre-school / primary school age on. However, at the beginning it needs a lot of patience and motivation and we will not be able to give them the necessary support ourselves. But if you want to participate together with your children it is totally possible.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Trinn",
      "public_name": "Trinn"
    }
  ],
  "links": []
}