{
  "id": 853,
  "guid": "25c7acdb-a59e-5121-a35a-573fea4ee019",
  "logo": "/media/36c3/images/9RPTW9/photo_2019-11-30-090949_49145438816_o.jpg",
  "date": "2019-12-29T16:35:00+01:00",
  "start": "16:35",
  "duration": "01:30",
  "room": "headnut",
  "slug": "9RPTW9",
  "url": "https://talks.komona.org/36c3/talk/9RPTW9/",
  "title": "selbstorganisiert, vernetzt & ungehorsam für die Revolution",
  "subtitle": "",
  "track": null,
  "type": "Workshop",
  "language": "de",
  "abstract": "In Zeiten von Kapitalismus und Klimakrise stehen wir vor besonderen strukturellen Problemen und gesellschaftliche Herausforderungen. Für die notwendigen Veränderungen scheinen unsere politischen und ökonomischen Systeme zu resistent und träge zu sein. Doch wie lassen sich die Schritte in für eine sozial-ökologische Transformation einleiten und umsetzen, und dabei zugleich positiven Errungenschaften, wie Prinzipien demokratischer Teilhabe und individueller Freiheit, wahren? Wann wird Ziviler Ungehorsam ein legitimes demokratisches Mittel und welche Besonderheiten ergeben sich für soziale Bewegungen in Zeiten der Digitalisierung? In diesem Workshop wollen wir mit euch diskutieren, welche Wirkungsmöglichkeiten soziale Bewegungen und verschiedene Protest- und Aktionsformen haben und wie wir uns möglichst selbstorganisiert, vernetzt und gemeinsam den großen Herausforderungen unsere Zeit stellen können.",
  "description": "",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 46,
      "code": "XN7WY3",
      "public_name": "Johnny Parks",
      "biography": "Als Aktivist aktiv bei dem Bündnis noPAG - nein zum bayrischen Polizeiaufgabengesetz und dem daraus entstandenen Jugenbündnis noPAG-Jugend. Desweiteren seit Oktober Pressesprecher für das Bündnis Ende Gelände.",
      "answers": []
    },
    {
      "id": 60,
      "code": "PMWCAR",
      "public_name": "Luca",
      "biography": "",
      "answers": []
    },
    {
      "id": 61,
      "code": "Q9ZREE",
      "public_name": "Marie Peters",
      "biography": "",
      "answers": []
    },
    {
      "id": 62,
      "code": "EUB98V",
      "public_name": "Mundo",
      "biography": null,
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}