{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10903.html",
  "id": 10903,
  "guid": "26251c91-724e-4a28-b0fd-f5116fb339fb",
  "logo": null,
  "date": "2019-12-30T13:30:00+01:00",
  "start": "13:30",
  "duration": "00:40",
  "room": "Dijkstra",
  "slug": "36c3-10903-jahresruckblick_der_haecksen",
  "title": "Jahresrückblick der Haecksen",
  "subtitle": "",
  "track": "CCC",
  "type": "lecture",
  "language": "de",
  "abstract": "In  diesem Vortrag nehmen wir euch mit auf eine Reise durch das Haecksenjahr 2019. ",
  "description": "Wir streifen kurz die deutsche Statistik über Femizide in Deutschland, bei der Deutschland sechst-schlechtestes Land im europäischen Vergleich ist. Femizide führen direkt zur Hexenverbrennung um ca. 1550. Viele Belege weisen darauf hin, dass die Verfahren zur Unterdrückung von Aufständen in der Bevölkerung gedacht und nicht einfach Effekte von Massenhysterien waren. Dann schwenken wir auf die positive Seite unseres Jahres um.\r\nWir geben euch eine Führung durch unsere Kunstgalerie (Briefmarken, Postkarten Memorials und mehr), zeigen Einblicke in ein Haecksen-Geekend und wie wir unsere 100 neuen von 292 Haecksen insgesamt integrieren und aktivieren.\r\nAußerdem verraten wir euch, in welchen Chaos-nahen Gruppen sich Haecksen-Gruppen befinden und was sie dort in 2019 gemacht haben. Zusätzlich dazu haben sich Haecksen dezentral zu den Themen Klimawandel und die Effekte von Bias in Trainigsdatensätzen zusammengeschlossen.\r\nWir schließen mit der Vorstellung von NIFTI http://nifti.org als der neue zentrale Knotenpunkt der Gemeinschaft aller FNIT-Gruppen mit Interesse an Technik.\r\nUnd wir werden dabei unser 30jähriges Jubiläum feiern.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 3602,
      "public_name": "melzai"
    }
  ],
  "links": [
    {
      "url": "https://haecksen.org",
      "title": "Haecksen"
    }
  ],
  "attachments": []
}