{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10875.html",
  "id": 10875,
  "guid": "272dedf6-32ce-4020-af81-395eab2e5009",
  "logo": null,
  "date": "2019-12-27T23:30:00+01:00",
  "start": "23:30",
  "duration": "01:00",
  "room": "Eliza",
  "slug": "36c3-10875-hack_curio",
  "title": "Hack_Curio",
  "subtitle": "Decoding The Cultures of Hacking One Video at a Time",
  "track": "Art & Culture",
  "type": "lecture",
  "language": "en",
  "abstract": "Hacking and hackers can be hard to visualize. In the popular imagination, the figure alternates between a menacing, hooded figure or some sort of drugged-out and depressed juvenile hero (or perhaps a state-sponsored hacker).  To counter such images, a group of us have spearheaded a new digitally-based video project, Hack_Curio that features hacker-related videos, culled from a range of sources, documentary film, newscasts, hacker conference talks, advertising, and popular film. In this talk, the Hack-Curio creators and builders will briefly discuss the purpose and parameters of Hack_Curio and spend most of the talk featuring our funniest, most compelling videos around hacking from around the world. We will use these to reflect on some of the more obscure or less commented on cultural and political features of hacking--features that will address regional and international dimensions of the craft and its impacts around the world. ",
  "description": "Hacking and hackers can be hard to visualize. In the popular imagination, the figure alternates between a menacing, hooded figure or some sort of drugged-out and depressed juvenile hero (or perhaps a state-sponsored hacker).  To counter such images, a group of us (Chris Kelty, Gabriella Coleman, and Paula Bialski) have spearheaded a new digitally-based video project, Hack_Curio that features hacker-related videos, culled from a range of sources, documentary film, newscasts, hacker conference talks, advertising, and popular film. In this talk, the Hack-Curio creators and builders, will briefly discuss the purpose and parameters of Hack_Curio and spend most of the talk featuring our funniest, most compelling videos around hacking from around the world. We will use these to reflect on some of the more obscure or less commented on cultural and political features of hacking--features that will address regional and international dimensions of the craft and its impacts around the world. \r\n\r\nWe will begin our talk by telling the audience what drove to build this website and what we learned in the process of collaborating with now over fifty people to bring it into being. After our introduction, we will showcase about 7-10 videos drawn from quite different sources (ads, parodies, movie clips, documentary film, and talks) and from different parts of the world (Mexico, Germany, South Africa, France) in order to discuss the cultural significance of hacking in relation to regional and international commonalities and differences. \r\n\r\nFinally, we will finish with a short reflection on why such a project, based on visual artifacts, is a necessary corollary to text-based discussions, like books and magazines, covering the history and contemporary faces of hacking. ",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 5610,
      "public_name": " Gabriella \"Biella\" Coleman"
    },
    {
      "id": 9892,
      "public_name": "Paula Bialski"
    }
  ],
  "links": [
    {
      "url": "Hack_Curio, Decoding the Cultures of Hacking",
      "title": "https://hackcur.io/"
    }
  ],
  "attachments": []
}