{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10936.html",
  "id": 10936,
  "guid": "27300e0d-e9a3-4e59-8261-c1b67cc0d86d",
  "logo": null,
  "date": "2019-12-27T23:30:00+01:00",
  "start": "23:30",
  "duration": "01:00",
  "room": "Borg",
  "slug": "36c3-10936-inside_the_fake_like_factories",
  "title": "Inside the Fake Like Factories",
  "subtitle": "How thousands of Facebook, You Tube and Instagram pages benefited from purchased likes and how we reverse engineered facebooks user IDs",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "en",
  "abstract": "This talk investigates the business of fake likes and fake accounts: In a world, where the number of followers, likes, shares and views are worth money, the temptation and the will to cheat is high. With some luck, programming knowledge and persistence we obtained thousands of fanpages, You Tube and Instagram account, where likes have been bought from a Likes seller. We were also able to meet people working behind the scenes and we will prove, that Facebook is a big bubble, with a very high percentage of dead or at least zombie accounts. The talk presents the methodology, findings and outcomes from a team of scientists and investigative journalists, who delved into the parallel universe of Fake Like Factories.",
  "description": "When you hear about fake likes and fake accounts, you instantly think of mobile phones strung together in multiple lines in front of an Asian woman or man. What if we tell you, that this is not necessarily the whole truth?  That you better imagine a ordinary guy sitting at home at his computer? In a longterm investigation we met and talked to various of these so called “clickworkers” - liking, watching, clicking Facebook, You Tube and Instagram for a small amount of money the whole day in their living room.\r\nFortuitously we could access thousand campaigns, Facebook Fanpages, You Tube videos or Instagram accounts. Thousands of websites and accounts, for which somebody bought likes in the past years.\r\nBut we did not stop the investigation there: We dived deeper into the Facebook Fake Accounts and Fake Likes universe, bought likes at various other Fake Likes sellers. To get the big picture, we also developed a statistical method to calculate the alleged total number of Facebok User IDs, with surprising results.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 7209,
      "public_name": "@sveckert"
    },
    {
      "id": 9611,
      "public_name": "Dennis Tatang"
    },
    {
      "id": 9372,
      "public_name": "pkreissel"
    }
  ],
  "links": [],
  "attachments": []
}