{
  "id": 4126,
  "guid": "2882718e-5455-5f54-a439-0e1c39717ca9",
  "logo": "/media/36c3/images/BUGBMJ/Synthetic_Image_Training_Datasets_for_Conflict_Zone_Analysis__web_DEyBULl.jpg",
  "date": "2019-12-29T12:00:00+01:00",
  "start": "12:00",
  "duration": "00:30",
  "room": "Art-and-Play Stage",
  "slug": "BUGBMJ",
  "url": "https://stage.artesmobiles.art/36c3/talk/BUGBMJ/",
  "title": "Synthetic Image Training Datasets for Conflict Zone Analysis",
  "subtitle": "",
  "track": "Lecture",
  "type": "Lecture",
  "language": "en",
  "abstract": "\\#artist talk and Q&A 30min",
  "description": "This talk will present VFRAME, an open source computer vision toolkit for human rights researchers, and the new synthetic data generation tools. Because creating image training datasets is expensive or in some cases impossible due to lack of imagery, photorealistic synthetic data can be used to simulate real imagery. VFRAME uses this technique to create highly specific object detection models that facilitate visual analysis of millions of videos from Syria, Yemen, and Sudan.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 20,
      "code": "Y3VW3W",
      "public_name": "Adam Harvey",
      "biography": "Adam Harvey is an American artist and researcher currently based in Berlin. He is a graduate of the Interactive Telecommunications Program at New York University and previously studied engineering and photojournalism at Pennsylvania State University. Harvey's previous work includes CV Dazzle (camouflage from face detection) and the Anti-Drone Burqa (camouflage from thermal cameras). His work has been exhibited at the Istanbul Design Biennale, German Spy Museum, V&A Museum and commissioned by the New York Times. Harvey recently founded VFRAME.io, a computer vision toolkit for human rights researchers, that received an award of distinction from Ars Electronica in 2019.\r\n\r\nhttps://vframe.io",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}