{
  "id": 4129,
  "guid": "2a16cc59-d5f0-5616-b237-373d870e8750",
  "logo": "/media/36c3/images/83A8HA/solarpunk_peer_to_peer_energy_trading__web_PXumsj7.jpg",
  "date": "2019-12-29T12:30:00+01:00",
  "start": "12:30",
  "duration": "00:45",
  "room": "Art-and-Play Stage",
  "slug": "83A8HA",
  "url": "https://stage.artesmobiles.art/36c3/talk/83A8HA/",
  "title": "solarpunk: peer to peer energy trading",
  "subtitle": "",
  "track": "Lecture",
  "type": "Lecture",
  "language": "en",
  "abstract": "talk and Q&A 45min",
  "description": "\"move quietly and plant things\" our motto as solarpunks. Between the retro-futurism of steampunk and dystopian cyberpunk we as solarpunks place positive designs of our future – in an ecological, social sense. We want to support and develop decentralized infrastructures – for more local, neighbourly exchange. In the talk, we present different approaches of a decentralized peer to peer power grid \"microgrid\", a bottom-up power grid facilitating direct neighbour to neighbour energy trading. Since our solarpunk collective is just about to start, we invite you to join our regular monthly meetings at c-base to discuss the implementation of such a microgrid within the city – and more.\r\n\r\nImage: enerGAZE Zine, geniox (CC BY-SA 4.0)",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 23,
      "code": "ZNQQT9",
      "public_name": "Stefan Greiner & Julian Jungel from Solarpunks Berlin",
      "biography": "Julian works as lecturer for creative technology in the department of Puppetry and the Master Play & Object at the Ernst Busch Academy of Dramatic Arts in Berlin, where they develop ways to tell stories and games of our current and our future society. Furthermore he helped build Tinkertank, a non-profit initiative aiming to reanimate creativity in kids, youths and adults with the help of agile technology. There he curates workshops on games, animatronics, robotics, VR, wearable – anything that can be built from or enhanced with electronic scrap.\r\n\r\nStefan has been dealing with various forms of man-machine fusion for over 10 years. He studied Human-Machine Interaction at the TU Berlin and is co-founder of the association Cyborgs e.V. in Berlin, a body hacking collective to experiment different ways of non-normative human-machine relationships. He is sick of steady dystopian, depressing future outlooks and interested in a positive imagining of our collective futures to actually creating it - that's why he joined the solarpunk community.\r\n\r\ntwitter: @solarpunks_bln",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}