{
  "id": 894,
  "guid": "2b51d496-fb52-5033-bd0a-59bf6feeb38b",
  "logo": "",
  "date": "2019-12-30T15:30:00+01:00",
  "start": "15:30",
  "duration": "01:00",
  "room": "headnut",
  "slug": "FAH3ZS",
  "url": "https://talks.komona.org/36c3/talk/FAH3ZS/",
  "title": "Applied Rationality Speedrun: Methods to improve your live",
  "subtitle": "",
  "track": null,
  "type": "Session",
  "language": "en",
  "abstract": "After the successful 'Behaviour Changing meetup' I offer to talk about some really sophisticated methods from a workshop I attended this year on how to change your behaviour effectively.",
  "description": "In March 2019 i attended the mainline workshop of the center for applied rationality. I'm happy to help you understand what their workshops offer and give you a speedrun through their methods on how to be more productive and change your behaviour effectively. Here a text from their website www.rationality.org\r\n\r\nCFAR exists to try to make headway in this domain—the domain of understanding how human cognition already works, in practice, such that we can then start the process of making useful changes, such that we will be better positioned to solve the problems that really matter. We are neither about pure research nor pure execution, but about applied rationality—the middle ground where the rubber hits the road, where one’s models meet reality, and where one’s ideas and plans either pay off (or they don’t). By looking in-depth at individual case studies, advances in cogsci research, and the data and insights from our thousand-plus workshop alumni, we’re slowly building a robust set of tools for truth-seeking, introspection, self-improvement, and navigating intellectual disagreement—and we’re turning that toolkit on itself with each iteration, to try to catch our own flawed assumptions and uncover our own blindspots and mistakes.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 87,
      "code": "JHHF9Z",
      "public_name": "Max Schons",
      "biography": "Physician working on data-driven infectious disease research. Member of the Netzwerk für Effektiven Altruismus Deutschland",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}