{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10576.html",
  "id": 10576,
  "guid": "2c870588-7b9e-4530-a352-f1e871252cec",
  "logo": "/system/events/logos/000/010/576/large/Mitel-DECT.jpg?1571665850",
  "date": "2019-12-29T17:30:00+01:00",
  "start": "17:30",
  "duration": "01:00",
  "room": "Dijkstra",
  "slug": "36c3-10576-mifail_oder_mit_gigaset_ware_das_nicht_passiert",
  "title": "#mifail oder: Mit Gigaset wäre das nicht passiert!",
  "subtitle": "DECT is korrekt.",
  "track": "Hardware & Making",
  "type": "lecture",
  "language": "de",
  "abstract": "Seit 2018 betreibt Eventphone ein neues Telefonsystem auf den chaosnahen Events. Natürlich wird neue Soft- und Hardware sofort zum Forschungsgegenstand. Schnell gab es die üblichen Fragen: Wie funktioniert das genau? Ist das alles an Features? Kann man das updaten? Kann man nicht kompatible Geräte vielleicht kompatibel machen? Was kann man noch verbessern? Ist das sicher?",
  "description": "Natürlich haben wir Antworten und möchten unser Wissen mit euch teilen. Es gibt einen Überblick über DECT, kaputte Crypto™ und was man mit Kreativität daraus machen kann. Unser Anspruch ist, dass wir es so erklären, dass alle Zuschauerinnen und Zuschauer ein bisschen mehr über DECT wissen und mindestens einmal gelacht haben.\r\n\r\nSeit dem Easterhegg 2018 betreibt Eventphone das PoC (Phone Operation Center) mit neuer Hard- und Software. Wer ist Eventphone bzw. das PoC und was machen die? Neben vielen selbst entwickelten Komponenten nutzen wir eine DECT-over-IP-Lösung des kanadischen Telekommunikationsunternehmens Mitel. Wir geben euch eine Architekturübersicht der neuen Anlage und sprechen über Antennen, Software sowie Lizenzierung. Nachdem wir die größten Probleme, die wir mit dem alten System hatten, vollständig gelöst haben, schauten wir etwas genauer unter die Haube. Bei den ersten Analysen entdeckten wir einen unkritischen, aber witzigen Fehler, den wir euch zeigen wollen. Unser primäres Ziel war es, die Kompatibilität zu erhöhen, denn es gab einige Geräte, die trotz DECT-Standard nicht mit der Anlage funktionierten oder sich sehr sonderlich verhielten. Warum eigentlich? Wir fingen an, die Kommunikation der Geräte zu analysieren, und fanden heraus: Wer ein Byte verliert, hat acht Bit zu wenig. Es folgt: eine DECT-Anmeldung als Theaterstück. Aber halt! Ist das nicht alles verschlüsselt? Woher wisst ihr das? Es folgt: die Geschichte der Mitel Crypto und was daraus entstand: rfpproxy. Es folgt: eine DECT-Anmeldung mit rfpproxy als Theaterstück. Dann sammelten wir Metadaten und löschten sie wieder, mit Unterstützung der Feuerwehr. Und dann? Dann haben wir viel gespielt, analysiert und entwickelt. Weil die Zeit knapp ist zeigen wir euch 3 kleine Beispiele. Musik während des Telefonats über Vanity Number, die Akte AVM und Telefonbuchfunktionen. Am Ende geben wir euch Informationen zum Weitermachen sowie einen Ausblick. Außerdem wollen wir euch motivieren uns zu helfen. Wir hätten gern einen Wireshark Dissector. Stay connected!",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9328,
      "public_name": "zivillian"
    },
    {
      "id": 4972,
      "public_name": "ST Kambor-Wiesenberg"
    },
    {
      "id": 1757,
      "public_name": "LaForge"
    }
  ],
  "links": [
    {
      "url": "https://eventphone.de/blog/2018/12/30/eventphone-fruher-heute-morgen-vortrag-auf-dem-35c3/",
      "title": "Eventphone: früher, heute, morgen – Vortrag auf dem 35C3"
    },
    {
      "url": "https://media.ccc.de/v/eh19-179-das-neue-eventphone-poc-telefonsystem",
      "title": "Das neue Eventphone (PoC) Telefonsystem (Easterhegg 2019)"
    },
    {
      "url": "https://eventphone.de/blog/2018/03/30/dect-anmeldung/",
      "title": "Die neue DECT-Anmeldung"
    },
    {
      "url": "https://eventphone.de/blog/2018/04/01/dect-deregistrierung-easterhegg-2018/",
      "title": "DECT-Deregistrierung (Easterhegg 2018)"
    }
  ],
  "attachments": [
    {
      "url": "/system/event_attachments/attachments/000/003/867/original/Mitel-DECT.jpg?1571665830",
      "title": "Mitel DECT"
    }
  ]
}