{
  "id": 1340,
  "guid": "2cd3f470-1537-4e85-88e4-07284c7f1227",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:JHT:_Spiel_und_Spa%C3%9F_mit_unendlichen_Zahlen_und_unendlichen_Spielen",
  "logo": null,
  "date": "2019-12-28T11:00:00+01:00",
  "start": "11:00",
  "duration": "3:30",
  "room": "Assembly:Pseudoroom",
  "slug": "36c3-1340-session_jht_spiel_und_spass_mit_unendlichen_zahlen_und_unendlichen_spielen",
  "title": "JHT: Spiel und Spaß mit unendlichen Zahlen und unendlichen Spielen",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "hands-on",
  "language": "de",
  "abstract": "",
  "description": "(für Kinder) Irgendwann lernt man, dass das Spiel „wer kann die größere Zahl sagen?“ langweilig wird. Oder stimmt das gar nicht?\nIn der Mathematik geht es nach 1, 2 und 3, nach der Million und der Fantastilliarde erst richtig los: Danach kommen die unendlich großen Zahlen. Los gehen die mit „∞“, der ersten unendlich großen Zahl, aber dann geht es noch lange weiter. Mit diesen Zahlen kann man wunderbar Spiele spielen. Vielleicht kennt der eine oder andere das Streichholzspiel, bei dem zwei Spieler abwechselnd immer bis zu drei Streichhölzer wegnehmen können und derjenige gewinnt, der das letzte Streichholz an sich nimmt. Im Workshop werden wir lernen, wie man dieses Spiel mit unendlich vielen Streichhölzern spielt, und wie der Trick aussieht, um immer zu gewinnen.Dieser Workshop richtet sich vor allem an Kinder (ab vierte Klasse). Von 11:00 Uhr bis 14:30 Uhr kann man jederzeit kommen und gehen, eine Anmeldung ist nicht erforderlich. Wer schon etwas älter ist (ab etwa achte Klasse) und Englisch ganz gut versteht, kann statt zu diesem Workshop auch zum 60-minütigen Vortrag zum Thema kommen.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Iblech",
      "public_name": "Iblech"
    }
  ],
  "links": []
}