{
  "id": 1122,
  "guid": "2e010d12-8dc1-4576-9387-e86997da732b",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Film_%22Deckname_Jenny%22",
  "logo": null,
  "date": "2019-12-28T21:30:00+01:00",
  "start": "21:30",
  "duration": "2:29",
  "room": "Lecture room M3",
  "slug": "36c3-1122-session_film_deckname_jenny_",
  "title": "Film \"Deckname Jenny\"",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "other",
  "language": "en",
  "abstract": "",
  "description": "Movie on activism and it's challenges in the modern German state\nDECKNAME JENNY // 2018 // 108 min // Orginalton: Deutsch // Untertitel:EnglischRechtsruck in Europa. Ertrunkene Menschen im Mittelmeer. Der Staat fahndet im Netz nach G20-Gegner*innen.Jennys Bande schaut nicht mehr zu. Und handelt. Zwischen analogen Aktionen und hacken muß entschieden werden. Doch als Jennys Vater deren militante Ambitionen herausfindet, muss er sich seiner eigenen Vergangenheit als Mitglied einer Stadtguerillagruppe stellen. Das finden auch alte Gegner nicht lustig. Und nun wird es für alle Beteiligten eng...Eine Geschichte zwischen Liebe und Verrat, Hoffnung und Resignation, Widerstand und Freundschaft.hochaktuell * generationsübergreifend * mit Augenzwinkern * subversiv * anarchistisch * aus einem queeren & feministischen Blickwinkel *Filmmusik: Guts Pie Earshot // Nomi & Aino*Deckname Jenny erzählt die fiktive Geschichte von jungen Aktivist*innen und ehemaligen Militanten. Mit Augenzwinkern. In Tempo, Zeitlupe und Aktion.**Aus Sympathie und Liebe zu den Menschen, die sich nicht mit Rassismus, Homophobie, Überwachung und einer Festung Europa abfinden wollen.**Es geht um Menschen mit Stärken und Schwächen – nicht um Geschlechterstereotype, Macker und Helden.**Ohne Denunziation des militanten Teils sozialer Bewegung. Denn Geschichte von unten erzählt sich anders.**Filmabend und anschließendes Filmgespräch & Diskussion mit Regie/Buch und Schauspieler*in",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Abcdd",
      "public_name": "Abcdd"
    }
  ],
  "links": [
    "https://jenny.in-berlin.de/"
  ]
}