{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10919.html",
  "id": 10919,
  "guid": "2fb147d5-27be-49a4-a85c-998940f3ae46",
  "logo": "/system/events/logos/000/010/919/large/nopnreu_logo.png?1576657717",
  "date": "2019-12-30T12:30:00+01:00",
  "start": "12:30",
  "duration": "00:40",
  "room": "Clarke",
  "slug": "36c3-10919-nopnr_let_s_kill_the_next_data_retention_law",
  "title": "#NoPNR – Let’s kill the next Data Retention Law",
  "subtitle": "How to Stop the Dubious Use of Passenger Name Records by Law Enforcement",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "en",
  "abstract": "The talk will address how passenger name records (PNR) of flight passengers are currently used by law enforcement throughout the European Union to track and identify suspects of a variety of crimes, how this is likely to be only a first step by the security state to surveil our every movement. Two NGOs have joined forces to stop this new form of indiscriminate mass surveillance in the courts and build safeguards against future infringements of our fundamental right to privacy. ",
  "description": "The PNR directive obliges all EU member states to process and save for five years all PNR data of passengers entering or exiting the European Union by plane. All member states have agreed to voluntarily extend this practice to all intra-EU flights as well. Subsequently, the data of hundreds of millions flight passengers are being checked against databases, generating vast amounts of false positives and futile infringements on passengers’ right to privacy. The data are also processed against “pre-determined criteria” which allows law enforcement to define “suspicious flight patterns”. The goal of this profiling of our travel movements is to find suspects among flight passengers that the authorities have never even heard of before. The system has no effective safeguards to prevent vast numbers of people from being falsely labeled as potential terrorists. \r\n\r\nMember states are already planning to extend this practice to international buses, trains and ferries – even though the effectiveness of processing flight passengers’ PNR data has yet to be proven. By this logic, the next step would be to track rental cars, then all cars, then mobile phones, and finally getting rid of the criterion “international”, enabling the state to surveil our every movement and to identify those of us who seemingly move around in suspicious patterns. \r\n\r\nBut there is hope. The Court of Justice of the European Union (CJEU) has proven before to be critical of indiscriminate mass surveillance affecting people that are not even on the authorities’ radar yet. Therefore, the Gesellschaft für Freiheitsrechte, a German NGO focused on strategic litigation, and epicenter.works, an Austrian NGO focused on protecting human rights in the digital age, have started legal proceedings against the PNR directive, aiming to have German and/or Austrian courts ask the CJEU whether the PNR directive and national transposition laws violate the Charta of Fundamental Rights. \r\n\r\nThis talk will explain how law enforcement currently processes PNR data, how this violates fundamental rights, how these surveillance systems may soon extended to other means of transportation, and what strategy civil society is pursuing to stop this from happening.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9793,
      "public_name": "Walter Hötzendorfer"
    },
    {
      "id": 9811,
      "public_name": "Bijan Moini"
    }
  ],
  "links": [
    {
      "url": "https://nopnr.eu/en/home/",
      "title": "Website"
    }
  ],
  "attachments": []
}