{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10666.html",
  "id": 10666,
  "guid": "325622ae-8785-47f3-81f5-fe62db3209e7",
  "logo": null,
  "date": "2019-12-30T15:10:00+01:00",
  "start": "15:10",
  "duration": "00:40",
  "room": "Borg",
  "slug": "36c3-10666-nach_der_braunkohle_li-io_batterierecycling",
  "title": "Nach der Braunkohle: Li-Io Batterierecycling",
  "subtitle": "Eine industrielle Perspektive für die Lausitz?",
  "track": "Science",
  "type": "lecture",
  "language": "de",
  "abstract": "Weltweit verlaufen die Entwicklungstrends des Markthochlaufs der Elektromobilität und die Weiterentwicklung relevanter Batteriefertigungs- und Recyclingtechnologien hoch dynamisch. Maßgebliche Faktoren für die Entstehung eines industriellen Batterierecycling-Marktes nehmen dabei erst langsam Gestalt an, der regulatorische Rahmen ist noch modellierbar. Zugleich ist der Technologiepfad Elektromobilität als eingeschlagen zu begreifen: Die Vorgaben des Klimaschutzplans der Bundes-regierung zur CO2-Reduktion begründen Umbrüche in der Automobilbranche, die mittelfristig zu steigenden Verkehrs-anteilen von Fahrzeugen mit rein elektrischem oder hybridem Antrieb an den PKW-Neuzulassungen führen werden. \r\n\r\nDamit steigt der Bedarf an geeigneten Traktionsbatterien und die Nachfrage nach den zu ihrer Herstellung erforderlichen, endlichen Rohstoffen. Daraus erwächst mit einem der Batterielebensdauer entsprechenden zeitlichen Versatz bis 2030 ein relevantes Altbatterie-Aufkommen. Da die Batterien zudem zahlreiche Gift- und Gefahrstoffe enthalten, kommt dem Aufbau einer industriellen Recyclingstrecke für Traktionsbatterien nicht nur ökonomisch, sondern auch ökologisch eine strategische Schlüsselrolle zu. Die dafür zukünftig industriell notwendigen Recyclingkapazitäten sind derzeit weder vorhanden noch im Aufbau befindlich. \r\n\r\nMit der Zielstellung, die Lausitz als Energieregion zu erhalten und die Gleichwertigkeit der Lebensverhältnisse auch für strukturschwache Regionen herzustellen, gehen wir der Frage nach, ob durch die Errichtung einer Recyclingstrecke für Traktionsbatterien der Elektro-Mobilität ein Beitrag zur Gestaltung des Strukturwandels geleistet werden kann, der in der Region mit dem Ausstieg aus der Braunkohle in eine neue Runde geht.\r\n\r\nDies einerseits im Hinblick auf die Schaffung von Beschäftigung, um die im Kontext des Braunkohleausstiegs drohenden Verluste von Industriearbeitsplätzen zu kompensieren. Andererseits unter Maßgabe der Transformation in eine nachhaltige „Energieregion der Zukunft“. Um Entwicklungschancen im Zuge des Aufschwungs der Elektro-Mobilität aufzuzeigen, werden die endogenen Potentiale der Lausitz analysiert, der technologsche Entwicklungsstand des Batterierecycling aufgezeigt und weitere Umsetzungsvoraussetzungen geprüft.\r\n\r\nSchließlich werden Gestaltungsfelder aufgefächert, worin Handlungsempfehlungen für ein integriertes Entwicklungskonzept formuliert sind, die u.a. auf die Etablierung einer Kreislaufwirtschaft und Bottom-up Partizipation der Bevölkerung abstellen. Sie vermitteln Ideen, wie sich die Ansiedlung der Zukunftstechnologie industrielles Batterierecycling in der Lausitz unterstützen ließe und bieten Hilfestellung für die Gestaltung des Strukturwandels unter der Prämisse einer „Just Transition“ - damit ökologische nicht gegen ökonomische Interessen ausgespielt und  die Menschen nicht zu den Verlierern des Strukturwandels werden. ",
  "description": "Die Maßnahmenpläne der Bundesregierung für die Energie- und Mobilitätswende zur Erreichung der UN-Klimaziele führen gegenwärtig zu einer  Zuspitzung der Debatten über den Gestaltungsrahmen, der politischen Entscheidungsträger*innen in unserer repräsentativen Demokratie zugebilligt werden sollte. Das Spektrum reicht dabei von der hauptsächlich von jungen Menschen getragenen internationalen Protestbewegung „Fridays for Future“, die sich für die umgehende Herstellung von CO2-Neutralität ausspricht, über die Ablehnung einer staatlichen Umweltpolitik mit wirtschaftlicher Lenkungswirkung bis hin zur Leugnung des Klimawandels. Differenzen bestehen zwischen den Interessengruppen auch im Hinblick auf die Wahrnehmung der (eigenen) wirtschaftlichen Lage, der Wirtschaftsweise und bezüglich des Demokratieverständnisses. Neben den  Grünen (in den Ballungsräumen) hat die AfD zuletzt kräftige Zuwächse verbuchen und sich in vielen ländlichen Räumen als starke (und mitunter stärkste) politische Kraft etablieren können.\r\n\r\nDeutlich wird, dass der gesellschaftliche Kitt eines geteilten Wertekanons in Deutschland zu bröckeln scheint und die ins Haus stehenden Umbrüche zahlreiche Zukunftsängste in der Bevölkerung geschürt haben, die sich zuletzt in den Wahlkabinen Bahn brachen und die politische Entwicklung unzweifelhaft beeinflussen. Wir betrachten es deshalb als von besonders hoher Relevanz, uns exemplarisch mit einer „innerdeutschen“ Fragestellung zu beschäftigen. Die Analyse der sozialen und wirtschaftlichen Entwicklung vor allem Ostdeutschlands ist nicht allein deshalb wichtig, weil die Herstellung bundesweit einheitlicher Lebensbedingungen bis heute nicht gelingen konnte - auch mit Blick auf wirtschaftliche Vergleichsdaten, soziale Errungenschaften, kulturelle Vielfalt und Teilhabe besteht hier Nachholbedarf. \r\nIn der Lausitz, einer Region mit einem überdurchschnittlich hohen Anteil einer hoch qualifizierten Facharbeiterschaft, liegen die Löhne nach wie vor weit hinter dem Bundesschnitt zurück. Zwar ist die Arbeitslosigkeit auch in der Lausitz gegenwärtig gering und die mit der massiven De-Industrialisierung nach der Wende einsetzende Abwanderungsdynamik hat sich deutlich abgeschwächt, aber das Geburtendefizit dauert an und die Überalterung der Gesellschaft nimmt weiter zu. Bis 2030 wird von einer weiteren Bevölkerungsabnahme um bis zu zehn Prozent ausgegangen wird. Zugleich wurde der Bildungssektor in den vergangenen Jahren vergleichsweise stark geschröpft - eine Entwicklung, die dem Diktum lebenslangen Lernens widerspricht. Gleichzeitig steht in der Lausitz mit der Braunkohle ein Identitätsfaktor und großer, auch indirekt beschäftigungsbedeutsamer Industriezweig zur Disposition. Diesen Entwicklungen muss jetzt mit der Schaffung nachhaltiger Perspektiven etwas entgegengesetzt werden. \r\nDie vorliegende Studie geht der Frage nach, ob die Region den Markthochlauf der Elektromobilität mit der Errichtung eines Recyclingwerkes für Traktionsbatterien als Baustein zur Gestaltung einer „Energieregion der Zukunft“ nutzen kann: Durch die Aufbereitung von Hintergründen und die Entwicklung von Zukunftsperspektiven wird relevantes Handlungswissen für die Etablierung eines Batterierecyclingwerkes in der Lausitz erschlossen, um dem dort seit drei Jahrzehnten andauernden Strukturwandel weiter aktiv zu begegnen, der mit dem vorgesehenen Braunkohleausstieg in eine neue Runde geht.\r\nAusgehend davon, dass es die Menschen vor Ort sind, die beteiligt werden müssen, um verloren gegangene Glaubwürdigkeit wieder herzustellen, verweist das Autorenteam darauf, dass neben  der Beschäftigungssicherung die Herstellung gleichwertiger Lebensverhältnisse, basierend auf einer funktionierenden Daseinsvorsorge, von ebenso großer Relevanz ist wie eine zukünftig Ressourcen schonende Wirtschaftsweise, um weitere ökologische Schäden zu vermeiden. Herausgestellt wird, dass die Lausitz über zahlreiche endogene Potentiale verfügt, die als Standortvorteile begriffen und stärker genutzt werden könnten. Neben der gut ausgebildeten Facharbeiterschaft, vor allem im Bereich der metallbe- und –verarbeitenden Vorleistungsgüter- und Zulieferindustrie, sind dies eine hoch leistungsfähige (Energie-)Netzinfrastruktur und eine bereits rund um die regenerative Energieerzeugung und –speicherung entstandene innovative Unternehmenslandschaft.  \r\nMit der diesjährigen Verleihung des Nobelpreises für Chemie an die drei Entwickler von Lithium-Ionen-Batterien Goodenough, Whittingham und Yoshino unterstreicht die schwedische Akademie die bahnbrechende Bedeutung dieser Technologie, die den Grundstein gelegt habe für drahtlose Kommunikation und für eine von fossilen Brennstoffen freie Zukunft. Seit ihrer Markteinführung 1991 kommen diese leichten, hunderte Male wieder aufladbaren Batterien in Gebrauchsgegenständen von Mobiltelefonen über Laptops bis hin zu  elektrisch betriebenen Fahrzeugen zum Einsatz. \r\nDie Studie verdeutlicht neben dem aktuellen technologischen Entwicklungsstand das Innovationspotential der Li-Io-Batterien für regionale Märkte, was mit dem erwarteten großindustriellen Einsatz der Technologie im Zuge des Aufschwungs der Elektromobilität einhergeht. Darüber hinausgehend nimmt sich das Autorenteam auch der offenen Flanken dieser Batterierevolution an, indem sie ihre Chancen und Risiken diskutiert. Demnach stellt sich das Recycling von Lithium-Ionen-Batterien zukünftig als dringliche Notwendigkeit dar, denn  \r\n    • die zu ihrer Herstellung erforderlichen Rohstoffe sind endlich, \r\n    • sie werden zum Teil unter Menschen unwürdigen Arbeitsbedingungen und mit erheblichen ökologischen Folgeschäden in z.T. politisch instabilen Ländern abgebaut, \r\n    • die globalen Rohstoffmärkte sind (aufgrund dessen und aufgrund der Marktdominanz einzelner Staaten) sehr volatil, \r\n    • es ist ein Beitrag dazu, die automobile Wertschöpfungskette vollständig innereuropäisch und in Deutschland abzubilden und\r\n    • eine sichere und verantwortungsvolle Entsorgung bzw. Wiederverwertung der Batterien, die hochgiftige Substanzen enthalten, zu gewährleisten.\r\nDie Recycling von Li-Io-Batterien kann, so das Autorenteam, eingebettet in eine integrierte Strategie nachhaltigen Wirtschaftens das Prinzip der Kreislaufwirtschaft stärken. Dazu werden exemplarisch die notwendigen Voraussetzungen in der vom Braunkohleausstieg betroffenen Lausitz analysiert, um exemplarisch aufzuzeigen, wie sich Zukunftstechnologien so verankern lassen, dass \r\n    • ökologische nicht gegen soziale Interessen ausgespielt werden,\r\n    • der Wegfall hochwertiger Industriearbeitsplätze unter den Bedingungen Guter Arbeit kompensiert werden könnte,\r\n    • eine Energieregion der Zukunft mit Modellcharakter entsteht, in der auch kommende Generationen ein Auskommen in lebenswerter Umwelt finden und\r\n    • durch Partizipation der Bevölkerung die im Zuge der Nachwende-Transformationserfahrungen verloren gegangene Glaubwürdigkeit (wieder-)hergestellt werden kann. \r\nDer Technologiepfad der Elektromobilität gilt als eingeschlagen, der Erfolg ihres Markthochlaufs bleibt ebenso wie die Durchsetzungsfähigkeit der Politik zur Erreichung Klimaschutzziele und eine nachhaltige Verwendung der angekündigten Strukturhilfen abzuwarten. Zeitlich korrelierend mit dem für spätestens 2038 vorgesehenen Ausstieg aus der fossilen Energiewirtschaft spannen das Wachstum der Elektromobilität und das daraus anfallende Recyclingvolumen an Traktionsbatterien den in der Studie betrachteten Planungshorizont von rund 20 Jahren auf. Die Nachwendeerfahrung zeigt, dass ein Zeitfenster von 20 oder 30 Jahren nicht besonders groß ist, weshalb umgehend damit begonnen werden sollte, die Lausitz durch die Verankerung ressourcenschonender Wertschöpfungssysteme, durch Investitionen in Zukunftstechnologien und die Stärkung von Aus- und Weiterbildungsmöglichkeiten als „Industrie- und Energieregion der Zukunft“ zu entwickeln. ",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9473,
      "public_name": "Katrin Nicke"
    }
  ],
  "links": [
    {
      "url": "https://www.otto-brenner-stiftung.de/stiftung-neue-laender-snl/projektergebnisse-der-snl/petitel/studie-batterie-recycling-als-beschaeftigungs-perspektive-fuer-die-lausitz/peaktion/show/pecon/Projectresults/",
      "title": "2018/12 | Studie \"Batterie-Recycling als Beschäftigungsperspektive für die Lausitz\""
    }
  ],
  "attachments": []
}