{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10666.html",
  "id": 10666,
  "guid": "325622ae-8785-47f3-81f5-fe62db3209e7",
  "logo": "/system/events/logos/000/010/666/large/BatRecLau-Cover-white.jpg?1577030760",
  "date": "2019-12-30T15:10:00+01:00",
  "start": "15:10",
  "duration": "00:40",
  "room": "Borg",
  "slug": "36c3-10666-wandel_im_braunkohlerevier_lithium-ionen-batterierecycling",
  "title": "Wandel im Braunkohlerevier: Lithium-Ionen-Batterierecycling",
  "subtitle": "Eine industrielle Perspektive für die Lausitz?",
  "track": "Science",
  "type": "lecture",
  "language": "de",
  "abstract": "Weltweit verlaufen die Entwicklungstrends des Markthochlaufs der Elektromobilität und die Weiterentwicklung relevanter Batteriefertigungs- und Recyclingtechnologien hoch dynamisch. Maßgebliche Faktoren für die Entstehung eines industriellen Batterierecycling-Marktes nehmen dabei erst langsam Gestalt an, der regulatorische Rahmen ist noch modellierbar. Zugleich ist der Technologiepfad Elektromobilität als eingeschlagen zu begreifen - die Notwendigkeit einer Verkehrswende zur Reduzierung des CO2-Ausstoßes begründet Umbrüche in der Automobilbranche, die mittelfristig zu steigenden Verkehrsanteilen von Fahrzeugen mit rein elektrischem oder hybridem Antrieb an den PKW-Neuzulassungen führen werden. Damit steigt der Bedarf an geeigneten Traktionsbatterien und die Nachfrage nach den zu ihrer Herstellung erforderlichen, endlichen Rohstoffen.\r\n\r\nIm Energiesektor stellt der Beschluss zum Kohleausstieg 2038 eine Zäsur dar:  Mit der Zielstellung, die Lausitz – bislang Braunkohlerevier -  als Energieregion zu erhalten und die Angleichung der Lebensverhältnisse in der strukturschwachen Region zu schaffen, gehen wir der Frage nach, ob durch die Errichtung einer Recyclingstrecke für Traktionsbatterien der Elektro-Mobilität ein Beitrag zur Gestaltung einer „Energieregion der Zukunft“ geleistet werden kann. Dies einerseits im Hinblick auf die Schaffung von Beschäftigung, um die im Kontext des Braunkohleausstiegs drohenden Verluste von Industriearbeitsplätzen zu kompensieren. Andererseits unter Maßgabe der Etablierung einer nachhaltigen, regional verankerten Kreislaufwirtschaft.\r\n",
  "description": "Um nachhaltige Entwicklungschancen für die Lausitz im Zuge des Aufschwungs der Elektro-Mobilität abzuleiten, werden \r\n•\tdie endogenen Potentiale der Region analysiert, \r\n•\tdas zukünftige Altbatterie-Aufkommen und der technologische Entwicklungsstand des Li-Io-Batterierecycling aufgezeigt sowie\r\n•\tdie regulatorischen Rahmenbedingungen auf den Prüfstand gestellt.\r\nWir zeigen die offenen Flanken der Lithium-Ionen-„Batterierevolution“ auf, indem wir auch ihre Risiken diskutieren: Das Recycling der Lithium-Ionen-Batterien stellt sich demnach zukünftig als dringliche Notwendigkeit dar, denn  \r\n\r\n•\tdie zu ihrer Herstellung erforderlichen Rohstoffe sind endlich, \r\n•\tsie werden zum Teil unter Menschen unwürdigen Arbeitsbedingungen und mit erheblichen ökologischen Folgeschäden abgebaut,    \r\n•\tes ist eine sichere und verantwortungsvolle Entsorgung bzw. Wiederverwertung der Batterien, die hochgiftige Substanzen enthalten, zu gewährleisten.\r\n\r\nSchließlich werden Handlungsempfehlungen für ein integriertes Entwicklungskonzept formuliert, die auf die Etablierung einer Kreislaufwirtschaft und Bottom-up Partizipation der Bevölkerung abstellen. Sie vermitteln Ideen, wie sich die Ansiedlung einer Zukunftstechnologie – wie des industriellen Batterierecycling - in „Regionen mit hohen Zukunftsrisiken“ unterstützen lässt und wie sich Strukturwandel so gestalten lässt, dass ökologische und soziale nicht gegen ökonomische Interessen ausgespielt werden.\r\n",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9473,
      "public_name": "Katrin Nicke"
    }
  ],
  "links": [
    {
      "url": "https://www.otto-brenner-stiftung.de/stiftung-neue-laender-snl/projektergebnisse-der-snl/petitel/studie-batterie-recycling-als-beschaeftigungs-perspektive-fuer-die-lausitz/peaktion/show/pecon/Projectresults/",
      "title": "2018/12 | Studie \"Batterie-Recycling als Beschäftigungsperspektive für die Lausitz\""
    }
  ],
  "attachments": []
}