{
  "id": 206,
  "guid": "353a6553-2fcf-56d4-81e3-93c0b7bcff4a",
  "logo": "",
  "date": "2019-12-28T22:00:00+01:00",
  "start": "22:00",
  "duration": "00:50",
  "room": "Chaos-West Bühne",
  "slug": "PDFWDW",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/PDFWDW/",
  "title": "Welches Betriebssystem hat der Bundestag und wie kann man es hacken?",
  "subtitle": "",
  "track": "All about computers",
  "type": "Doppelter Slot",
  "language": "de",
  "abstract": null,
  "description": "Wäre der Staat ein Betriebssystem, würden wir uns natürlich wünschen, dass er nach den Prinzipien freier Software verwaltet wird. Die Prozesse sollten möglichst transparent ablaufen, sodass jeder nachprüfen kann, wenn irgendwo was schief läuft. Natürlich sollte die Gestaltung der Prozesse nicht in einer Blackbox passieren und der Code sollte zum Verändern und Mitmachen einladen. Ich bin der Meinung, dass Politik transparent und nachvollziehbar sein sollte. Es sollte Beteiligungsmöglichkeiten geben, die für alle offen stehen. Leider laufen die Prozesse im Bundestag nicht mal transparent, geschweige denn besonders partizipativ ab. Das Interface ist so unübersichtlich, dass selbst die Leute mit Adminrechten (Regierung) zum Teil Schwierigkeiten haben, den Überblick zu behalten. Als Bundestagsabgeordnete wurde mir zwar ein dickes Manual ausgehändigt, zum Durcharbeiten war aber keine Zeit. Die Lernkurve, bis man das System halbwegs effizient nutzen kann, ist sehr lang. Die Abläufe sind analoger, als man ohnehin vermutet, mit absurden, historisch gewachsenen Abläufen und unvorstellbaren Papierbergen. Es gibt wenig Transparenz und Mitmachmöglichkeiten sind rar.\r\nIn dieser Session gebe ich Insider Einblicke in den Alltag als netzpolitische Sprecherin der Linksfraktion im Bundestag mit netzaktivistischem Hintergrund, zeige die Handlungsmöglichkeiten einer Oppositionspolitikerin und wie ich versuche, meine eigenen Handlungsspielräume für mehr Transparenz und Beteiligungsmöglichkeiten auszureizen, aber auch wie ihr als Netzcommunity mich als Eure Volksvertreterin nutzen könnt, um z.B. auf offiziellen Kanälen Informationen abzufragen, an die man sonst nicht kommt, denn Wissen ist Macht. \r\nAls Netzaktivistin im Bundestag möchte ich dort ganz besonders Sprachrohr der Netzcommunity sein. In meiner Rolle als Abgeordnete einer Oppositionspartei kann ich Themen setzen und Informationen beschaffen, ich kann fiese Fragen stellen – in langen und kurzen Formaten und die Bundesregierung muss darauf antworten. In 22 Monaten hielt ich 20 Reden, stellte 43 schriftliche Fragen, 33 Kleine Anfragen, 5 Anträge und reichte einen eigenen Gesetzentwurf ein. Es ging um Überwachung am Südkreuz, Open Source, das NetzDG, Hackbacks, IPv6, Künstliche Intelligenz, DNA Analysen in der Stammbaumforschung, Uploadfilter, IT Sicherheit, Impressumpflichten, barrierefreie Notrufe, Whistleblower, Mobilfunk, Open Data, KfZ Scanning, Funkzellenabfragen und stille SMS, digitale Gewalt gegen Frauen, Bundeswehr bei re:publica, Verschlüsselung, Lobbyregister, social Innovation, Open Justice und vieles mehr.\r\nIn dieser Session werde ich konkrete Beispiele dazu vorstellen, über meine Pläne reden und Euch fragen, was Ihr schon immer von der Bundesregierung in Netzfragen wissen wolltet, damit ich die GroKo weiter nerven kann und wir alle besser wissen, was sie tun. Lasst uns gemeinsam das intransparente und wenig partizipative System Bundestag hacken, denn Demokratie lebt vom Mitmachen!",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 152,
      "code": "SB87WQ",
      "public_name": "Anke Domscheit-Berg",
      "biography": "1968 geboren, in der DDR aufgewachsen.\r\nStudienabschlüsse: Textilkunst (DDR), BA International Business Administration, MA European Business Administration\r\n9 Jahre Accenture\r\n2 Jahre McKinsey Business Technology Office\r\n3 Jahre Microsoft Deutschland \r\nSeit 2011 Publizistin (Buchautorin, Kolumnistin, Texte u Vorträge)\r\nSeit 2017 Mitglied des Deutschen Bundestages, parteilos in der Fraktion DIE LINKE\r\nSchwerpunktthemen: Verbindung von Digitaler Revolution mit Sozialer Revolution sowie gemeinwohlorientierte Gestaltung der digitalen Gesellschaft; Digitale Bildung (eigenes Projekt: Verstehbahnhof in Fürstenberg/Havel), Open Government, Geschlechtergerechtigkeit\r\nIch lebe im Norden von Brandenburg und bin verheiratet mit Daniel Domscheit-Berg, 1 Sohn, 6 Katzen.\r\n\r\nIch bin netzpolitische Sprecherin der Linksfraktion, Mitglied bzw. stellvertretendes Mitglied im Digitalausschuss, im Beirat der Bundesnetzagentur (Megathema 5G Lizenzversteigerung), der Enquete Kommission Künstliche Intelligenz, in den Ausschüssen für Bildung/Forschung/Technikfolgen sowie für Verkehr und digitale Infrastruktur.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}