{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/11035.html",
  "id": 11035,
  "guid": "3615eddc-bf2c-4c32-9f98-ba4738c82c90",
  "logo": "/system/events/logos/000/011/035/large/Faire_Digitalisierung_gestalten.png?1576506648",
  "date": "2019-12-30T11:30:00+01:00",
  "start": "11:30",
  "duration": "00:40",
  "room": "Eliza",
  "slug": "36c3-11035-gerechtigkeit_4_0",
  "title": "Gerechtigkeit 4.0",
  "subtitle": "Makroökonomische Auswirkungen der Digitalisierung auf den Globalen Süden",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "de",
  "abstract": "In den gegenwärtigen Debatten um die Digitalisierung werden systemische und strukturelle Auswirkungen der Digitalisierung auf Entwicklungs- und Schwellenländer und damit verbundene potentielle Risiken und Herausforderungen bislang kaum betrachtet und diskutiert. Ein schwerwiegendes Versäumnis, hatte doch bereits die Weltbank, einer der größten Förderer von IKT in den Ländern des Globalen Südens, in ihrem Weltentwicklungsbericht ‚Digital Dividende‘ (2016) selbstkritische eingeräumt, der digitale Wandel bleibe nicht nur hintern, sondern verschärfe die soziale Ungleichheit. \r\nDer Vortrag setzt sich mit der Frage auseinander, inwiefern die Digitalisierung zur Überwindung von Armut und sozialer Ungleichheit in den Ländern des Südens beitragen können. Erweitern sie die Chancen auf gesellschaftliche und ökonomische Teilhabe von benachteiligten Menschen oder verengen sie diese? \r\nSchwerpunkt der Analyse bildet die Auseinandersetzung mit dem digitalen Handel. Fast unbemerkt hat sich in der Handelspolitik eine neue Dynamik entwickelt. Führende Tech-Konzerne, allen voran die aus dem Silicon Valley, instrumentalisieren zunehmend das Handelsrecht für ihre Interessen. Dabei geht es längst nicht mehr nur um die Reduzierung von Zöllen auf digitale Produkte wie Software oder einheitliche Standards für Telekommunikationsdienste. Patente auf Künstliche Intelligenz sowie die (Nicht)Regulierung von Datenflüssen sind inzwischen auch Bestandteil handelsrechtlicher Regelungen und Gegenstand kontroverser Debatten in der Welthandelsorganisation WTO. Für die Länder des Globalen Südens – aber nicht nur für sie – steht dabei viel auf dem Spiel, einschließlich der Gefahr eines neuen, digitalen Kolonialismus. \r\nIm Vortrag zeigt zudem erste Ansätze zum Aufbau einer fairen und menschenwürdigen Digitalisierung auf. \r\n",
  "description": "Vom E-Commerce zum digitalen Handel\r\nVor 25 Jahren kaufte ein Internetnutzer aus Philadelphia, mit seiner Kreditkarte am Computer eine Audio-CD des Musikers Sting. Der elektronische Handel war geboren. Ein Jahr später ging Amazon mit seinem ersten Buch an den Start. Während in der Frühphase des E-Commerce vor allem materielle Güterverkauft wurde, kamen in der Folgezeit, aufgrund technischer Fortschritte, neue Produkte und Vermittlungswege hinzu. Eine Welt ohne digitale Dienstleistungen (wie der Fahrkartenkontrolle per App) und digital übermittelt Produkte (wie z. B. Video-Streaming) ist heutzutage nicht mehr vorstellbar. Mit der Verlagerung der gehandelten Güter von materiellen Produkten zu immateriellen wandelte sich auch die Begrifflichkeit. So verdrängte der Terminus des „digitalen Handels“ zunehmend den des „elektronischen Handels“. \r\n\r\nAsymmetrische Einbindung des globalen Südens \r\nMit dem digitalen Handel und der Digitalwirtschaft werden häufig große Hoffnungen für den Globalen Süden verknüpft. Die Schaffung neuer, digitaler Märkte sei mit hohen Wachstumsraten verbunden, einhergehend mit einer Steigerung des Wohlstandes, behaupten nicht nur Tech-Konzerne, sondern auch Akteure aus der Entwicklungszusammenarbeit.\r\n\r\nEin Bericht der Vereinten Nationen kommt jedoch zu einem anderen Ergebnis. Demnach verteilt sich der Handel mit digitalen, immateriellen Gütern noch ungleicher, als beim traditionellen, analogen Handel. Auch beim Handel mit IT-Produkten, wie Laptops oder GPS-Geräten, geraten die Entwicklungsländer ins Hintertreffen. Die ökonomischen Folgen für die Länder des Südens sind schwerwiegend: Viele Entwicklungsländer leiden unter (1) Handelsbilanzdefiziten, (2) geringeren Staatseinnahmen und (3) erschwerten Bedingungen zum Aufbau einer eigenen, lokalen Digitalwirtschaft. \r\n\r\nDaten – Der Zankapfel in neuen Handelsabkommen\r\nEin Anfang 2019 in Kraft getretenes Mega-regionales Handelsabkommen, dem elf Staaten angehören, darunter wichtige OECD-Länder (Japan, Kanada, Neuseeland, Australien, Chile, Mexiko), geht weit über bisherige Verträge zum digitalen Handel hinaus. Gleiches gilt für das von Trump vor drei Monaten abgeschlossene Handelsabkommen mit Japan. Beide verfolgen die Nicht-Regulierungsagenda des Silicon Valley, die seit 2000 zur offiziellen Handelspolitik der USA erklärt wurde. Demnach sollen in Handelsabkommen der USA folgenden Verbote hineinverhandelt werden:\r\n•\tVerbot von Zöllen\r\n•\tVerbot einer Digitalsteuer\r\n•\tVerbot lokaler Datenspeicherung\r\n•\tVerbot Quellcodes zu öffnen\r\n\r\nDigitalisierung von Wertschöpfungsketten\r\nNeben den hohen Wachstumsraten beim digitalen Handel, setzen viele Akteure aus der Entwicklungszusammenarbeit auch große Hoffnungen auf die Digitalisierung globaler Lieferketten. Sie versprechen sich davon gleich mehrere positive Impulse: Eine verbesserte Effizienz, mehr Produktivität und Transparenz sowie dem, aus entwicklungspolitischer Perspektive entscheidenden Faktor: Eine erhöhte Wertschöpfung für jene Menschen, die am Anfang der Lieferkette stehen, wie beispielsweise Kleinbauern in Kamerun\r\n\r\nErste Untersuchungen, u. a. am Beispiel ostafrikanischer Teeproduzenten, bestätigen diese Hoffnungen, allerdings nur zum Teil. Durch die Anbindung an das Internet hat sich die Kommunikation der Teepflücker mit anderen Akteuren aus der Lieferkette verbessert; auch können sie ihre Arbeit effizienter und transparenter gestalten. Trotz dieser Fortschritte hat sich jedoch die Einkommenssituation der Teepflücker*innen nicht verbessert, da die Anzahl potentieller Lieferant*innen mit gleichwertiger Qualitätsteigt an, wodurch diese verstärkt miteinander in Konkurrenz treten. \r\n\r\nFaire Gestaltung der Digitalisierung\r\n„There is no time to lose in taming the power of the digital. We can either surrender our digital future, or we can take ownership of it.” (‘Digital Justice Manifesto’, Just Net Coalition, November 2019).\r\nZum Schluss stell ich die einige Eckpfeiler für die Gestaltung einer Digitalisierung zugunsten der Menschen im Globalen Süden vor. ",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9698,
      "public_name": "Sven Hilbig"
    }
  ],
  "links": [
    {
      "url": "https://info.brot-fuer-die-welt.de/sites/default/files/blog-downloads/gerechtigkeit_4.0.pdf",
      "title": "Gerechtigkeit 4.0"
    }
  ],
  "attachments": [
    {
      "url": "/system/event_attachments/attachments/000/004/033/original/Faire_Digitalisierung_gestalten.png?1576507093",
      "title": "Digitalisierung fair gestalten "
    }
  ]
}