{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/11035.html",
  "id": 11035,
  "guid": "3615eddc-bf2c-4c32-9f98-ba4738c82c90",
  "logo": null,
  "date": "2019-12-30T11:30:00+01:00",
  "start": "11:30",
  "duration": "00:40",
  "room": "Eliza",
  "slug": "36c3-11035-gerechtigkeit_4_0",
  "title": "Gerechtigkeit 4.0",
  "subtitle": "Makroökonomische Auswirkungen der Digitalisierung auf den Globalen Süden",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "de",
  "abstract": "In den gegenwärtigen Debatten um die Digitalisierung werden systemische und strukturelle Auswirkungen der Digitalisierung auf Entwicklungs- und Schwellenländer und damit verbundene potentielle Risiken und Herausforderungen bislang kaum betrachtet und diskutiert. Ein schwerwiegendes Versäumnis, hatte doch bereits die Weltbank, einer der größten Förderer von IKT in den Ländern des Globalen Südens, in ihrem Weltentwicklungsbericht ‚Digital Dividende‘ (2016) selbstkritische eingeräumt, der digitale Wandel bleibe nicht nur hintern, sondern verschärfe die soziale Ungleichheit. \r\nDer Vortrag setzt sich mit der Frage auseinander, inwiefern die Digitalisierung zur Überwindung von Armut und sozialer Ungleichheit in den Ländern des Südens beitragen können. Erweitern sie die Chancen auf gesellschaftliche und ökonomische Teilhabe von benachteiligten Menschen oder verengen sie diese? \r\nSchwerpunkt der Analyse bildet die Auseinandersetzung mit dem digitalen Handel. Fast unbemerkt hat sich in der Handelspolitik eine neue Dynamik entwickelt. Führende Tech-Konzerne, allen voran die aus dem Silicon Valley, instrumentalisieren zunehmend das Handelsrecht für ihre Interessen. Dabei geht es längst nicht mehr nur um die Reduzierung von Zöllen auf digitale Produkte wie Software oder einheitliche Standards für Telekommunikationsdienste. Patente auf Künstliche Intelligenz sowie die (Nicht)Regulierung von Datenflüssen sind inzwischen auch Bestandteil handelsrechtlicher Regelungen und Gegenstand kontroverser Debatten in der Welthandelsorganisation WTO. Für die Länder des Globalen Südens – aber nicht nur für sie – steht dabei viel auf dem Spiel, einschließlich der Gefahr eines neuen, digitalen Kolonialismus. \r\nIm Vortrag zeigt zudem erste Ansätze zum Aufbau einer fairen und menschenwürdigen Digitalisierung auf. \r\n",
  "description": "Digitaler Handel ist unfairer als analoger Handel\r\nVor 25 Jahren kaufte ein Internetnutzer aus Philadelphia, mit seiner Kreditkarte am Computer eine Audio-CD des Musikers Sting. Der elektronische Handel war geboren. Ein Jahr später verkaufte auch Amazon sein erstes Buch über das Internet. Das Unternehmen aus Seattle startete 1995 als kleiner Online-Buchhändler, weil Bücher robust beim Versand waren und eine ordentliche Gewinnmarge boten.\r\nIn der Frühphase des elektronischen Handels wurden, wie diese Beispiele zeigen, vor allem physisch greifbare, materielle Güter wie CDs oder Bücher verkauft. Typischerweise über einen Webshop im Internet bestellt, lieferten die Post oder private Paketdienste die Ware dann an die Kund/innen. Das ist bis heute so geblieben. Noch heute stellt der Verkauf physischer Güter den Großteil des elektronischen Handels dar.\r\n\r\nNeue Produkte aufgrund technischer Fortschritte\r\nMit dem technischen Fortschritt kamen neue Produkte und Vermittlungswege zwischen Anbietern und Nachfragern hinzu, so dass heutzutage auch zahlreiche Dienstleistungen wie Hotelreservierungen, Online-Kurse oder Versicherungsvermittlung angeboten und direkt digital übermittelt werden. \r\nDazu änderten einige Waren auch ihre Gestalt und verwandelten sich vom physischen Produkt ins digitale. So werden jetzt neben gedruckten Büchern auch E-Books über das Internet gehandelt. Die digitalen Produkte bestehen im Wesentlichen aus Daten und Programmen. Ähnliche Transformationen erfuhren Audio- oder Video-CDs, deren Inhalte heutzutage per Webradio oder Streamingdienst konsumiert werden können.\r\n\r\nVom E-Commerce zum digitalen Handel\r\nDurch die Fortschritte in der Kommunikation mit mobilen Endgeräten und die Entwicklung der Smartphones wurden zahlreiche weitere physische Güter zu digitalen: Flugscheine, Kinotickets oder Landkarten. Per Apps lassen sie sich in digitaler Form nutzen, sei es beim Einchecken auf den Flughäfen, beim Einlass ins Kino oder bei Wandertouren. Auch diese Digitalprodukte werden im Internet gehandelt. Mit der Verlagerung der gehandelten Güter von materiellen Produkten zu immateriellen wandelte sich auch die Begrifflichkeit. So verdrängte der Terminus des „digitalen Handels“ zunehmend den des „elektronischen Handels“. \r\n\r\nAsymmetrische Einbindung des globalen Südens \r\nMit dem digitalen Handel und der Digitalwirtschaft werden häufig große Hoffnungen für den Globalen Süden verknüpft. Die Schaffung neuer, digitaler Märkte sei mit hohen Wachstumsraten verbunden, einhergehend mit einer Steigerung des Wohlstandes, behaupten nicht nur Tech-Konzerne, sondern auch Akteure aus der Entwicklungszusammenarbeit.\r\nWie hat sich nun der Handel mit digitalen Produkten auf die Staaten Afrikas, Asiens und Lateinamerikas ausgewirkt? Ein Bericht der Vereinten Nationen gibt Antwort. Die UNCTAD analysierte welche Regionen von dem Handel mit immateriellen Gütern profitieren und welche nicht. Demnach entfällt gut die Hälfte (51 Prozent) des weltweiten Handelsvolumens auf den asiatisch-pazifischen Raum. Gefolgt von Europa (24 Prozent) und Nordamerika (23 Prozent) – mit jeweils fast einem Viertel des globalen Handelsvolumens. Afrika - einschließl. dem Nahen Osten! -  repräsentiert hingegen nur ein Prozent. Auf Lateinamerika entfällt ebenfalls nur ein Prozent. Damit ist das Gefälle zwischen den verschiedenen Weltregionen beim digitalen Handel noch gravierender als beim analogen Handel. Dort repräsentieren Afrika und Lateinamerika zusammengenommen zumindest acht Prozent des Welthandels.\r\n\r\nChina profitiert, Entwicklungsländer leiden unter Handelsbilanzdefiziten\r\nWelche Länder profitieren vom Handel mit immateriellen bzw. digitalen Produkten? Laut einer UNCTAD-Studie (2017) ist China der größte Exporteur von Videospielen, Filmen und anderen elektronisch übertragenen Produkten, - gefolgt von Deutschland, den USA und Großbritannien.\r\nWelche Folgen haben diese ungleichen Austauschbeziehungen zwischen China und den führenden Industrienationen einerseits, und den Entwicklungs- und Schwellenländern andererseits? Die Auswirkungen sind in erster Linie monetärer Natur.\r\nDie Mehrzahl der Staaten im südlichen Afrika leidet unter einem Handelsbilanzdefizit, da sie weit mehr  IT-Produkte importiert als sie exportierten. Ein kleines Land wie Malawi etwa verzeichnet ein Defizit von rund 70 Millionen US-Dollar. \r\nUnd sogar Schwellenländer gehören zu den sog. Nettoimporteuren und weisen zum Teil hohe Handelsdefizite auf. In Mexiko etwa belief sich das Defizit auf fast 600 Millionen US-Dollar. Thailand, Südafrika, Chile und Brasilien weisen ebenfalls Defizite von jeweils über 200 Millionen US-Dollar auf.\r\n\r\nE-Commerce im Rahmen von Handelsabkommen Der digitale Handel ist seit langer Zeit Bestandteil von Handelsabkommen. Entsprechende Regelung findet sich sowohl in bilateralen als auch multilateralen Verträgen. Den Anfang macht die WTO. Die Welthandelsorganisation verabschiedete bereits bei ihrer ersten Ministerkonferenz, 1996 in Singapur, den dazu bislang umfassendsten Vertrag: das Informationstechnologieabkommen ITA (Information Technology Agreement). Beim ITA handelt es sich um ein so genanntes plurilaterales Abkommen unter dem Dach der WTO, da sich seine Gültigkeit nicht auf alle WTO-Mitgliedstaaten erstreckt, sondern nur auf die Unterzeichnerstaaten. Mittlerweile haben 81 Staaten das ITA unterzeichnet.\r\n„Erreichen maximaler Freiheit für Produkte der Informationstechnologie im Welthandel\" lautet das oberste Ziel des ITA. Der Vertrag schreibt den Abbau von Zöllen auf informationstechnologische Güter vom PC bis zum Handy vor. Im Rahmen der 10. WTO-Ministerkonferenz 2015 in Nairobi wurden über 200 neue Produkte in das Abkommen übernommen. Sie umfassen einen Wert von 1,3 Billionen US-Dollar. \r\n\r\nAuswirkungen des ITA auf Globalen Süden\r\nWelchen Auswirkungen haben das ITA und die dort vereinbarten Zollsenkungen auf Null? Bei der Beantwortung der Frage müssen wir unterscheiden zwischen den Tech-Konzernen und Konsumenten einerseits – und den Staaten andererseits. IT-Konzerne, die bei der Herstellung von Tablets oder GPS-Geräten zu den Marktführen gehören, profitieren von der Abschaffung der Zölle. Eine Nichterhebung von Zöllen auf die international gehandelten Produkte reduziert deren Kaufpreise und erhöht damit die Verkaufszahlen von Microsoft, Apple und Co.. Während die Tech-Konzerne steigende Umsätze verzeichnen, erfreuen sich die Konsumenten daran, ihr Handy zu einem günstigeren Preis erwerben zu können.  \r\nStaaten hingegen müssen eine andere Rechnung aufmachen. Die fehlenden Zolleinnahmen gehen zu Lasten ihres Staatshaushalts. Die Einnahmenverluste durch den Wegfall der Zölle sind vor allem für die Gruppe der am wenigsten entwickelten Länder (Least Developed Countries – LDCs) problematisch, da ihre Staatshaushalte teils in hohem Maße von Zöllen abhängen. So liegt der geschätzte Anteil der Zölle an den gesamten Steuereinnahmen in Togo, Benin, Sierra Leone oder Mali bei über 40 Prozent.\r\n\r\nIndustriestaaten drängen auf permanentes Zollverbot…\r\nBislang handelt es sich um ein zeitlich befristetes Zollmoratorium. Bei jeder der WTO-Ministertagungen, die im zwei Jahres Turnus stattfinden, müssen die Mitgliedstaaten einer Verlängerung der Zollreduzierung zustimmen. Die Industrieländer, in denen die großen IT-Konzerne ansässig sind, drängen seit geraumer Zeit darauf, es in ein unbefristetes, permanentes Moratorium umzuwandeln.\r\n… Entwicklungsländer halten dagegen\r\nBei den Entwicklungsländern stößt dieses Vorhaben auf viel Kritik. Fehlende Staatseinnahmen ist nur eines ihrer Gegenargumente. Zölle können auch ein wichtiges wirtschaftslenkendes Instrument sein. Allen voran haben die Staaten Südostasiens vorgemacht, wie Entwicklungsländern eine nachholende Industrialisierung gelingen kann. Südkorea und Singapur waren u. a. deswegen so erfolgreich, weil sie ihre – noch im Aufbau befindlichen – neuen Industrien vor ausländischer Konkurrenz schützten –  indem sie Außenzölle auf jene Importe erhoben, die sie zukünftig im eigenen Land selbst produzieren wollten. Erst als ihre Unternehmen international wettbewerbsfähig waren, gingen sie mit diesen Schutzzöllen runter.\r\nHinsichtlich der Perspektiven für den Aufbau eigener Märkte in Ländern des Südens fragt das South Centre, eine Beratungsorganisation der Entwicklungsländer, deswegen sorgenvoll: „Wenn Zölle nicht länger relevant sind, weil die Konsumentinnen und Konsumenten digitale Produkte kaufen, die nicht mehr den Zoll passieren, was bedeutet das für die lokalen und regionalen Märkte, die wir aufzubauen versuchen?“ Die regionalen afrikanischen Märkte etwa seien für afrikanische Industrieunternehmen unverzichtbar, da sie einen Großteil ihrer an Wertschöpfung reichen Produktion in Afrika absetzen. Sichere Absatzkanäle seien deswegen eines der wichtigen Motive für den Aufbau der afrikanischen Freihandelszone CFTA (Continental Free Trade Area). Gibt es keinen adäquaten Außenschutz zur Steuerung des elektronischen Handels mit digitalen Produkten, könnte ein Teil dieser Bemühungen scheitern. \r\n\r\nDas Anfang 2019 in Kraft getretene transpazifische CPTPP-Abkommen, dem elf Staaten, darunter sechs OECD-Länder (Japan, Kanada, Neuseeland, Australien, Chile, Mexiko) angehören ist insofern ein Negativbeispiel für einen fairen Handel. Gleiches gilt für das zwischen den USA und Japan am 25. September 2019 abgeschlossene Handelsabkommen, welches am 1. Januar 2020 in Kraft treten könnte. \r\nBeide Abkommen verfolgen die Nicht-Regulierungsagenda des Silicon Valley, die seit 2000 zur offiziellen Handelspolitik der USA erklärt wurde, indem Washington eine Digitale Agenda verabschiedete, wonach in Handelsabkommen der USA u. a. die folgenden Verbote hineinverhandelt werden sollen:\r\n•\tVerbot von Zöllen\r\n•\tVerbot einer Digitalsteuer\r\n•\tVerbot lokaler Datenspeicherung\r\n•\tVerbot Quellcodes zu öffnen\r\nSolche Regelungen schränken den politischen Gestaltungsspielraum von Staaten in unzulässigem Maße ein und schicken Entwicklungs- und Schwellenländer bereits zum gegenwärtigen Zeitpunkt auf die Verliererstraße.\r\n\r\nGestaltung einer fairen Digitalisierung\r\n(1)Handelspolitische Spielräume erweitern \r\nNach Ansicht der Vereinten Nationen müssen die Entwicklungsländer in die Lage versetzt werden, eine eigene - auf ihre nationalen Bedürfnisse zugeschnittene - digitale Wirtschaft aufzubauen. Voraussetzung hierfür ist, dass die gegenwärtigen politischen Gestaltungsräume erhalten und sogar ausgebaut werden. Aus dieser Forderung zieht die UNCTAD zwei Konsequenzen:\r\nErstens: Keine übereilten Handelsabkommen, die eine weitere Liberalisierung des digitalen Handels vorantreiben. Denn die Erfahrungen lehrt, dass dies zu Lasten der Länder geht, die sich auf einem niedrigeren Entwicklungsniveau befinden. \r\nZweitens müssen die rechtlichen und politischen Möglichkeiten zur Förderung und zum Schutz der heimischer digitalen Wirtschaft, erweitert werden. Bislang erlaubt das Handelsrecht den Schutz der eigenen Wirtschaft nur unter sehr strikten Konditionen. Hier besteht Reformbedarf bei der WTO und auch in bilateralen Abkommen. \r\n\r\n\r\n(2) Digitale Kluft mit öffentlichen Infrastruktur schließen \r\nAlle Akteure sind sich ein: Die digitale Kluft, die unseren Globus in zwei Hälften schneidet, muss geschlossen werden. Wir dürfen dieses Vorhaben aber nicht, ´den ‚Big Five‘ aus den Silicon Valley und auch nicht Alibaba oder anderen Unternehmen aus China. überlassen. \r\nDiese sind ohnehin eifrig dabei sind, die für die Digitalisierung notwendige Infrastruktur - wie Seekabel und Funkmasten - aufzubauen. Die Internetkonzerne tun dies bekanntlich nicht aus altruistischen Überlegungen, sondern wollen sich damit vielmehr Zugang zu neuen Märkten und    &   Zugang zu den Daten verschaffen.\r\nDamit sich die Abhängigkeiten von den großen IT-Unternehmen nicht weiter vergrößert, müssen die Länder des Südens befähigt werden eine öffentliche Dateninfrastruktur auf- und auszubauen. Dazu werden sie aber von sich aus nicht in der Lage sein. Vielmehr ist die Internationale Staatengemeinschaft herausgefordert die Entwicklungsländer dabei zu unterstützen. Die Industriestaaten müssen vor allem die dafür notwendigen Ressourcen zur Verfügung stellen – angefangen von der finanziellen Unterstützung bis hin zum Wissens- und Technologietransfer. \r\n\r\n(3) Digitale Monopole kontrollieren und regulieren \r\nIn den vergangenen 20 Jahren haben die führenden IT-Unternehmen aus den USA und China eine - historisch einmalige - marktmächtige Stellung eingenommen. Diese dominante Monopolstellung erschwert es kleineren und später hinzugekommenen Unternehmern, auf dem Markt bestehen zu können. Sogar etablierte Unternehmen in Indien oder auf dem afrikanischen Kontinent geraten durch digitale Plattformen in Bedrängnis. \r\nVor diesem Hintergrund ist es wichtig, politische Rahmenbedingungen zu schaffen, welche die Monopole kontrollieren und regulieren.  Die Europäische Union denkt und handelt bereits in diese Richtung. Bislang allerdings in erster Linie nur bezogen auf ihren eigenen Wirtschaftsraum. Wir müssen die Regulierung von Monopolen jedoch als eine globale Aufgabe betrachten.\r\n\r\n(4) Nationale und regionale Plattformen fördern\r\nDamit die Entwicklungsländer nicht langfristig auf die Rolle von Datenzulieferern für die globalen Akteure beschränkt bleiben, müssen sie eigene nationale und regionale Plattformen aufbauen. Eine der wichtigsten Voraussetzungen ist, grenzübergreifende, regionale Märkte zu schaffen. Deutschland und die EU sind bei diesem Ziel doppelt herausgefordert. Zum einen müssen sie die Länder dabei unterstützen, regionale Märkte zu schaffen. Zum anderen darf die EU diese Anstrengungen nicht mit bilateralen Abkommen konterkarieren, wie sie es gegenwärtig mit den Wirtschaftspartnerschaftsabkommen tut.\r\n\r\n  (5) Genossenschaftliche Plattformen und neue Governance-Strukturen schaffen\r\nUm möglichst vielen Menschen eine Arbeit zu bieten und den gesellschaftlichen Zusammenhalt zu stärken, sollten digitale Plattformen aufgebaut werden, die einzelne Produkte und Dienstleistungen auch genossenschaftlich erbringen können. Zugleich müssten neue Governance-Strukturen etabliert werden, die diese genossenschaftlichen Plattformen gegenüber Aktiengesellschaften wettbewerbsfähiger werden lassen. Staatliche Programme – unterstützt durch globale Kapitalgeber – könnten hier eine wichtige Rolle einnehmen und den digitalen Plattformen im Globalen Süden das notwendige Kapital zur Verfügung stellen. \r\n\r\n\r\n",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9698,
      "public_name": "Sven Hilbig"
    }
  ],
  "links": [
    {
      "url": "https://info.brot-fuer-die-welt.de/sites/default/files/blog-downloads/gerechtigkeit_4.0.pdf",
      "title": "Gerechtigkeit 4.0"
    }
  ],
  "attachments": []
}