{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/11006.html",
  "id": 11006,
  "guid": "3617ab07-b4ec-422e-a5df-a6ca16d8f3c1",
  "logo": "/system/events/logos/000/011/006/large/Deep_Learning.jpg?1575975600",
  "date": "2019-12-28T14:10:00+01:00",
  "start": "14:10",
  "duration": "01:00",
  "room": "Ada",
  "slug": "36c3-11006-der_deep_learning_hype",
  "title": "Der Deep Learning Hype",
  "subtitle": "Wie lange kann es so weitergehen?",
  "track": "Resilience & Sustainability",
  "type": "lecture",
  "language": "de",
  "abstract": "Deep Learning ist von einem Dead End zur ultimativen Lösung aller Machine Learning Probleme geworden - und einiger anderer auch. Aber wie gut ist dieser Trend wirklich? Und wie nachhaltig?\r\n\r\nWir setzen uns mit wissenschaftlicher Nachhaltigkeit, sozialen Auswirkungen, und den Folgen für unsere Ressourcen, unseren Energieverbrauch, und damit unseren Planeten auseinander.",
  "description": "Deep Learning ist von einem Dead End zur ultimativen Lösung aller Machine Learning Probleme geworden. Die Sinnhaftigkeit und die Qualität der Lösung scheinen dabei jedoch immer mehr vom Buzzword Bingo verschluckt zu werden. \r\n\r\nIst es sinnvoll, weiterhin auf alle Probleme Deep Learning zu werfen? Wie gut ist sind diese Ansätze wirklich? Was könnte alles passieren, wenn wir so weiter machen? Und können diese Ansätze uns helfen, nachhaltiger zu leben? Oder befeuern sie die Erwärmung des Planetens nur weiter?\r\n\r\nWir setzen uns im Detail mit drei Fragestellungen auseinander:\r\n\r\n1. Wissenschaftliche Nachhaltigkeit: Wie gut sind die Ergebnisse wirklich? Was können die modernen neuronalen Netze und was können sie nicht? Und vor allem: Wo werden sie eingesetzt und wie sinnvoll ist das? KI Systeme, deren Beschreibung beeindruckend sind, produzieren nicht immer die besten Ergebnisse, und Reproduzierbarkeit, Evaluation, und Reflexion leiden unter Konkurrenzdruck und dem Publikationszyklus. Außerdem, welche Lösungen und Ansätze gehen im Deep Learning Hype unter? Dafür, dass sich so viele Forscher*innen mit dem Thema beschäftigen, zahlen wir damit, dass andere Themen, Ideen und Ansätze ignoriert werden - obwohl sie nützlich sein könnten.\r\n\r\n2. Gesellschaftliche Auswirkungen: Was macht das mit unserer Gesellschaft? Insbesondere die Maschinen, die auf irgendeiner Ebene versuchen, Menschen zu imitieren, aber auch viele Anwendungen, die wir alltäglich verwenden, haben einen grundlegenden Einfluss auf uns, der nicht immer ausreichend reflektiert wird. Maschinen können auch diskriminieren, unsere Entscheidungen beeinflussen, uns in falscher Sicherheit wiegen und Aufgaben übernehmen, denen sie überhaupt nicht gewachsen sind.\r\n\r\n3. Umwelteinfluss: Welche Ressourcen investieren wir? Rechenzentren, riesige Data Warehouses, Kryptocurrency-Berechnung und Compute Cluster haben einen nicht mehr vernachlässigbaren Einfluss auf unsere endlichen Ressourcen und den CO2-Haushalt, direkt und indirekt. Die Menge an Strom, Zeit, Platz und Material, die wir investieren, sind in den letzten Jahren massiv gewachsen. Wollen wir wirklich so weiter machen?",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9675,
      "public_name": "Nadja Geisler"
    },
    {
      "id": 9716,
      "public_name": "Benjamin Hättasch"
    }
  ],
  "links": [],
  "attachments": []
}