{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/11195.html",
  "id": 11195,
  "guid": "386e040f-9f63-4f55-82cc-08aea9ced7c2",
  "logo": "/system/events/logos/000/011/195/large/icon.png?1572367132",
  "date": "2019-12-27T14:10:00+01:00",
  "start": "14:10",
  "duration": "01:00",
  "room": "Eliza",
  "slug": "36c3-11195-phyphox_using_smartphone_sensors_for_physics_experiments",
  "title": "phyphox: Using smartphone sensors for physics experiments",
  "subtitle": "An open source project for education, research and tinkering",
  "track": "Hardware & Making",
  "type": "lecture",
  "language": "en",
  "abstract": "Modern smartphones offer a whole range of sensors like magnetometers, accelerometers or gyroscopes. The open source app \"phyphox\", developed at the RWTH Aachen University, repurposes these sensors as measuring instruments in physics education. When put into a salad spinner, the phone can acquire the relation of centripetal acceleration and angular velocity. Its barometer can be used to measure the velocity of an elevator. And when using two phones, it is easy to determine the speed of sound with a very simple method.\r\n\r\nIn this talk, I will show these possibilities in demonstration experiments, discuss available sensors and their limitations and introduce interfaces to integrate phyphox into other projects.",
  "description": "In this talk, the developer of the app \"phyphox\" at the RWTH Aachen University will first introduce how sensors in smartphones can be used to enable experimentation and data acquisition in physics teaching with several demonstrations on stage. Available sensors and their limitations will be discussed along with interfaces allowing the integration of phyphox into other project, either as a means to access sensor data or to display data from other sources.\r\n\r\nThe app is open source under the GNU GPLv3 licence and available for Android (>=4.0) and iOS (>=8.0). It is designed around experiment configurations for physics education at school and university, allowing for a quick setup with a single tap. At the same time, these configurations may be modified by any user to set up customized sensor configurations along with data analysis and data visualization, defined in an XML format. These configurations are Turing complete and can easily be transferred via QR codes, so an experienced user (teacher) can create a specific configuration and allow less experienced users (students) to use it with ease.\r\n",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9799,
      "public_name": "Sebastian Staacks"
    }
  ],
  "links": [
    {
      "url": "https://phyphox.org/experiments",
      "title": "Example experiments"
    }
  ],
  "attachments": []
}