{
  "id": 827,
  "guid": "39b6444e-c388-52dc-a8fa-7f61ec2834c1",
  "logo": "",
  "date": "2019-12-27T21:00:00+00:00",
  "start": "21:00",
  "duration": "00:45",
  "room": "headnut",
  "slug": "37KLEL",
  "url": "https://talks.komona.org/36c3/talk/37KLEL/",
  "title": "Extinction Rebellion vs. a diversity of tactics",
  "subtitle": "",
  "track": null,
  "type": "Talk",
  "language": "en",
  "abstract": "Extinction Rebellion (XR) has an extreme stand on actions organised under its name: non-violent mass civil disobedience to disrupt - but also cooperation with the police.   While many think that XRs action are about climate change, XR’s goal is also to change governance - but at the same time claiming to be \"beyond politics\" and without analysing existing power structures.\r\nWe will first present about the study and where this claim for non-violence comes from, and then discuss about where to go from here.",
  "description": "Extinction Rebellion (XR) has an extreme stand on actions organised under its name: non-violent mass civil disobedience to disrupt - but also cooperation with the police. Being arrested is a goal in itself. Depending on the country, participants are explicitly asked to talk to the police. While many think that XRs action are about climate change, XR’s goal is also to change governance - but at the same time claiming to be \"beyond politics\" and without analysing existing power structures.\r\n\r\nMuch of this is based on the interpretation of a single study: a study that is very restricted in its scope and deeply flawed in its understanding of how diverse actions over a long period of time influence the outcome of future actions. XR also calls up images from other protests - some of which were in fact violent - to claim that their way of doing actions is the one that will succeed in a short time span.\r\n\r\nHowever, we now see XR getting more diverse and at least locally engaging with other groups and types of actions. We will first present about the study and where this claim for non-violence comes from, and then discuss about where to go from here.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 29,
      "code": "W79GJH",
      "public_name": "clara",
      "biography": "",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}