{
  "id": 563,
  "guid": "3a728f85-2ebd-5ed5-82bd-1f4b815bba42",
  "logo": "/media/36c3/images/GMHREE/P3.png",
  "date": "2019-12-28T12:00:00+01:00",
  "start": "12:00",
  "duration": "01:00",
  "room": "WikiPaka WG: Esszimmer",
  "slug": "GMHREE",
  "url": "https://cfp.verschwoerhaus.de/36c3/talk/GMHREE/",
  "title": "Prototype Fund Meetup",
  "subtitle": "",
  "track": "Community",
  "type": "Meetup",
  "language": "de",
  "abstract": "Wir sind das Prototype Fund Team und laden alle ein, die von uns gefördert wurden oder mehr über den Fund erfahren möchten, uns und einander kennenzulernen!",
  "description": "Der Prototype Fund unterstützt SoftwareentwicklerInnen, HackerInnen, DatenjournalistInnen und andere Kreative dabei, ihre Public-Interest-Tech-Idee vom Konzept bis zur ersten Demo umzusetzen.\r\n\r\nWir fördern innovative Open-Source-Projekte in den Bereichen Civic Tech, Data Literacy, Datensicherheit und Software-Infrastruktur und supporten Euch mit bis zu 47.500 Euro Förderung pro Team/Einzelentwickler*in.\r\n\r\nMit der Förderung könnt Ihr sechs Monate lang Code schreiben und einen Prototyp Eurer Open-Source-Software entwickeln. Zusätzlich erhaltet Ihr Coachings, Beratung und Vernetzung mit Tech- und weiteren Communities.",
  "recording_license": "",
  "do_not_record": true,
  "persons": [
    {
      "id": 73,
      "code": "NACBSX",
      "public_name": "Marie Gutbub",
      "biography": "Marie ist beim Prototype Fund für Events und die Betreuung und Evaluierung der Förderprojekte zuständig. Sie hat Kulturjournalismus an der Universität der Künste in Berlin studiert und an neuen Modellen für Onlinejournalismus-Plattformen geforscht. Seitdem hat sie als freie Journalistin, Campaignerin, Kommunikationsbeauftragte, Infosec-Trainerin und Event-Organisatorin für verschiedene Projekte im Bereich Journalismus, Privacy und Open Source gearbeitet – unter anderem mit dem Center for Investigative Journalism und Nextcloud.",
      "answers": []
    },
    {
      "id": 74,
      "code": "VXJGMM",
      "public_name": "Thomas Friese",
      "biography": "Ich mag Open *.  \r\nZur Zeit bin ich tagsüber Projektemanager beim Ptorotype Fund und fördere somit Public Interest Tech. Abends bin ich auch manchmal DJ.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}