{
  "id": 881,
  "guid": "3bf2598d-86fa-5b2e-9655-c1f6e7a54191",
  "logo": "",
  "date": "2019-12-29T16:00:00+01:00",
  "start": "16:00",
  "duration": "00:45",
  "room": "dezentrale*",
  "slug": "GAVNSR",
  "url": "https://talks.komona.org/36c3/talk/GAVNSR/",
  "title": "analogue utopia -- a radical critique of the digital",
  "subtitle": "",
  "track": null,
  "type": "Talk",
  "language": "en",
  "abstract": "The process model of the digital is the Turing machine. The Turing machine forms the theoretical basis of most current digital devices, whether smartphone,PC or supercomputer. The two formal operations of Turing machine are a reading and a writing process. A reading- and writing-head operates on an endless paper tape. By extending the model of the Turing machine to multiple reading- and writing-heads similar to a multiple processor system the need for of coordination and synchronization becomes obvious. While synchronization and coordination are a necessity for the digital, in the analogue they show up as emergent effects, such as for example when people clap together. Synchronization also occurs as an emergent phenomenon in technical systems, the dutch researcher Christiaan Huygens, who invented the pendulum clock in the 17th century, is probably the first person who described the effect of synchronizing clocks. Also in networks of simple coupled electronic oscillators synchronization and coordination emerge as a result of mutual coupling. The playing with the subtle couplings, with graded change and with the fine differences hints to a technological aesthetic beyond the digital.",
  "description": "",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 71,
      "code": "PXUUHW",
      "public_name": "fblchrstn",
      "biography": "Christian Faubel is an interdisciplinary scholar working in the differing fields of neuroscience,\r\nautonomous systems research and media art & design. He holds a PhD in electrical engineering\r\nand has completed research on autonomous systems at the Institute for Neural Computation from\r\n2002–2012. In 2002 he founded derstrudel, a collective for the mediation of a relaxed approach\r\nto electronics robotics. In his work, Christian Faubel is interested\r\nin what enables complex behavior, and how this may result from the interaction of very simple\r\nunits and their interrelations. In his artworks, installations, workshops & performances he tries to\r\nconvey insights about theoretical concepts such as self-organisation, emergence or embodiment\r\nalong an aesthetic dimension. He considers his artworks, workshops and performances to be in the\r\ntradition of philosophical toys as they combine the mediation of scientific concepts with pleasure\r\nand amusement.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}