{
  "id": 594,
  "guid": "3d0170ed-e233-545f-87f7-f50d126ddbe6",
  "logo": "/media/36c3/images/TNSGB8/handy-init.png",
  "date": "2019-12-27T19:30:00+01:00",
  "start": "19:30",
  "duration": "00:20",
  "room": "WikiPaka WG: Esszimmer",
  "slug": "TNSGB8",
  "url": "https://cfp.verschwoerhaus.de/36c3/talk/TNSGB8/",
  "title": "Reading Politics in the Algorithm",
  "subtitle": "",
  "track": null,
  "type": "Talk",
  "language": "de",
  "abstract": "Algorithms bear the image of their makers.  Three algorithmic systems are\r\nrevealed to have embodied class interests.  First, a population ecology modeled\r\nby two predator-prey equations leads its reader to conclude that socialist\r\nrevolution and compulsory leisure are the only routes to avoiding civilization\r\ncollapse.  Second, a formula for labor supply reduces us to lazy drones, who\r\nwork as little as possible to support our lifestyle.  Finally, advertising on\r\nWikipedia could be a multi-billion-dollar revenue stream—shall we put it up for\r\nsale or learn to share?",
  "description": "(1) The [Human and Nature Dynamics](https://www.sciencedirect.com/science/article/pii/S0921800914000615)\r\n(HANDY) model is the first to pair environmental resource consumption with\r\nclass conflict, as two predator-prey cycles.  In one cycle we overrun a fragile and\r\ndefenseless Earth, and in the other elites outcompete commoners in consumption,\r\neven to the point of causing them famine.  One can say that socialist\r\nrevolution is embedded in a statement like this.  Indeed, something must be\r\ndone about the growth of over-consuming elites before they doom us all.  I will\r\ngive a tour using this [interactive explorer](https://adamwight.github.io/handy-explorer/).\r\n\r\n(2) A second example is the typical, capitalist formula for labor supply, or\r\n\"whether you go to work in the morning\", loosely `optimize(Consumption, hours\r\nworked)` for the constraint `Consumption ≤ wage x hours + entitlement`.  In\r\nother words, we're seen as lazy and greedy individual agents, each wanting the\r\ngreatest comfort for the least labor.  The worker who internalizes this formula\r\nwill fight for fewer hours of work and higher wages for themself, will find\r\nshortcuts to spend less money, and can be expected to vote in favor of social\r\ndemocratic minimum incomes.  A company following this formula, on the other\r\nhand, will fight against all of these worker gains, and will act to depress\r\ngovernment welfare or minimum incomes until workers are on the edge of\r\nstarvation in order to squeeze longer hours out of them.  What's missing from\r\nthe formula are mutual aid to protect the most vulnerable individuals, pooling\r\nresources, and any other motivation to work besides mortal fear and hedonism.\r\n—One can easily imagine a radically different paradigm for work, in which labor\r\nis dignified and fulfilling.  To understand this world in formulas, labor \r\nsupply is measured in education levels, self-direction, and other positive \r\nfeedback loops which raise productivity.\r\n\r\n(3) Wikipedia and its sister projects have never worn the shackles of paid\r\nadvertising, although they sit on a potential fountain of revenue in the tens\r\nof billions of dollars per year—not to mention the value of the influence over\r\npublic opinion that such a propaganda machine might achieve.  `Revenue = Ads\r\nper visit x Visits`  Analyzed venally, Wikipedia becomes an appealing portfolio\r\nacquisition, which would jeopardize the entire free-open movement.  From a\r\ndifferent perspective, that of an organizer in an editor’s association, slicing\r\npageview and (non)-advertising data might allow for more effective\r\nresource-sharing among the many chapter organizations.  In a third analysis\r\nusing a flow of labor, power, and funds, we can see the Wikimedia Foundation as\r\nengaged in illegitimate expropriation, turning editors into sharecroppers and\r\nsuppressing decentralized growth.  These twists all come about through\r\nvariations on an equation.  Which shall we choose?",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 85,
      "code": "F9MYDW",
      "public_name": "Adam Wight",
      "biography": "I'm a software developer at Wikimedia Deutschland, see https://www.mediawiki.org/wiki/User:Adamw for some of my interests.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}