{
  "id": 594,
  "guid": "3d0170ed-e233-545f-87f7-f50d126ddbe6",
  "logo": "/media/36c3/images/TNSGB8/handy-unnormalized.png",
  "date": "2019-12-27T19:30:00+01:00",
  "start": "19:30",
  "duration": "00:20",
  "room": "WikiPaka WG: Esszimmer",
  "slug": "TNSGB8",
  "url": "https://cfp.verschwoerhaus.de/36c3/talk/TNSGB8/",
  "title": "Reading the politics of the supposedly neutral",
  "subtitle": "",
  "track": "Ethics, Society & Politics",
  "type": "Talk",
  "language": "de",
  "abstract": "Algorithms bear the image of their makers, and toil like their servants.  Technology of any sort cannot be neutral, as it is embedded in a social matrix of why it was created and what work it performs.  An algorithm, its context, and what it lacks should be understood as a political statement carrying great consequences, and as a society we should respond to each as needed, engaging the purveyors of these algorithms on a political level as well as legal and economic.\r\n\r\nThree algorithmic systems are revealed to embody various class interests.  First, a population ecology modeled simply by a pair of predator-prey equations leads one to conclude that socialist revolution and compulsory leisure are the only routes to avoiding civilizational collapse.  Second, a formula for labor supply reduces us to lazy drones who work as little as possible to support our choice of lifestyle.  Finally, advertising on Wikipedia could yield a multi-billion-dollar fortune—shall we put it up for sale or double-down on radical equality among all people?",
  "description": "(1) The [Human and Nature Dynamics](https://www.sciencedirect.com/science/article/pii/S0921800914000615) (HANDY) model is the first to pair environmental resource consumption with class conflict, as two predator-prey cycles.  In one cycle we overrun a fragile and defenseless Earth, and in the other elites outcompete commoners in consumption, even to the point of causing them famine.  One can say that socialist revolution is embedded in a statement like this.  Indeed, something must be done about the growth of over-consuming elites before they doom us all.  I will give a tour using this [interactive explorer](https://adamwight.github.io/handy-explorer/).\r\n\r\n(2) A second example is the typical, capitalist formula for labor supply, or \"whether you go to work in the morning\", loosely `optimize(Consumption, hours worked)` for the constraint `Consumption ≤ wage x hours + entitlement`.  In other words, we're seen as lazy and greedy individual agents, each wanting the greatest comfort for the least labor.  The worker who internalizes this formula will fight for fewer hours of work and higher wages for themself, will find shortcuts to spend less money, and can be expected to vote in favor of social democratic minimum incomes.  A company following this formula, on the other hand, will fight against all of these worker gains, and will act to depress government welfare or minimum incomes until workers are on the edge of starvation in order to squeeze longer hours out of them.  What's missing from the formula are mutual aid to protect the most vulnerable individuals, pooling resources, and any other motivation to work besides mortal fear and hedonism.—One can easily imagine a radically different paradigm for work, in which labor is dignified and fulfilling.  To understand this world in formulas, labor supply is measured in education levels, self-direction, and other positive feedback loops which raise productivity.\r\n\r\n(3) Wikipedia and its sister projects have never worn the shackles of paid advertising, although they sit on a potential fountain of revenue in the tens of billions of dollars per year—not to mention the value of the influence over public opinion that such a propaganda machine might achieve.  `Revenue = Ads per visit x Visits`  Analyzed venally, Wikipedia becomes an appealing portfolio acquisition, which would jeopardize the entire free-open movement.  From a different perspective, that of an organizer in an editor’s association, slicing pageview and (non)-advertising data might allow for more effective resource-sharing among the many chapter organizations.  In a third analysis using a flow of labor, power, and funds, we can see the Wikimedia Foundation as engaged in illegitimate expropriation, turning editors into sharecroppers and suppressing decentralized growth.  These twists all come about through variations on an equation.  Which shall we choose?",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 85,
      "code": "F9MYDW",
      "public_name": "Adam Wight",
      "biography": "I'm a software developer at Wikimedia Deutschland, see https://www.mediawiki.org/wiki/User:Adamw for some of my interests.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}