{
  "id": 1100,
  "guid": "3daf76a7-622b-473c-a9c4-36d193a841ba",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:KinkyGeeks_-_Playfight_Bondage_Workshop",
  "logo": null,
  "date": "2019-12-29T18:00:00+01:00",
  "start": "18:00",
  "duration": "2:00",
  "room": "Lecture room M3",
  "slug": "36c3-1100-session_kinkygeeks_playfight_bondage_workshop",
  "title": "KinkyGeeks - Playfight Bondage Workshop",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "workshop",
  "language": "de",
  "abstract": "",
  "description": "how to: playful overpowering and bondage someone\nThis workshop will provide you with the basics of playfighting, i.e., consensual physical power struggle with the goal of overpowering your partner. Since our topic is all fun and games, this is ''not'' a self-defense or martial arts workshop. We will learn bondage techniques that can be applied quickly, and that are suitable for enacted resistance.The topics of this workshop include:* Consent, risk-awareness and negotiation as a fundamental base for all CNC-style play.* A short primer into anatomy and physical safety* A short discussion about physical (dis)advantages, D/s roles, and desired outcomes (aka. playfight for non-switches)* Techniques with handcuffs (short)* Techniques with rope (long). How to prepare a tie beforehand, how to apply it during playfight, how to integrate immobilization into playfightingThe first parts will be seminar-style theoretic discussions. You're welcome to contribute your own opinions, experiences, and questions. The later parts will involve practice. We will show the ties, and you can practice while our team is there to help and answer questions.If you have own rope, please do bring it along. We have some rope you can borrow on a first-come-first-serve basis, though. If you have material that are you are unsure of whether it is usable or not (or for which need an opinion on safety), bring it along and ask someone from our team.You do not necessarily need to come with a parter. Although we have never and will never assign practice groups / couples, the past workshops have shown that participants usually find opportunities for practice even if they arrive alone.This workshop is 18+. Participation in the practical parts is at each participant's own risk. We do have an experienced team around, but playfight is edge play, and we can't be everywhere and see everything at the same time. On the other hand, the team is allowed to step in whenever they see something that is beyond our safety baseline.'''Important:''' In the previous years, we regularly had way too many people trying to get in (rooms are objects of finite size), with waiting lines all across the hallway. This year, we want to avoid the crowd control issues that come with such scenarios. That's why you now need to pre-register for the workshop at https://ticket.kinkygeeks.de. Our website will give you a free ticket, which you need to provide at the workshop door to gain access.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Lil-Missy",
      "public_name": "Lil-Missy"
    }
  ],
  "links": [
    "https://kinkygeeks.de"
  ]
}