{
  "id": 257,
  "guid": "3ea84afe-51cf-5219-b658-79f331cdc381",
  "logo": "",
  "date": "2019-12-27T22:00:00+01:00",
  "start": "22:00",
  "duration": "00:50",
  "room": "Chaos-West Bühne",
  "slug": "RUCJJQ",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/RUCJJQ/",
  "title": "Storing energy in the 21st centruy",
  "subtitle": "",
  "track": "Nicht Computers",
  "type": "Doppelter Slot",
  "language": "en",
  "abstract": null,
  "description": "The 21st century will be powered by electricity. I'm a journalist in the field of science and technology reporting. I followed the development of electricity storage and generation for over 10 years. In this talk I will outline the current state of electricity storage technology and its limitations. There is a gap between the intermittent availability of electricity generation and demand for it.\r\n\r\nCobalt and Lithium are increasingly limited in supply and their production is often produced using unsustainable means. Alternatives are being development and will be presented. Some of these technologies are in the form of chemical batteries and some use very surprisingly simple technologies.\r\n\r\nI will be giving an introduction into future technologies for electricity storage currently in development. Some of these are batteries without rare materials and others are not batteries at all.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 69,
      "code": "NHG9JU",
      "public_name": "Frank Wunderlich-Pfeiffer",
      "biography": "[Platzhalter - wird später geupdated]\r\n\r\nFrank Wunderlich-Pfeiffer ist Vollzeitnerd und hat 2015 in Golems Wissenschaftsressort seine ersten Erfahrungen im Journalismus gemacht. Nach einem Studium der Physik und des Wirtschaftsingenieurswesens begeistert er sich für Raumfahrt, Technik und Wissenschaft allgemein, außerdem spielt er seit 2008 für die Go-Bundesliga-Mannschaft von Jena.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}