{
  "id": 1059,
  "guid": "40223e47-9260-4412-a25c-3ed07ac2fd70",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Carbon.txt_-_what_would_a_robots.txt_for_green_infrastructure_look_like%3F",
  "logo": null,
  "date": "2019-12-29T17:00:00+01:00",
  "start": "17:00",
  "duration": "1:00",
  "room": "Lecture room M2",
  "slug": "36c3-1059-session_carbon_txt_what_would_a_robots_txt_for_green_infrastructure_look_like_",
  "title": "Carbon.txt - what would a robots.txt for green infrastructure look like?",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "workshop",
  "language": "en",
  "abstract": "",
  "description": "We all know computers run on electricity, and that we need to, as responsible professionals, get our infrastructure off fossil fuels to stand a chance of avoiding the worst of climate change. But how can you know if organisations in a digital project’s supply chain really are running on renewable power? After spending ten years building an open database to make this easy to check at the The Green Web Foundation, we are proposing a convention called carbon.txt, to decentralise this process.\nWe all know computers run on electricity, and that we need to, as responsible professionals, get our infrastructure off fossil fuels to stand a chance of avoiding the worst of climate change. But how can you know if organisations in a digital project’s supply chain really are running on renewable power? After spending ten years building an open database to make this easy to check at the The Green Web Foundation, we are proposing a convention called carbon.txt, to decentralise this process. We have two goals:1) make it easier to make claims about how you power your infrastructure, by linking them to the certificates issued when renewable energy generation, like new wind farms and solar panels is attached to national grids.2) make it easy to verify claims made by others, by taking as many lessons from solving similar problems over the last 30 years of the internet, so you can follow a chain of provenance from a website or API, to the datacentre is uses, to the energy provider, to the energy certificates used to generate that powerWe are looking for collaborators to help develop the spec, implement tools against in different languages, and test it for common use cases.Chris Adams is an environmentally focussed tech generalist, spending the last ten years working in tech startups, blue chip companies and government, as a user researcher, product manager, developer, sysadmin and UX-er.He is an organiser of ClimateAction.tech, a community for technology professionals taking climate action, and a director of the Green WebFoundation.Martin Meyerhoff is a freelance software developer and coach with a background in public policy and administration, specialising in German climate policy. He is a member of the board on Open Tech School eV, and has spent the last 5 years teaching serverside programming at community events in Berlin. He is currently partnering with the Green Web Foundation on building D.A.M.E.E., the world’s largest distributed, open source GHG emission tracking tool.",
  "persons": [],
  "links": [
    "https://carbontxt.org/"
  ]
}