{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10948.html",
  "id": 10948,
  "guid": "41e88ad7-8504-4e69-b312-f125d62240bd",
  "logo": null,
  "date": "2019-12-30T14:30:00+01:00",
  "start": "14:30",
  "duration": "00:40",
  "room": "Dijkstra",
  "slug": "36c3-10948-aufbau_eines_sensornetzes_fur_die_messung_von_stickstoffdioxid",
  "title": "Aufbau eines Sensornetzes für die Messung von Stickstoffdioxid",
  "subtitle": "",
  "track": "Hardware & Making",
  "type": "lecture",
  "language": "de",
  "abstract": "Ausgehend von den behördlichen Messnetz für Stickoxide soll der Aufbau einer preisgünstigen Open Source Messstation für Stickstoffdioxid, inklusive Kalibrierung und der behandlung von Störenden einflüssen behandelt werden. Zusätzlich soll eine Webanwendung vorgestellt werden welche die Daten aus einem Messnetz der NO2-Messstationen sammelt, auf Karten visualisiert und somit dem Citizen Science Ansatz Rechnung trägt.",
  "description": "Spätestens seit dem Abgasskandal (Dieselgate) und den daraus resultierenden Fahrverboten für Dieselfahrzeuge ist eine öffentliche Debatte um Stickoxide (insbesondere Stickstoffdioxid (NO2))  als Luftschadstoff entstanden. Die Stickstoffdioxidbelastung in Städten und Gemeinden verunsichert viele Bürgerinnen und Bürger, denn  einerseits ist der Schadstoff nicht wahrnehmbar und andererseits kann Stickstoffdioxid eine erhebliche Gefahr für die Gesundheit darstellen. In Deutschland existieren derzeit nur ca. 350 offizielle Messstationen für Stickstoffdioxid, so dass ortsspezifische oder sogar flächendeckende Angaben zur Luftschadstoffbelastung nicht möglich sind. Ein flächendeckendes Messnetz ist laut Gesetz auch nicht vorgesehen. Folglich können politische oder gerichtlich durchgesetzte Maßnahmen zur Verbesserung der Luftqualität auch nur dort stattfinden, wo Messwerte existieren. Da es gegenwärtig keine Bestrebungen gibt das öffentliche Netz an Messstationen auszuweiten, möchten wir mit diesem Vortrag einen Vorstoß unternehmen, die technischen Grundlagen zur Errichtung eines bürgerschaftlichen Messnetzes zu eruieren und für diesen Zweck konkrete Bauanleitungen und Informationsdienste vorstellen. Im Gegensatz zu den mehrere tausend Euro teuren und eignungsgeprüften Messstationen zeigen wir eine hinreichend akkurate und preisgünstige (<50 Euro) Alternative auf.\r\n\r\nIn dem Vortrag erklären wir euch zunächst wie Stickstoffdioxid durch offizielle Stellen gemessen wird und wie die Grenzwerte definiert sind. Anhand des Status Quo der Datenerhebung erläutern wir bestehende Defizite und Potentiale für eine genauere und flächendeckendere Messung von  Luftschadstoffen wie Stickstoffdioxid.\r\n\r\nIm zweiten Teil des Vortrags beschreiben wir den Aufbau einer preisgünstigen Open Source Messstation für Stickstoffdioxid. Dabei werden Kriterien für die Auswahl von Komponenten und die Durchführung einer Vergleichsuntersuchung mit einem eignungsgeprüften Messgerät vorgestellt. Außerdem werden Kalibrierungsmethoden und die Behandlung von störenden Einflüssen durch Luftfeuchtigkeit und Temperaturschwankungen thematisiert.\r\n\r\nIm dritten Teil des Vortrags wird eine Web-Anwendung vorgestellt, die Daten aus einem Messnetz der NO2-Messstationen sammelt, auf Karten visualisiert und somit dem Citizen Science Ansatz Rechnung trägt. Dabei diskutieren wir auch Vor- und Nachteile unterschiedlicher kartenbasierten Darstellungsformen von Luftschadstoffmesswerten.\r\n\r\n\r\n",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9588,
      "public_name": "Patrick Römer"
    }
  ],
  "links": [],
  "attachments": [
    {
      "url": "/system/event_attachments/attachments/000/003/942/original/Abstract.pdf?1572080591",
      "title": "Abstract als PDF"
    }
  ]
}