{
  "id": 844,
  "guid": "4233d8c9-104f-5947-b302-0b4811660c15",
  "logo": "",
  "date": "2019-12-29T20:00:00+01:00",
  "start": "20:00",
  "duration": "01:30",
  "room": "dezentrale*",
  "slug": "NMU3FZ",
  "url": "https://talks.komona.org/36c3/talk/NMU3FZ/",
  "title": "Open Orbit - Teil 1",
  "subtitle": "",
  "track": null,
  "type": "Workshop",
  "language": "de",
  "abstract": "Die Polizeiklasse möchte mit allen zusammenkommen, die an den Themen der Versicherheitlichungspolitik und der Ausweitung von Befugnissen der Polizei bzw. Sicherheitsdiensten interessiert sind. Ziel ist es einen Austausch zwischen diesen Interessierten zu schaffen, um gemeinsam neue Ideen, Formate oder Aktionen zu gestalten.",
  "description": "Im Vorfeld zum Open Orbit wird es neben dem offiziellen Programm des CCC am Samstag Vorträge durch die Polizeiklasse und Freunde geben.\r\n\r\nWeitere interessante Vorträge in Anlehnung zu unseren Themen im Fahrplan:\r\n\r\nhttps://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/11141.html\r\nhttps://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10766.html\r\nhttps://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10828.html\r\nhttps://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10977.html\r\nhttps://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10762.html\r\nhttps://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10983.html\r\n\r\n--\r\n\r\nDie Polizeiklasse versteht sich als aktivistisches Kollektiv, welches sich mit künstlerisch-performativen Mitteln gegen die zunehmend autoritären Tendenzen in demokratischen Gesellschaften wendet. Gegründet 2018 als widerständige Reaktion gegen die Verschärfung des bayerischen Polizeigesetzes in München, gewinnt der Themenkomplex „autoritäre Wende/Kritik der Polizei“ zunehmend an öffentlicher Relevanz.\r\n\r\nDie Diskussion um die Polizeipräsenz auf der Fusion, die Offenlegung rechtsextremer Netzwerke innerhalb der Polizei, die bundesländerübergreifende Verschärfung der Polizeigesetze oder die Möglichkeit einer Regierungsbeteiligung der AfD sind nur die prominentesten Gründe.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 33,
      "code": "ADDBYZ",
      "public_name": "Polizeiklasse",
      "biography": "Die POLIZEIKLASSE ist ein interdisziplinäres klassen- und gesellschaftsübergreifendes kollektivistisches akademisches Experimental-Projekt der sozialplastisch bildenden Künste. Ein Themenschwerpunkt ist die kritische Auseinandersetzung mit realpolitischen Fragestellungen und deren Folgen für Kunst- und Kulturbetrieb. Ein Versuchslabor für individuelle Autonomie in kollektiver Aktion.\r\n\r\nKurz: NEIN.\r\n\r\nkollektiv@polizeiklasse.org",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}