{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10808.html",
  "id": 10808,
  "guid": "438cc24b-db67-497d-94a3-55fd8692123a",
  "logo": "/system/events/logos/000/010/808/large/small_Yann_Portrait.jpg?1571984755",
  "date": "2019-12-29T12:50:00+01:00",
  "start": "12:50",
  "duration": "01:00",
  "room": "Clarke",
  "slug": "36c3-10808-build_you_own_quantum_computer_home_-_99_of_discount_-_hacker_style",
  "title": "Build you own Quantum Computer @ Home - 99% of discount -  Hacker Style !",
  "subtitle": "",
  "track": "Hardware & Making",
  "type": "lecture",
  "language": "en",
  "abstract": "Quantum technologies are often only over-hyped showed as threat for cybersecurity … But they also offer some opportunities to enhance the cybersecurity landscape . As an example, you may know that a quantum computer will be able to break RSA keys but Quantum communication technologies can also provide a new way to exchange securely a cipher key. More, with Quantum networking technologies, communication eavesdropping are , by design, detectable and thus this could lead to some good opportunities to use them to enhance cybersecurity. Some even begins to build a Quantum internet ! We may also solve main security issues face by cloud computation (privacy, confidentiality etc) via the use of \"Blind quantum computation\" in the cloud.\r\n\r\nHowever few people understand & explain how such machines & technologies work. Even fewer people trying to build one. I’m one of this crazy people.\r\n\r\nIn this talk, we aim to explain how this new type of much powerful digital processing works and how we build our own Quantum computer …without a Phd in quantum physic. We will describe our plan to build the Quantum computer's hardware with hacker’s style. Through our own experiments, we will discuss our failures, our success, our progress around this challenging goal !\r\n\r\nCome to see  part of the hardware we build at the moment. We use the \"Trapped ion technology\". We trap atoms to make powerful calculation & computing task! Be prepared to unlock your quantum brain as this new domain is really different for classical computation ;-) but it can enhance the Cybersecurity world",
  "description": "Our goal : Bring the knowledge that Quantum computing works, explain how they make such power calculation at hardware level, is doable at home and will provide a new way to do secure computing and communication for the best of the humanity\r\n\r\nProposal Agenda \r\n-Quantum computer 101 (one slide to be able to understand the basic of quantum mechanic w/o FUD)  \r\n-Why those Quantum computer are so powerful  \r\n-How to break things with quantum computers\r\n-How to improve the security level of modern network with quantum technologies (Networking, blind quantum computing for 100%privacy in the cloud, cipher key security, quantum internet & more)\r\n-How a Quantum computer based on Trapped ions technology works to do their magic super powerful calculation (at hardware level)  \r\n-How we build our own quantum computer hardware at home (in our military grade High Tech...Garage!) with hacker style & open source software\r\n(Contain full video of the buildings of our Quantum computer)",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9145,
      "public_name": "yann@NextGenQ.com"
    }
  ],
  "links": [
    {
      "url": "https://cyberweek.ae/materials/D3%20TRACK%202%20-%20Build%20a%20Computer%20at%20Home%20-%20Hacker%20Style%20-%20Yann%20Allain.pdf",
      "title": "Link to my last talk on this subject in HITB abu dabi : Build a quantum computer @ home - Hacker style "
    }
  ],
  "attachments": [
    {
      "url": "/system/event_attachments/attachments/000/003/906/original/D3_TRACK_2_-_Build_a_Computer_at_Home_-_Hacker_Style_-_Yann_Allain%281%29.pdf?1571984756",
      "title": "Build a quantum computer @ home - Hacker style "
    }
  ]
}