{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10935.html",
  "id": 10935,
  "guid": "43a6348b-a644-49c3-95e6-0b3be36f74ed",
  "logo": null,
  "date": "2019-12-29T23:50:00+01:00",
  "start": "23:50",
  "duration": "00:40",
  "room": "Ada",
  "slug": "36c3-10935-aus_dem_schimpfworterbuch_der_neuen_rechten",
  "title": "Aus dem Schimpfwörterbuch der neuen Rechten",
  "subtitle": "",
  "track": "Science",
  "type": "lecture",
  "language": "de",
  "abstract": "Der Vortrag gibt auf der Basis umfangreicher korpuslinguistischer Analysen einen Überblick über den Fundus herabwürdigender und ausgrenzender Ausdrücke, die in rechten und rechtsextremen Onlinediskursen geprägt wurden. In den tiefensemantischen Strukturen des invektiven Wortschatzes der neuen Rechten wird ein stark schematisiertes Weltbild sichtbar, das von der grundlegenden Verachtung nicht nur des Fremden, sondern auch des eigenen Landes, seiner Institutionen, seiner Werte und seiner Bevölkerung geprägt ist. ",
  "description": "Das gesteigerte Maß an Ausgrenzung und gesellschaftlicher Polarisierung, das seit dem Wiedererstarken rechter Parteien und Denkweisen in Deutschland zu verzeichnen ist, ist nicht die einzige Errungenschaft, die wir den neuen Rechten zu verdanken haben. Sie haben auch den Wortschatz um ein schier unerschöpfliches Repertoire an Schimpfwörtern bereichert. Deren Spektrum reicht von unüblichen Verknüpfungen von Wortbestandteilen wie bei \"Journhalunke\" oder \"GEZStapo\", über die produktive Verfremdung von Eigennamen wie im Fall von \"K(r)amp(f)-K(n)arrenbauer\" oder \"Merkill\", Hyperbolisierungen wie \"Superübergutbestmenschen\" oder Satzkomposita wie \"IchseheauswieeinkonservativerCSUKatholikundwerdedeshalbvondenganzenDeppengewähltweildasjanichtsoeinGrünerist\" (Winfried Kretschmann) bis hin zu Gleichsetzungen zur Denunziation von Kritik wie in \"Waffen=Rassismus=rächtz=Nazi=Gefahr=Erderwärmung\". \r\n\r\nIm Vortrag sollen zunächst die wichtigsten sprachlichen Strategien zur Bildung herabwürdigender Ausdrücke vorgestellt werden, ehe in einem zweiten Schritt der invektive Wortschatz zu einzelnen Politik- und Gesellschaftsbereichen in Auswahl präsentiert wird. Basis der Untersuchung bildet eine umfangreiche korpuslinguistische Analyse einschlägiger rechter und rechtsextremer \"Nachrichten\"-Seiten, Blogs, Kommentarspalten und Foren aus den Jahren von 2012 bis 2019, die mehr als 25.000 Schimpfwörter zutage färderte.\r\n\r\nDer Vortrag will nicht nur das Offensichtliche zeigen: Dass für die neuen Rechten herabwürdigendes und ausgrenzenden Sprechen zentrales Medium der politischen Auseinandersetzung ist. Vielmehr wird in den vielfältigen Formen herabwürdigenden Sprechens ein Weltbild sichtbar, das von wenigen Grundunterscheidungen geprägt ist. Auch wird sich zeigen, dass die neuen Rechten sich als eine Schmähgemeinschaft konstituieren und das Land, in dem sie leben, seine Bürger_innen und seine Institutionen nachhaltig verachten. \r\n",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 4168,
      "public_name": "josch"
    }
  ],
  "links": [],
  "attachments": []
}