{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Lineup/events/11258.html",
  "id": 11258,
  "guid": "45031df5-2dda-4e28-bfd9-3622b9552ac8",
  "logo": null,
  "date": "2019-12-28T16:00:00+01:00",
  "start": "16:00",
  "duration": "01:00",
  "room": "Discotheque Nouveauancien",
  "slug": "36c3-abfahrplan-11258-chaos_ballet",
  "title": "Chaos Ballet",
  "subtitle": "",
  "track": "Music",
  "type": "performance",
  "language": "en",
  "abstract": "We* dance against K.I.. With one another. For each other. Against Artificial Intelligence and structures that are increasingly forcing the artistic and creative onto pathways of the consumable and for a matriarchal society in which caring and creating opportunities for others structure the community.",
  "description": "Recognizing and promoting creative processes is the challenge of a future society. How can this be done quite differently than ever before?\r\nWhat can a liberating interpretation of intellectual property look like?\r\n\r\nWhat is there the relation to existing accesses to and the distribution of (natural) ressources? How do we image self-organized technical and social infrastructures of tomorrow and the day after tomorrow, and how do we bring them to life? What form should negotion processes between individual, collective, institutional and privat economical bodies take on for this? Between the rigorous form of ballet and the unpredictability of chaos the Chaos Ballett creates possible scenarios for the future. For example automated logging of altruism by technically recording and evaluating somatic processes. Interactions and responses are captured, made exploitable and recognizable with blockchain-based contracts. Whatever doesn’t exist either has yet to be or never will.\r\n\r\nWhat we don't solve with each other, we won't solve for society.\r\n\r\nStory by: Sina Kamala Kaufmann\r\n\r\nMusic by: Thomas Liebkose & Fabian Rack feat. Kabel Trace\r\n\r\nChaos Ensemble: Margarida Isabel de Abreu Neto, Lena Fritsch u.a.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [],
  "links": [],
  "attachments": []
}