{
  "id": 1410,
  "guid": "45e43062-1c89-4ede-ba23-babdfbe29294",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Knitting_workshop_(Strick-_und_H%C3%A4kelworkshop)",
  "logo": null,
  "date": "2019-12-28T12:50:00+01:00",
  "start": "12:50",
  "duration": "2:10",
  "room": "Assembly:Pseudoroom",
  "slug": "36c3-1410-session_knitting_workshop_strick_und_haekelworkshop_",
  "title": "Knitting workshop (Strick- und Häkelworkshop)",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "hands-on",
  "language": "de",
  "abstract": "",
  "description": "Learn how to knit/how to crochet. Lerne stricken/häkeln.\nWe'll be sitting at the water basin/palm tree at the bottom of the CCL building and do a bit of knitting/crocheting. We're happy about any co-knitters joining us, and we'll teach you how it works in case you don't know. :-)If you could bring a knitting needle and wool on your own, that would be perfect; but fear not, we have a limited supply which we'll gladly share with you. In this case, it would be nice if you could reimburse us on our costs, but no worries if that's not possible.A nice project for a beginner is an oven cloth or a phone case. Then you can later progress to gloves. :-)Wir werden bei der Palme/dem Wasserbecken ganz unten im CCL-Gebäude sitzen und etwas vor uns her stricken. Wir freuen uns über alle, die ebenfalls stricken möchten, und bringen es euch bei, falls ihr noch nicht wisst, wie es geht. :-)Es wäre super, wenn ihr eine eigene Stricknadel und Wolle mitbringen könnten; aber wir haben auch gerne unseren Vorrat mit euch teilen. In diesem Fall wäre es lieb, wenn ihr uns die Materialkosten erstatten könntet, aber stresst euch nicht wenn das nicht geht.Ein schönes Einstiegsproekt sind Topflappen und Handyhüllen. Später könnt ihr euch an Handschuhen versuchen!",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Iblech",
      "public_name": "Iblech"
    }
  ],
  "links": []
}