{
  "id": 869,
  "guid": "46d899a1-4661-5459-9dac-2029ee608876",
  "logo": "/media/36c3/images/7HBPE9/4_pzJpwE.jpeg",
  "date": "2019-12-29T23:30:00+01:00",
  "start": "23:30",
  "duration": "00:18",
  "room": "cinopolis",
  "slug": "7HBPE9",
  "url": "https://talks.komona.org/36c3/talk/7HBPE9/",
  "title": "100.000 hats",
  "subtitle": "",
  "track": null,
  "type": "Movie",
  "language": "en",
  "abstract": "A young generation looking for something real and for theirselves. 16mm celluloid hitchhiking film.\r\n\r\nGerman:\r\nAufbruchsstimmung. Eine junge Generation auf der Suche nach etwas Echtem und auf der Suche nach sich selbst. Wie auch damals die 68er Generation.\r\nDoch jetzt steht der Wunsch Auszubrechen im Spannungsverhältnis mit Erwartungen nach Spontanität und Flexibilität, als gewünschte Fähigkeiten einer neoliberalen Arbeitswelt. Drei Filmstudenten trampen mit leichtem Gepäck und 16mm Arriflex Kamera ans Mittelmeer, um dort einen Film zu drehen.\r\n\r\nNarrative von glücklichen Selbstfindungsreisen bestimmen unsere Bild- und Gefühlswelt. In dieser Suche nach etwas \"Echten\" zeigt sich ein Streben danach, solche Bilder und Gefühlswelten zu reproduzieren. Die Suche nach sich selbst wird zum Versuch, sich ein Narrativ mit möglichst großen Erfolgschancen zu erzeugen. Die Menschen und ihre Erfahrungen werden dabei selbst zur Ware.\r\n\r\nDie in diesen Narrativen erzeugten Atmospären und Bilder treffen immer wieder auf Momente des Scheiterns. Das 16mm Filmmaterial trifft zusammen mit digitalen Aufnahmen von handheld Kamera und Smartphone und bewegt sich zwischen den Möglichkeiten dieser verschiedenen Produktionsmittel, \"echte\" Momente festzuhalten.\r\n\r\nIn einem selbstironisch, performativen Ansatz begeben sich die drei Filmstudenten selbst vor die Kamera. Sie folgen dem jungen Reisefilm-Narrativ und stellen sich selbst diesen Erwartungen. Die Spannung zwischen Erfahrungen und Bildproduktion offenbart die Fragilität dieser Subjekte und des Narrativs, dem sie folgen.",
  "description": "",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 66,
      "code": "HZPKUK",
      "public_name": "bund",
      "biography": "DECT: 7787",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}