{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Lineup/events/11273.html",
  "id": 11273,
  "guid": "474721f3-54a2-4717-9e0d-ce3fcdffc9aa",
  "logo": "/system/events/logos/000/011/273/large/Dave-Dinger-03-1030x687.jpg?1577205680",
  "date": "2019-12-29T23:00:00+01:00",
  "start": "23:00",
  "duration": "02:00",
  "room": "Discotheque Nouveauancien",
  "slug": "36c3-abfahrplan-11273-dave_dinger",
  "title": "Dave Dinger",
  "subtitle": "",
  "track": "Music",
  "type": "djset",
  "language": "en",
  "abstract": "",
  "description": "Dave Dinger began his illustrious career in Berlins legendary Bar25 in his own, very special way. There, he didn’t just play music, but actually built the DJ booths where the music was played from. This unique blend of passion for music and intrigue in aesthetic concepts has driven him through the mesmerising Berlin underground since the end of the '90s.\r\nDave is personalizing his workspace as a DJ according to his interpretation of what electronic music culture is all about. There is a certain warmth, honesty and depth throughout his work that transcends through both his musicality and his design treatments. As a core member of Berlins famous Bachstelzen Collective, he was one of the founders who blueprinted what got to be known as the typical Berlin style – an architecture of social, musical and aesthetic concepts.Using chaotic, wild and organic scrap wood in his constructions were his distinctive signature well before the term ‘up-cycling‘ became hip. Bar25, the Katerholzig club and the Bachstelzen floor at Fusion Festival were prototypes of this time.\r\n\r\nHis recent works contain a more polarising focus; a love for minimalistic abstract geometry, and years of experience in project management. Nothing shows this development in a greater way than Garbicz Festival — whose natural, albeit utopian habitat has become a homebase for both his music and his design aesthetics. An invitation to create the celebrated Turmbühne Stage at Fusion Festival’s 20th anniversary along with a coveted gig on the stage marked a milestone for both of his careers. For Dave, spacial design and sound are tools for installing an arena for unconventional social interactions. A sphere where common aesthetics are to be challenged and will change therefore constantly.\r\n\r\nHis residency in KaterBlau helped him to build up his reputation as a DJ and to grow into the international realm. In the last years he has worked and played in Australia, New Zealand, India and all around Europe. There is a saying that ‘To talk about music, is like dancing to architecture’ Dave Dinger takes the latter part as a challenge. So let his music speak for itself — and dance to both. ",
  "recording_license": "",
  "do_not_record": false,
  "persons": [],
  "links": [
    {
      "url": "https://soundcloud.com/dave-dinger",
      "title": "Dave Dinger on Soundcloud"
    }
  ],
  "attachments": []
}