{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Lineup/events/11270.html",
  "id": 11270,
  "guid": "475835c4-e5b6-4bd0-ab24-367c193fea84",
  "logo": "/system/events/logos/000/011/270/large/liasahin.jpg?1577203414",
  "date": "2019-12-29T00:00:00+01:00",
  "start": "00:00",
  "duration": "02:00",
  "room": "Uptown",
  "slug": "36c3-abfahrplan-11270-lia_sahin_live",
  "title": "Lia Sahin LIVE",
  "subtitle": "Beatboxing",
  "track": "Music",
  "type": "concert",
  "language": "en",
  "abstract": "Die übliche beatboxende rothaarige deutsche transgender Frau mit türkischem Migrationsvordergrund, digga.",
  "description": "Lia Şahin bricht mit ihrer Art und Weise viele Gedanken und musikalische Grenzen auf.\r\nSie arbeitet seit 7 Jahren hauptberuflich als freischaffende Künstlerin und hoppst zwischen feministischen Veranstaltungen, HipHop Open Mic´s, Electro Festival´s, Keynote Präsentationen und interaktiven Trommelevents hin und her und ist leidenschaftlich ein fester Bestandteil von Rap for Refugees e.V als Beatbox Coach und kreative Leitung. \r\nÜber 1000 Gigs & Events hat sie innerhalb der letzten Jahre mit namhaften Vertretern einiger Branchen und Genre-Größen durchgeführt. \r\nAls leidenschaftliche Gamerin und Technik- affiner Mensch liebt sie die Kombination aus  natürlicher Stimme und alles was einem neue Technologien ermöglichen um ein neues Stimmbild zu generieren und Sounds zu erstellen. \r\n2017 spielte sie erfolgreich auf dutzenden Festivals und unterhielt die Menge stundenlang mit lediglich einer Loopstation App auf dem Iphone und einem Mikrofon. \r\nNach ihrem Coming-Out beschloss sie ihre Fähigkeiten außerhalb ihrer eigenen Selbstverwirklichung weiter zu geben in der Kinder und Jugendsozialarbeit sowie im feministischen und politischem Kontext.\r\nSie produziert, sie singt, sie rappt, sie beatboxt und macht sich gerne über unsere Gesellschaft lustig und das mit Herz. ",
  "recording_license": "",
  "do_not_record": false,
  "persons": [],
  "links": [
    {
      "url": "http://www.liasahin.com/",
      "title": "Lia Sahim Homepage"
    }
  ],
  "attachments": []
}