{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10994.html",
  "id": 10994,
  "guid": "47606612-c3c3-4a07-a2f5-fee3c83a6ddb",
  "logo": "/system/events/logos/000/010/994/large/sea_watch-logo-1024.png?1572102375",
  "date": "2019-12-28T18:10:00+01:00",
  "start": "18:10",
  "duration": "00:40",
  "room": "Eliza",
  "slug": "36c3-10994-no_roborders_no_nation_or_smile_for_a_european_surveillance_propagation",
  "title": "No roborders, no nation, or: smile for a European surveillance propagation",
  "subtitle": "How an agency implements Fortress Europe by degrading Non-Europeans to second-rate people",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "en",
  "abstract": "Robots, Satellites and biometrical traps - more than a Billion Euro will be spent in 2021 for what they call \"Border Security.\" The European Border and Coastguard, formerly Frontex, dreams of a fully automomus border surveillance system.",
  "description": "As a humanitarian & human rights organisation involved in sea rescue, we recognise however that the shift towards new technologies correlates with a shift away from basic human rights standards. The robots, satellites & co. are not used to make society safer & life easier but to spy on us and to deport people to torture in Libya.\r\n\r\nAt Sea-Watch e.V. we are involved in a non-profit initiative dedicated to the civilian rescue of refugees at sea. In view of the humanitarian disaster on the Mediterranean Sea-Watch provides emergency aid, demands and forces at the same time the rescue by the responsible European institutions and stands publicly for legal escape routes and open borders. We are politically and religiously independent and finance ourselves exclusively through donations.\r\n\r\nAt sea, we formerly cooperated with Frontex ships in rescues when they were still involved in live saving operations. Now we regularly observe them actually being involved in illegal refoulements, especially with our surveillance aircraft Moonbird.\r\n\r\nFrontex was formerly an agency that advised governments on border control and did risk assessments on border crossings, it had basically a coordinating role within the European framework. They were called \"European Agency for the Management of Operational Cooperation at the External Borders\". In 2016, during the so-called refugee crisis, the European Commission proposed to strengthen them and they became the European Border and Coast Guard Agency.\r\n\r\nFrontex is working and developing satellite observation, the development of drone capabilities and other surveillance technologies like IMSI-Catchers with the help of European universities and companies like EADS and esri. All this happens right now without a lot of public or transparency from the site of the agency. While they provide national authorities with equipment and justify their yearly growing budget with out border security there are no sources to measure the effectivity of their methods.\r\n\r\nWhile they present themselves as the friendly boarderguard next door it has evolved into an engency which is developing capabilities in all kinds of surveillance technologies with pilot projects which sound like they are taken out of a science fiction movie:\r\n\r\nSMILE\r\n\"SMILE proposes a novel mobility concept, using privacy by design principles, that will enable low cost secure exchange and processing of biometric data, addressing in parallel the aforementioned challenges by designing, implementing and evaluating in relevant environments (TRL6) prototype management architecture, for the accurate verification, automated control, monitoring and optimization of people’ flows at Land Border Infrastructures.\"\r\n    \r\nRoborder\r\n\"ROBORDER aims at developing and demonstrating a fully-functional autonomous border surveillance system with unmanned mobile robots including aerial, water surface, underwater and ground vehicles, capable of functioning both as standalone and in swarms, which will incorporate multimodal sensors as part of an interoperable network.\"\r\nhttp://btn.frontex.europa.eu/projects/external/roborder    \r\n    \r\niBorderCtrl\r\n\"iBorderCtrl envisages to enable faster thorough border control for third country nationals crossing the borders of EU, with technologies that adopt the future development of the Schengen Border Management.\r\nThe project will present an optimal mixture of an enhanced, voluntary form of a Registered Traveller Programme and an auxiliary solution for the Entry/Exit System based on involving bona fide travellers\"\r\nhttp://btn.frontex.europa.eu/projects/external/iborderctrl\r\n\r\nWhile the people in charge do not manage to organize a proper search- and rescue program, Europe is setting up and spending more and more on a massive surveillance agency for border protection which has a big focus in surveillance and \"protecting\" the European external borders while no one ever evaluated the effectivity of this massive border militarization.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9703,
      "public_name": "alina"
    },
    {
      "id": 9375,
      "public_name": "niczem"
    }
  ],
  "links": [
    {
      "url": "https://www.youtube.com/watch?v=q2O4Dx16td8",
      "title": "Esri EUC 2014 Plenary - Tackling Illegal Migration and Cross Border Crime by Smart Technology"
    }
  ],
  "attachments": []
}