{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10751.html",
  "id": 10751,
  "guid": "4799e975-6a42-4570-a637-84b0bfa47bd7",
  "logo": "/system/events/logos/000/010/751/large/1R3VdhcVj7Cn3eykkqSs%28%E5%B7%B2%E5%8E%BB%E5%BA%95%29.jpg?1576641244",
  "date": "2019-12-28T19:10:00+01:00",
  "start": "19:10",
  "duration": "00:40",
  "room": "Clarke",
  "slug": "36c3-10751-the_inside_story_there_are_apps_in_apps_and_here_is_how_to_break_them",
  "title": "The Inside Story: There are Apps in Apps and Here is How to Break Them",
  "subtitle": "Break Isolation and Sandbox in the Instant Apps",
  "track": "Security",
  "type": "lecture",
  "language": "en",
  "abstract": "With the rapid development of mobile internet, apps become more and more complex. However, their most used functions are limited to a few pages.\r\n\r\nEnters instant app. It has many advantages over normal apps, such as click-to-play and concise design, and it's becoming more and more popular. There is some form of instant app framework in many popular apps, such as Google Play, TikTok, etc. In addition, many phone vendors have also embedded instant app frameworks in their pre-installed applications.\r\n\r\nHowever, there is barely any public research on attacking instant apps.",
  "description": "In this talk, we will dive into a common architecture of instant app framework, and demonstrate attack models for it. Based on these attack models, we have reverse engineered top instant app frameworks. We will show how to bypass various kinds of sandboxing and restriction technologies to break isolations between instant apps.\r\n\r\nThese vulnerabilities could lead to sensitive information leakage, identity theft, account takeover and other severe consequences. During the study of Google Instant app, we also bypassed component access restrictions, which greatly expands attack surface.\r\n\r\nThese vulnerabilities and attack models affects more than 60% of Android devices and at least 1 billion users.\r\n\r\nFinally, we summarize the root causes of these vulnerabilities at the architectural level and point out the potential attack points. We will also propose practical mitigation measures for specific vulnerabilities. \r\n\r\nWe hope we could make users and developers aware of the potential security risks while enjoying the convenience of instant apps. We also hope to make security community aware of this emerging new attack surface.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9557,
      "public_name": "RonnyXing"
    }
  ],
  "links": [],
  "attachments": []
}