{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Lineup/events/11245.html",
  "id": 11245,
  "guid": "49d22f04-78c1-4a4e-86cb-5ebc845e65d7",
  "logo": "/system/events/logos/000/011/245/large/olia.jpg?1576593351",
  "date": "2019-12-28T03:00:00+01:00",
  "start": "03:00",
  "duration": "01:00",
  "room": "Discotheque Nouveauancien",
  "slug": "36c3-abfahrplan-11245-oliotronix",
  "title": "Oliotronix",
  "subtitle": "Game Boy live!",
  "track": "Music",
  "type": "concert",
  "language": "en",
  "abstract": "DJ X LIVE ACT performing a rollercoaster of dancy, ravy and glitchy tunes, spiced with unexpected voice/samples/drops and occasional bent toys bringing some improvised fun challenges to herself and sometimes the audience :)",
  "description": "\"I had the pleasure to met Oliotronix in Denmark at the Chipwrecked Festival.\r\nHer set was one of my favorite, a blazing mix of chiptune, circuitbending and DIY culture delivered right on your face as a mega banging rave.\r\nI was blown away when I discovered she was improvising!\r\nCheck it out and follow her FB page and check for her live performances around Europe!\" (IANO, iano.bandcamp.com)\r\n\r\nSince 2017 her new music setup has taken shape in form of energetic performances using Gameboy DMG and various electronic noise machines still combined with an hooligan/techno/electro/rave/core DJ set. Feedback from the audience:\r\n1. “What is exciting about DJ Oliotronix is she doesn't follow the trend but deliver crazy sets following her own taste while keeping it entertaining on a high level of intensity. Prepare to have fun!“ Madame Claude, Berlin\r\n2. “Very original and eclectic, with interesting non-standard use of equipment!” Galaxy Wolf, London\r\n2. “Great! Good energy and selection. Nice to see DJs enjoying themselves too!”  Crux, London“",
  "recording_license": "",
  "do_not_record": false,
  "persons": [],
  "links": [
    {
      "url": "https://soundcloud.com/oliotronix",
      "title": "Oliotronix on Soundcloud"
    }
  ],
  "attachments": []
}