{
  "id": 4136,
  "guid": "4b67d2ca-491f-525e-86c4-4e24312e7d1e",
  "logo": "/media/36c3/images/9QUK7W/Was_kostet_die_Welt__web_Kd5mOf4.jpg",
  "date": "2019-12-28T16:30:00+01:00",
  "start": "16:30",
  "duration": "01:31",
  "room": "Art-and-Play Stage",
  "slug": "9QUK7W",
  "url": "https://stage.artesmobiles.art/36c3/talk/9QUK7W/",
  "title": "THE PRICE OF PARADISE 2018 (Original Title: WAS KOSTET DIE WELT)",
  "subtitle": "",
  "track": "Screening",
  "type": "Screening",
  "language": "en",
  "abstract": "documentary, 2018, 91:00 min + Q&A, english language",
  "description": "Until 2008, the Channel Island of Sark, located to the west of Normandy, was the last feudalistic spot in Europe. A royal fief, it sometimes looks exactly like people imagine a cosy English idyll: steep cliffs, green meadows, woolly sheep, low little houses and breast high overgrown stone walls. The around 600 island dwellers who elect their own parliament and have their own laws have lived according to autonomous rules and ideas of communitiy, property and right for centuries. \r\n\r\nBut these tradition was smashed abruptly, when two billionaire brothers began to buy the island piece by piece and take legal action against the laws and Acts of the Sark Parliament. What started with legal disputes soon continued with campaigns and scenarios of different origin, which islanders perceive as slander, threat and blackmail. Sark became the scene of a positively absurd media and financial conflict, and a conflict of power. \r\n\r\nHer offscreen voice sometimes questioning, partly sober and partly emotional, Bettina Borgfeld recapitulates the development and course of an incredible dispute in the age of global financial capitalism - a dispute that occasionally sounds like the plot of a Netflix series. \r\n\r\nQuelle: DOK Leipzig/Lukas Stern\r\n\r\n**Director** Bettina Borgfeld\r\n**Producer** Thomas Tielsch\r\n**Director of Photography** Börres Weiffenbach, Bettina Borgfeld\r\n**Editor** Franziska von Berlepsch, Mechthild Barth\r\n**Sound** Ulla Kösterke, Oliver Stahn, Johannes Schmelzer-Ziringer, Moritz Jonas Springer\r\n**Score** Daniel Sus, Peter Gabriel Byrne\r\n\r\n**Awards**\r\nWinner of DOK Buster – 61 DOK Leipzig 2018\r\nNominated for German Documentary Award 2019 – SWR DOKU FESTIVAL",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 28,
      "code": "QZBPQ9",
      "public_name": "Bettina Borgfeld",
      "biography": null,
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}