{
  "id": 4136,
  "guid": "4b67d2ca-491f-525e-86c4-4e24312e7d1e",
  "logo": "/media/36c3/images/9QUK7W/Was_kostet_die_Welt__web_Kd5mOf4.jpg",
  "date": "2019-12-28T16:30:00+01:00",
  "start": "16:30",
  "duration": "01:31",
  "room": "Art-and-Play Stage",
  "slug": "9QUK7W",
  "url": "https://stage.artesmobiles.art/36c3/talk/9QUK7W/",
  "title": "THE PRICE OF PARADISE 2018 (Original Title: WAS KOSTET DIE WELT)",
  "subtitle": "",
  "track": "Screening",
  "type": "Screening",
  "language": "en",
  "abstract": "documentary, 2018, 91:00 min + Q&A, english language",
  "description": "The island of Sark, situated off the coast of Normandy, was Europe‘s last feudal state, and a British Crown possession. The 600 inhabitants used to live their lives at their own discretion, and in harmony with their surroundings. Life was simple and regulated by gentleman’s agreement rather than by law. However, in the past years a new authority has infiltrated the island. Two billionaires began buying up the island, laying out vineyards and buying four of the six hotels. By now they hold leases on a third of the land. The island’s parliament is trying to counter these acts. However the investors are able to employ their considerable wealth to pull out all the stops. What begins as a unified response by the islanders, develops into an internal conflict, splitting the community into rival factions. Some residents see the developments as an opportunity to attain new prosperity. But are they aware of the real interests behind the investors’ plans to modernize? By following the development of this conflict, the film sheds light on the politics of international finance capital and poses not only fundamental questions about responsibility and democracy, but also about what it is that makes life worth living.\r\n\r\n**Director** Bettina Borgfeld\r\n**Producer** Thomas Tielsch\r\n**Director of Photography** Börres Weiffenbach, Bettina Borgfeld\r\n**Editor** Franziska von Berlepsch, Mechthild Barth\r\n**Sound** Ulla Kösterke, Oliver Stahn, Johannes Schmelzer-Ziringer, Moritz Jonas Springer\r\n**Score** Daniel Sus, Peter Gabriel Byrne\r\n\r\n**Awards**\r\nWinner of DOK Buster – 61 DOK Leipzig 2018\r\nNominated for German Documentary Award 2019 – SWR DOKU FESTIVAL",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 28,
      "code": "QZBPQ9",
      "public_name": "Bettina Borgfeld",
      "biography": null,
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}