{
  "id": 248,
  "guid": "4b80f175-0c42-53e6-911d-2445cc25fd59",
  "logo": "",
  "date": "2019-12-29T17:00:00+01:00",
  "start": "17:00",
  "duration": "00:50",
  "room": "Chaos-West Bühne",
  "slug": "R33ZSA",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/R33ZSA/",
  "title": "Sexualisierter Gewalt und die Verantwortung von Gesellschaft und Communities",
  "subtitle": "",
  "track": "Nicht Computers",
  "type": "Doppelter Slot",
  "language": "de",
  "abstract": null,
  "description": "Sexualisierte Gewalt ist Alltag in Deutschland. Leider. „Laut einer deutschlandweiten Repräsentativstudie erlebt jede 7. Frau in Deutschland im Lauf ihres Lebens strafrechtlich relevante sexualisierte Gewalt. 60% aller Frauen in Deutschland haben sexuelle Belästigung erlebt.\" schreibt der Bundesverbands Frauenberatungsstellen und Frauennotrufe. \" Jährlich werden der Polizei 11.000 Fälle sexuellen Missbrauchs von Kindern bekannt. Die Dunkelziffer im Bereich sexualisierter Gewalt ist hoch.“ (https://www.frauen-gegen-gewalt.de/de/was-ist-das-187.html) Sexualisierte Gewalt geht in den seltensten Fällen von Fremden aus, meist wird sie durch Personen aus dem Bekannten- und Familienkreis ausgeübt.\r\nViel zu kurz kommt hingegen die Auseinandersetzung mit dieser Thematik, mit den Folgen für Betroffene, Möglichkeiten der Prävention und der Unterstützung von Betroffenen. Auf gesellschaftlicher Ebene, aber auch in Communities. Das Ausmaß sexualisierter Gewalt ist seit Jahrzehnten unverändert. Sexualisierte Gewalt ist nach wie vor ein Tabuthema - und das macht es so schwierig, etwas zu verändern. Es ist wichtig, das Schweigen zu durchbrechen und Betroffenen* Angebote zur Unterstützung zu machen. Hier stehen wir alle in der Verantwortung, auch in der Chaos-Community.\r\nIndem wir eine Atmosphäre schaffen, in der über Erfahrungen mit sexualisierter Gewalt geredet werden kann, können wir Betroffene in der Bearbeitung unterstützenund insgesamt zur Sensibilisierung beitragen. Gruppen zur Unterstützung Betroffener und Awarenessgruppen sind eine Möglichkeit, um Betroffene von sexualisierter Gewalt zu stärken und ein Bewusstsein für Veränderung zu schaffen. Professionelle Organisationen klären auf, beraten und begleiten Betroffene.  \r\nHacken ist nicht ausschließlich eine technische, sondern auch eine politische und soziale Aktion und ebenso eine interaktive Handlung. Lasst uns die Tabuisierung des Themas sexualisierte Gewalt hacken und zusammen daran arbeiten, unsere Community zu einem besseren Ort zu machen.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 192,
      "code": "REJYAY",
      "public_name": "Ann",
      "biography": "Ann Wiesental ist Autorin des Buches \"Antisexistische Awareness: Ein Handbuch\", Unrast Verlag und Mitautortin des Buches \"Was tun bei sexualisierter Gewalt?\" Handbuch für eine Transformative Arbeit mit gewaltausübenden Personen, RESPONS, Unrast Verlag\r\nSie hat verschiedene Awarenessgruppen mitgegründet und macht seit Jahren Unterstützungsarbeit auf großen Festivals, auf Partys und begleitet Betroffene* über einen längeren Zeitraum.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}