{
  "id": 824,
  "guid": "4c7c2b8e-05ab-5ed5-877a-a4a071a81f36",
  "logo": "",
  "date": "2019-12-27T09:55:00+00:00",
  "start": "09:55",
  "duration": "01:00",
  "room": "Dome 1",
  "slug": "M33RM9",
  "url": "https://talks.komona.org/36c3/talk/M33RM9/",
  "title": "Fashion Hacktivism - House of All / Conscious Fashion - Common Sense",
  "subtitle": "",
  "track": null,
  "type": "Session",
  "language": "en",
  "abstract": "So what's this thing about conscious fashion? What does it actually mean? And why do we need fashion anyways?In this session I share thoughts on above questions and how we could hack the current fashion system if we shifted the mind set and get conscious...Part of the session is again an experiment for research that involves you.",
  "description": "So what's this thing about conscious fashion? What does it actually mean? And why do we need fashion anyways? As part of my research I dive into New Materialism, Singularity, Phaenomology and in this session I share thoughts on above questions and how we could hack the current fashion system if we shifted the mind set and get conscious...Part of the session is again an experiment for research that involves you.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 30,
      "code": "UF97ME",
      "public_name": "Sarah Bürger",
      "biography": "How do we cope with singularity? What is the value of things & what is their role in our relationships? How can we design futures that involve everybody and be gentle to all & everything there is...these are some of the questions that drive me whilst working in my favorite field of cloth. I research ways of hacking the fashion system and strive for a decentralized system of garment use. Mission: Beautifully crafted sustainable cloth to everyone - no to capitalism. Vision: Clothes Commons, Collaborative Fashion System, Decentralized Production, No Work.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}