{
  "id": 1712,
  "guid": "4cb31da7-7b42-403f-af33-6777796f48bb",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Google-sensei_und_Leiharbeit_-_IT_in_Japan_(Zugabe)",
  "logo": null,
  "date": "2019-12-30T00:30:00+01:00",
  "start": "00:30",
  "duration": "1:00",
  "room": "Lecture room M1",
  "slug": "36c3-1712-session_google_sensei_und_leiharbeit_it_in_japan_zugabe_",
  "title": "Google-sensei und Leiharbeit - IT in Japan (Zugabe)",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "talk",
  "language": "de",
  "abstract": "",
  "description": "Japan ist neben vielen Dingen auch als Land der Technik bekannt. Vor allem Games aller Art und Hardware aus Japan sind weltweit verbreitet, aber kennt irgendwer gute japanische Software? Wie IT in Japan von innen aussieht, und ob das Land wirklich so hightech ist wie man vielleicht denken mag, berichtet eine zurückgekehrte Deutsche.\n'''DAS IST GENAU DER GLEICHE TALK WIE HEUTE FRUEH, nur nochmal, da es viele Personen gab, die leider keinen Platz mehr hatten.'''Ich bin nach abgeschlossenem Japanologie-Studium nach Japan gegangen und bin komplett fachfremd in der IT gelandet. Meine anfängliche Euphorie zum Engineer (\"Enjinia\") ausgebildet zu werden ist schnell der Realität aus sturem Auswendiglernen, E-Mails, die zu 70% aus Floskeln bestehen, und dem Erlernen von förmlich korrektem Austausch von Visitenkarten gewichen. Inmitten von allerlei Kuriositäten durfte ich aber auch für mich sehr wertvolle Erfahrungen machen, wie etwa die Teilnahme als STM (\"Shownet Team Member\") für das ShowNet, eine große Präsentation von bleeding-edge Netzwerk-Technologie auf der Interop Tokyo (https://www.interop.jp/shownet/?lang=en). Von April 2017 bis Juni 2019 habe ich nun also die IT-Welt in Japan hautnah erlebt und kann einiges berichten. Ich würde neben der ein oder anderen Kurisoität (z.B. dass der Minister für Cyber-Security nicht weiß, wie man einen USB-Stick benutzt (https://www.theguardian.com/world/2018/nov/15/japan-cyber-security-ministernever-used-computer-yoshitaka-sakurada)) über grundlegendere Probleme (z.B. Bildungssystem, mangelnde Englisch-Kenntnisse) und wie damit umgegangen wird (z.B. viele Meetups und Communities) erzählen. Der Talk ist also weniger technisch als mehr erzählerisch gedacht. Als Zielgruppe sehe ich Leute, die Interesse an Japan als Land haben und Leute, die geschäftlich mit japanischen Firmen zu tun haben oder dies in Erwägung ziehen.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Mona144",
      "public_name": "Mona144"
    }
  ],
  "links": []
}