{
  "id": 214,
  "guid": "4f4901d9-d5fa-594d-b367-532933de3d02",
  "logo": "/media/36c3/images/S9XFSM/digitalcourage_vds_banner.jpg",
  "date": "2019-12-29T12:00:00+01:00",
  "start": "12:00",
  "duration": "00:50",
  "room": "Chaos-West Bühne",
  "slug": "S9XFSM",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/S9XFSM/",
  "title": "Achtung Vorratsdatenspeicherung: Es wird ernst",
  "subtitle": "",
  "track": "Nicht Computers",
  "type": "Doppelter Slot",
  "language": "de",
  "abstract": null,
  "description": "Untertitel:\r\n\r\nWie Europol und die Innenminister der EU-Länder Massenüberwachung legalisieren wollen und was dagegen zu tun ist.\r\n\r\n–– \r\n\r\nZusammenfassung:\r\n\r\nTrotz klarer Gerichtsurteile gegen anlasslose Massenüberwachung wird in Arbeitsgruppen, Ausschüssen und Spezialgerichten an neuen Rechtsgrundlagen für eine EU-weite Vorratsdatenspeicherung gearbeitet. Es geht um Hintertüren in der ePrivacy-Verordnung, einen Fahrplan von EU-Rat und EU-Kommission, ein Überwachungskonzept von Europol und Versuche, den EU-Gerichtshof zu einer Revidierung vorheriger, grundrechtefreundlicher Urteile zu bewegen, während zur selben Zeit in Deutschland die CDU den Terror-Angriff von Halle/Saale instrumentalisiert.\r\n\r\n––\r\n\r\nAusführliche Beschreibung:\r\n\r\nIn diesem Vortrag möchte ich erklären, wie sogenannte Sicherheitspolitiker auf drei Ebenen an mehreren neuen Rechtsgrundlagen für die massenhafte und anlasslose Überwachung unserer Kommunikations- und Aktivitätsdaten arbeiten. In diesem Zusammenhang möchte ich die Reaktion der deutschen CDU auf den Terror-Angriff in Halle/Saale im Oktober diesen Jahres als geschichtsvergessen kritisieren.\r\n\r\nZum Referenten: Mein Name ist Friedemann Ebelt, ich arbeite seit fünf Jahren bei der deutschen Grundrechteorganisation Digitalcourage, die im Jahr 2006 eine Verfassungsbeschwerde gegen das deutsche Gesetz zur Vorratsdatenspeicherung eingereicht hat. Die Klage ist mit anderen Beschwerden anhängig beim Bundesverfassungsgericht, dessen Urteil eine EU-weite Signalwirkung haben wird.\r\n\r\nDigitalcourage beobachtet die aktuellen Überwachungsbestrebungen unter anderem mit Hilfe von Anfragen auf Grundlage des Informationsfreiheitsgesetzes, die wir auf fragdenstaat.de stellen. Was uns die Dokumente zeigen, ist aus unserer Sicht eine Kampagne für Vorratsdatenspeicherung, die auf drei Ebenen stattfindet:\r\n\r\n(1)\r\nIm geplanten EU-Gesetz zur ePrivacy-Verordnung wird über eine riesige Hintertür für eine private Vorratsdatenspeicherung verhandelt. Das ist absurd, denn das Ziel dieser Verordnung ist der Schutz sensibler Kommunikationsdaten. (Siehe Artikel 6 des Entwurfs einer ePrivacy-Verordnung)\r\n→ Mehr dazu:\r\nhttps://digitalcourage.de/blog/2019/eprivacy-private-vorratsdatenspeicherung-durch-hintertuer\r\n\r\n(2)\r\nEU-Rat und EU-Kommission haben einen Fahrplan für eine neue EU-weite Vorratsdatenspeicherung beschlossen. Die Hauptgefahr aus unserer Sicht ist, dass ausschließlich Vorschläge für anlasslose Massenüberwachung diskutiert werden, wie die Überwachungs-Matrix aus dem Europol Data Retention Matrix Workshops. \r\nIn einer 45-seitigen Tabelle breitet Europol aus, welche Daten sie für relevant für eine neue, EU-weite Vorratsdatenspeicherung halten. Von Standortdaten über IP-Adressen bis hin zu Verbindungsdaten sind nahezu sämtliche Informationen aufgeführt, die Provider demnach längerfristig speichern müssten. Diskutiert wird aber auch über die Speicherung der Länge von Antennen und über Klingeltöne.\r\nEs gibt keine Vorschläge für verhältnismäßige Optionen wie Quick Freeze, Sonderermittlungsdezernate oder ähnliches.\r\n→ Mehr dazu:\r\nhttps://digitalcourage.de/blog/2019/eu-vorratsdatenspeicherung-diese-daten-sollen-gespeichert-werden\r\nhttps://digitalcourage.de/blog/2019/beschraenkte-vorratsdatenspeicherung\r\n\r\n(3)\r\nMehrere EU-Mitgliedsstaaten verlangen vom EU-Gerichtshof eine Revidierung vorheriger, grundrechtefreundlicher Urteile. Anstatt die grundrechlichen Grenzen für Massenüberwachung zu akzeptieren, greifen die Regierungen der EU-Länder diese Grenzen an.\r\n→ Mehr dazu:\r\nhttps://digitalcourage.de/blog/2019/achtung-vorratsdatenspeicherung-es-wird-ernst\r\n\r\nIn Verbindung mit der geplanten E-Evidence-Verordnung, massiv verschärften Polizeigesetzen und dem derzeitigen Wettbewerb zur Einschränkung von Grundrechten, den sich die Regierungen der EU-Länder aktuell liefern, sind die Pläne für eine flächendeckende Vorratsdatenspeicherung als toxisch für Rechtsstaat und Demokratie zu bewerten.\r\nBezeichnend für eine grundrechtevergessene Politik sind die jüngsten Ereignisse in Deutschland:\r\n\r\nÜberwachung über Ethik: \r\nCDU in Deutschland nutzt den Terror von Halle/Saale \r\nNur einen Tag nach dem Terror-Angriff in Halle/Saale im Oktober diesen Jahres sagte CDU-Innenpolitiker Mathias Middelberg im Deutschlandfunk, dass gegen rechte Hetze im Internet und im Bildungssystem vorgegangen werden müsse. Konkret handeln er und seine Partei jedoch in eine ganz andere Richtung: Sie nutzen den rechten Terror, um Massenüberwachung voranzubringen. Zentral ist dabei die Vorratsdatenspeicherung. Geplant ist aber auch, den in die NSU-Morde verstrickten sogenannten Verfassungsschutzes mit mehr Befugnisse auszustatten sowie der Einsatz von Staatstrojanern, die für den Einsatz von Staatstrojanern benötigt werden.\r\n→ Mehr dazu: Hallo CDU: Vorratsdatenspeicherung und Verfassungsschutz sind nicht die Lösung \r\nhttps://digitalcourage.de/Blog/2019/hallo-cdu-vorratsdatenspeicherung-und-verfassungsschutz-sind-nicht-die-loesung\r\n\r\nMit unserer Kritik an dieser Politik, wenden wir uns an deutsche Parlamentarier und argumentieren: Eine anlasslose Vorratsdatenspeicherung erfasst alles – auch, wer wann in eine Synagoge, eine Moschee, in eine Kirche, in ein Gewerkschaftshaus oder auf eine Demonstration geht.  \r\nWir dürfen nicht vergessen, was schon einmal bitter gelernt wurde: Datensammlungen können tödlich sein. Eine Lehre aus den Verbrechen des deutschen Nationalsozialismus ist, dass die Bevölkerung vor Übergriffen des Staates geschützt werden muss. \r\nAus diesem Grund darf es in Deutschland keinen zentralen Katalog geben, in dem erfasst ist, wer welcher Religion angehört. Das selbe gilt für Parteimitgliedschaften oder die sexuelle Orientierung. Folglich darf es in Rechtsstaaten keine Vorratsdatenspeicherungen von Kommunikationsdaten geben.\r\nDie 1933 gewählte nationalsozialistische Regierung hat auf Vorrat gesammelte Daten genutzt, um gezielt Menschen zu verfolgen, zu inhaftieren und zu töten. Die technisch-organisatorische Grundlage für die systematische Vernichtung von Juden war eine umfangreiche  Datenverarbeitung von Informationen, die kein Staat über die Bürgerinnen und Bürger erfassen darf.\r\n\r\nDie Gefahr von Massenüberwachung lässt sich nicht beschränken\r\nEinschränkungen für den Zugriff auf Vorratsdaten, wie Richtervorbehalte oder minimal beschränkende Vorgaben für Maximal- und Mindestspeicherfristen können die Bevölkerung langfristig vor den Gefahren dieser Massenüberwachung nicht schützen. Denn Überwachungsgesetze werden stets verschärft, aber so gut wie nie zurückgefahren. Eine Partei, die diese Daten nutzen will, wird die Schutzschranken einreißen.\r\n\r\nGibt es auch gute Nachrichten?\r\nDank der existierenden Transparenzgesetze, engagierter Parlamentarier.innen und Aktivist.innen ist die aktuelle Kampagne für Massenüberwachung durchschaubar, ebenso die Ausnutzung von Terror-Angriffen. Unserer Auffassung nach, muss sie als Sicherheitstheater enttarnt werden, denn das Ziel ist Überwachung und nicht Sicherheit. Belegt ist diese Interpretation bereits dadurch, dass grundrechtsfreundliche Optionen für die Verbesserung von Ermittlungs- und Aufklärungsarbeit weder geprüft noch diskutiert werden. Eine Rechtgrundlage für ein Quick-Freeze-Verfahren könnte längst existieren und bei der Kriminalitätsbekämpfung helfen, wird aber von Politiker.innen, denen es um Überwachung geht, blockiert. \r\n\r\nWas ist zu tun?\r\n\r\nIch hoffe, an dieser Stelle aktuelle Beispiele aus unseren kommenden Aktionen präsentieren zu können.\r\n\r\nAus unserer Sicht, kann viel gegen Überwachungspolitik getan werden:\r\n\r\n(1) Sicherheitstheater bei jeder Gelegenheit entlarven\r\n→ mehr dazu unter: „So können Sie auf Sicherheitstheater reagieren“\r\nhttps://digitalcourage.de/sicherheitstheater\r\n\r\n(2) Immer wieder gegen Vorratsdatenspeicherungen argumentieren, beispielseise: im Netz, in der eigenen Partei, Politiker.innen freundlich und sachlich kontaktieren. \r\n\r\n(3) Juristische Arbeit gegen Vorratsdatenspeicherung unterstützen.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 159,
      "code": "JVMVTH",
      "public_name": "Friedemann",
      "biography": "Working with Digitalcourage since 2014: data retention, surveillance & up-to-date hardware.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}