{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10658.html",
  "id": 10658,
  "guid": "4fa78609-eae4-416c-8e48-2c5f2d18b3aa",
  "logo": "/system/events/logos/000/010/658/large/Mittelmeer-Monologe_facebook_ohne_Text.jpg?1571653393",
  "date": "2019-12-28T20:50:00+01:00",
  "start": "20:50",
  "duration": "02:30",
  "room": "Dijkstra",
  "slug": "36c3-10658-die_mittelmeer-monologe",
  "title": "Die Mittelmeer-Monologe",
  "subtitle": "Mediterranean Migration Monologues",
  "track": "Art & Culture",
  "type": "performance",
  "language": "de",
  "abstract": "Von Menschen, die den riskanten Weg übers Mittelmeer auf sich nehmen, in der Hoffnung, in Europa Sicherheit zu finden.\r\n\r\nNach 700 Aufführungen der Asyl-Monologe, Asyl-Dialoge und NSU-Monologe das neue Theaterstück von Autor und Regisseur Michael Ruf.\r\n\r\nDie Mittelmeer-Monologe erzählen von Menschen, die den riskanten Weg über das Mittelmeer auf sich nehmen, in der Hoffnung, in Europa in Sicherheit leben zu können – von libyschen Küstenwachen, italienischen Seenotrettungsstellen und deutschen Behörden, die dies verhindern und von Aktivist*innen, die dem Sterben auf dem Mittelmeer etwas entgegen setzen.",
  "description": "Die MITTELMEER-MONOLOGE erzählen von den politisch widerständigen Naomie aus Kamerun und Yassin aus Libyen, die sich auf einem Boot nach Europa wiederfinden, von brutalen 'Küstenwachen' und zweifelhaften Seenotrettungsstellen und von Aktivist*innen, die dem Sterben auf dem Mittelmeer etwas entgegen setzen.\r\n\r\nDiese Aktivist*innen überzeugen beim 'Alarmphone' die Küstenwachen, nach Menschen in Seenot zu suchen oder lernen auf der Seawatch, Menschen vor dem Ertrinken zu bewahren – kurzum sie tun das eigentlich Selbstverständlichste, was im Jahr 2019 alles andere als selbstverständlich ist: menschliches Leben zu retten!\r\n\r\n\"Die Monologe berühren, schaffen Nähe, machen wütend und benennen Wege, um sich persönlich zu engagieren. (...) Sie widersetzen sich der Entmenschlichung der Tragödie. (...) Im Mittelpunkt stellen sie die Geschichten der Betroffenen.\"\r\n\r\ndie tageszeitung, taz\r\n\r\nDie Mittelmeer-Monologe sind dokumentarisches, wortgetreues Theater, basierend auf mehrstündigen Interviews. Dadurch werden reale Fälle der Seenotrettung rekonstruiert, erzählt aus der Perspektive von Betroffenen und Aktivist*innen.\r\n\r\nEines dieser realen Ereignisse zeigt die besondere Brutalität der \"libyschen Küstenwache\".\r\n\r\nSo fuhr am 6.11.2017 zeitgleich ein Rettungsschiff von Seawatch und ein Schiff der libyschen Küstenwache zu einem Migranten-Boot. Auf diesem Boot befanden sich 150 Passagiere. Eine konfliktreiche Rettungsoperation begann, und während Seawatch letztendlich 59 Personen retten konnte, ertranken mindestens 20 Personen und 47 Personen wurden zurück nach Libyen gebracht - inhaftiert, geschlagen, verkauft, gefoltert.\r\n\r\nDieser 6.11. wurde von \"Forensic Architecture\" aufwändig rekonstruiert (siehe Video \"Mare Clausum. The Sea Watch vs Libyan Coast Guard Case\") und von der New York Times ebenfalls als Video (\"How Europe Outsources Migrant Suffering at Sea\") journalistisch aufgearbeitet.\r\n\r\nIndem Michael Ruf zwei Personen, die an jenem Tag hautnah involviert waren, viele Stunden interviewt hat, liefert er die persönlichen Narrationen zu diesem paradigmatischen Fall.\r\n\r\nDie Premiere der Mittelmeer-Monologe fand fast genau 5 Jahre nach Gründung des WatchTheMed Alarmphones (11.10.2014) statt und erzählt einige Fälle der Seenotrettung dieses Aktivisten-Netzwerks. In diesen 5 Jahren hat das Alarmphone 2800 Boote in Seenot begleitet und unterstützt. Das Alarmphone ist rund um die Uhr anrufbar, umfasst ein Netzwerk von 200 Beteiligten in vielen Städten Europas und Nordafrikas und hat sich als kontinuerliche Infrastruktur für das Recht auf Bewegungsfreiheit entwickelt.\r\n\r\nDie Mittelmeer-Monologe liefern persönliche und intime Einblicke in die weitesgehend unbekannte Arbeit des Alarmphones, die einer Aktivistin und die jener Person, die in Seenot die Nummer des Alarmphones wählte, sowie deren insprierende gemeinsame Geschichte.\r\n\r\nÜbertitel in Englisch, Französich und Arabisch.",
  "recording_license": "",
  "do_not_record": true,
  "persons": [
    {
      "id": 9468,
      "public_name": "Michael Ruf"
    }
  ],
  "links": [
    {
      "url": "https://heimathafen-neukoelln.de/events/die-mittelmeer-monologe/",
      "title": "Mittelmeer-Monologe"
    }
  ],
  "attachments": [
    {
      "url": "/system/event_attachments/attachments/000/003/866/original/Die_Mittelmeer-Monologe_im_Heimathafen_Neuk%C3%B6lln_10.10.2019.pdf?1571653395",
      "title": "Die Mittelmeer-Monologe - Postkarte"
    }
  ]
}