{
  "id": 1087,
  "guid": "4fcc3853-b979-4f41-91ef-91e9053ac5e4",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Nachhaltige_Mobilit%C3%A4tsplanung_mit_offenen_Daten",
  "logo": null,
  "date": "2019-12-27T14:00:00+01:00",
  "start": "14:00",
  "duration": "3:00",
  "room": "Seminar room 14-15",
  "slug": "36c3-1087-session_nachhaltige_mobilitaetsplanung_mit_offenen_daten",
  "title": "Nachhaltige Mobilitätsplanung mit offenen Daten",
  "subtitle": "Sustainable urban mobility planning with open data",
  "track": "self organized sessions",
  "type": "workshop",
  "language": "de",
  "abstract": "",
  "description": "Lotet mit uns zusammen aus, wie offene Daten zu einer nachhaltigen Entwicklung des städtischen Verkehrs und der Mobilität in Leipzig beitragen können!\nSeit 2015 stellt die Stadt Leipzig in ihrem Open Data-Portal (https://opendata.leipzig.de/) Daten zur allgemeinen Nutzung zur Verfügung. Frei verfügbare Daten sind eine Grundlage für soziale Innovation und lokale Demokratie, indem sich Bürger/innen mit den Informationen über ihre Stadt beschäftigen und ihre Ideen dazu einbringen können. Bisher gehen die Aktivitäten der Stadt Leipzig aber über das Bereitstellen der Daten kaum hinaus.Das soll sich ändern! In diesem Workshop werden kommunale Daten zu den Themen Mobilität und Verkehr der Stadt Leipzig bereitgestellt, die sonst nicht oder nur teilweise öffentlich zugänglich sind. Lotet mit uns zusammen aus, wie offene Daten zu einer nachhaltigen Entwicklung des städtischen Verkehrs und der Mobilität in Leipzig beitragen können!Leipzig steht bei Fragen der Mobilität vor großen Herausforderungen:-\tLeipzig wächst! In den letzten 15 Jahren um ca. 100.000 Einwohner. Mehr Menschen bedeutet auch mehr Staus und verstopfte Straßen! Oder? Wie können offene Daten helfen, den Verkehr nachhaltiger, also klimafreundlicher, flächenschonender und sozial verträglicher zu organisieren?-\tLeipzigs Verkehr soll bis 2030 nachhaltiger werden! Das hat der Stadtrat 2018 beschlossen. Wie können wir mithilfe offener Daten geeignete Maßnahmen auf diesem Weg identifizieren?-\tMobilitätsplanung demokratisieren! Der Entscheidungsweg zur Mobilitätsstrategie 2030 war von einer breiten Beteiligungskultur geprägt. Diese Arbeitsrichtung wollen wir fortführen und auf die Nutzung kommunaler Daten ausdehnen. Wenn die Mobilitätsentscheidungen der Menschen nachhaltiger werden sollen, müssen auch die zugehörigen Lösungen mit ihnen gemeinsam entwickelt werden. Daran arbeiten wir in diesem Workshop.Neben den Datensätzen, die bereits jetzt auf den Open Data-Portal der Stadt Leipzig verfügbar sind, werden weitere statistische Geodaten der Stadt Leipzig eigens für den Workshop zugänglich gemacht.Der Workshop wird finanziert durch den Europäischen Fonds für regionale Entwicklung (EFRE) im Rahmen der Interreg Central Europe – Initiative.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:TilmanSchenk",
      "public_name": "TilmanSchenk"
    }
  ],
  "links": [
    "https://www.interreg-central.eu/Content.Node/LOW-CARB.html"
  ]
}