{
  "id": 1582,
  "guid": "50fab29f-72b7-4e68-a667-7df822e78752",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Nothing_to_Hide_-_Dokumentarfilm_2017",
  "logo": null,
  "date": "2019-12-27T22:00:00+01:00",
  "start": "22:00",
  "duration": "1:30",
  "room": "Roter Salon",
  "slug": "36c3-1582-session_nothing_to_hide_dokumentarfilm_2017",
  "title": "Nothing to Hide - Dokumentarfilm 2017",
  "subtitle": "Nothing to Hide?",
  "track": "self organized sessions",
  "type": "other",
  "language": "de",
  "abstract": "",
  "description": "Überwachte digitale Welt\nKurzthese:„Ich habe ja nichts zu verstecken“, lautet das Mantra mit dem wir trotz Snowden eine überwachte digitale Welt hinnehmen. Anhand der persönlichen Geschichten von fünf Protagonisten untersucht der Dokumentarfilm „Nothing To Hide“ die Implikationen dieser Haltung für Demokratie und Privatsphäre, für Gesellschaft und Individuum. Beschreibung: Trotz den Enthüllungen Edward Snowdens  scheinen die Meisten von uns eine überwachte digitale Gesellschaft einfach hinzunehmen. Obwohl im allgemeinen Konsens darüber herrscht, dass Überwachungsregime invasiv und autoritär sind, installieren Leute immer mehr Apps und “kostenlose” Programme. Dabei werden sie gezwungen, den Vertragsbedingungen zuzustimmen, geben in wenigen Klicks ihre Privatsphäre her und verschaffen Unternehmen Zugang zu ihren persönlichen Daten. Um ihr Verhalten zu rechtfertigen, erklären die meisten: „Für mich interessiert sich doch sowieso keiner, also warum sollten sie mich überwachen? Ich habe nichts zu verstecken.”„Nothing To Hide“ ist ein unabhängiger Dokumentarfilm über die digitale Überwachung und deren weit verbreitete Akzeptanz in der Bevölkerung mit der Rechtfertigung des „Ich habe nicht zu verstecken“- Arguments. Die in Berlin lebenden Journalisten und Marc Meillassoux und Mihaela Gladovic haben den Film geschrieben und produziert, um sich anhand der persönlichen Geschichten von fünf Protagonisten der Frage anzunähern, was diese passive Akzeptanz von massiver Überwachung von Seiten großer Unternehmen als auch staatlich für unsere Demokratie, für unser Recht auf Privatsphäre, für unsere Gesellschaft und für uns als Individuum bedeutet.- in deutsch mit englischen Untertiteln -",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Kreatur",
      "public_name": "Kreatur"
    }
  ],
  "links": []
}