{
  "id": 188,
  "guid": "51a9f476-22d9-5844-ace2-a9078540bec5",
  "logo": "",
  "date": "2019-12-27T11:30:00+01:00",
  "start": "11:30",
  "duration": "00:20",
  "room": "Chaos-West Bühne",
  "slug": "LBLBJT",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/LBLBJT/",
  "title": "Swiss Cybervoting PIT(falls)",
  "subtitle": "",
  "track": "All about computers",
  "type": "Einfacher Slot",
  "language": "en",
  "abstract": null,
  "description": "The Swiss democracy is one of it's kind.\r\nDigitization is starting to affect even our most critical processes, such as voting.\r\n\r\nWhen a piece of code suddenly gets responsible for democracy, it's only natural that the voices get loud and many questions get raised:\r\nIs our democracy at stake? Do we have to fear for our privacy? Is electronic voting even feasible in Switzerland? Is such a solution secure?\r\n\r\nAs part of a mandatory Public Intrusion Test (PIT), the Swisspost released their e-voting source code to the world and started a heated debate - far beyond the Swiss borders.\r\n\r\nNot only the codebase revealed several problems during the PIT. \r\nInteresting scoping, redefining the term \"open source\" and unreleased security audits were only some of the issues that security researchers faced and caused controversy.\r\n\r\nIn this talk we will have a look at many technical and non-technical aspects of the e-voting solution and PIT from the view of a participating security researcher.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 132,
      "code": "ER9SQ9",
      "public_name": "Jannis Kirschner",
      "biography": "Jannis is a Swiss Security Researcher and CTF player. With a passion for reverse engineering and exploit development, he loves to analyze complex applications. He regularly participates in national and international cybersecurity competitions and speaks at various conferences and events.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}