{
  "id": 215,
  "guid": "53015074-4e23-5385-8857-0b6613990693",
  "logo": "",
  "date": "2019-12-28T16:30:00+01:00",
  "start": "16:30",
  "duration": "00:20",
  "room": "Chaos-West Bühne",
  "slug": "M8NMW7",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/M8NMW7/",
  "title": "Rechter Feminismus in der 'Identitären Bewegung' ?- oder How to red pill a woman",
  "subtitle": "",
  "track": "Antifaschimus",
  "type": "Einfacher Slot",
  "language": "de",
  "abstract": null,
  "description": "Der Feminismus ist Feindbild der rechten Szenen. So auch in der ‚Identitären Bewegung‘. Neben Praktiken des Otherings und Diffamierungen gegen Feminist*innen und andere Akteur*innen des Gender-Diskurses behaupten die ‚Identitären‘, sich für Frauen viel gewissenhafter einzusetzen als „die Linken“ es täten: Denn Feminismus mache Frauen unglücklich und mache sie langfristig zu unfrei. Frauen ließen sich von „linksgrünversifften“ Mainstreammedien und der Politik unwissentlich emotional erpressen und wählten darum Parteien¬, die in der Lesart der IB Frauen nur Unglück brächten. Die Überzeugungsstrategien, die genutzt werden, um Frauen auf die „rechte Seite“ zu ziehen, wird in der Szene als „red pilling“ bezeichnet – eine Metapher von misogynen Männerrechtlern, die durch „Gamergate“ auch andere Szenen erreichte.\r\nIch werde die vermeintlich ‚harmlos‘ erscheinenden Social-Media-Darstellungen der ‚Identitären‘ – wie das „private’ Instagramfoto einer Schwangeren im Kornfeld – analysieren, und zeigen, welche mehr oder weniger subtilen Reproduktion von stereotypischen, antifeministischen Rollenbildern transportiert werden, die vordergründig als „frauenfreundlich“ angeboten werden.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 160,
      "code": "UKMFTJ",
      "public_name": "Marie Rodewald",
      "biography": "Promoviere in Volkskunde/Kulturanthropologie an der Uni Hamburg zur 'Identitären Bewegung'",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}