{
  "id": 878,
  "guid": "537463f1-be0c-5744-b767-f65fe07d9641",
  "logo": "/media/36c3/images/MGPKF3/logo.png",
  "date": "2019-12-28T19:00:00+01:00",
  "start": "19:00",
  "duration": "01:00",
  "room": "soupworx",
  "slug": "MGPKF3",
  "url": "https://talks.komona.org/36c3/talk/MGPKF3/",
  "title": "Medienkollektiv Frankfurt - Kurzfilme",
  "subtitle": "",
  "track": null,
  "type": "Movie",
  "language": "de",
  "abstract": "Das _Medienkollektiv Frankfurt_ stellt sich kurz vor und zeigt eine kleine Auswahl an Produktionen der letzten Monate.\r\n\r\nIf required, we can also translate / speak in english. Our Videos and interviews are in german.",
  "description": "Wir, das [Medienkollektiv Frankfurt](https://www.medienkollektivfrankfurt.net/), arbeiten ohne kommerzielles Interesse. Wir entscheiden frei von Markt- und Diskurszwängen, rein nach inhaltlichen Kriterien, was wir in welcher Weise abbilden wollen - und dies nicht isoliert und von außen, sondern solidarisch aus und mit den Bewegungen, über die wir berichten.\r\n\r\nWir würden euch gerne ein paar Arbeiten der letzten Monate vorstellen, chaotisch kuratiert just in dem Moment. Alle von uns veröffentlichten Videos findet ihr aber auch auf [youtube](https://www.youtube.com/channel/UClPnzcLXOLvlyvlbXpMiCOA/videos).\r\n\r\nAnschliessend können wir uns über alternative Medienarbeit unterhalten. Wir teilen gerne unsere Erfahrungen und freuen uns über kritischen Austausch.\r\n\r\nMenschen, die nicht gerne in größeren Gruppen sprechen, laden wir dazu ein, uns an unserem [kleinen Stand im Süden von Komona](https://36c3.c3nav.de/l/c:0:446.98:439.57/) zu besuchen.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 56,
      "code": "TZQMLT",
      "public_name": "mkf_",
      "biography": "## Wer wir sind\r\n\r\nWir, das [Medienkollektiv Frankfurt](https://www.medienkollektivfrankfurt.net/), arbeiten ohne kommerzielles Interesse. Wir entscheiden frei von Markt- und Diskurszwängen, rein nach inhaltlichen Kriterien, was wir in welcher Weise abbilden wollen - und dies nicht isoliert und von außen, sondern solidarisch aus und mit den Bewegungen, über die wir berichten.\r\n\r\nSoziale und politische Emanzipation, Selbstbestimmung und Solidarität, vergesellschaftete Produktion für menschliche Bedürfnisse, das Recht menschenwürdig leben und lieben zu können, wo und wie man möchte, sowie das Engagement für eine klimaneutrale ökologische Wende und für den Erhalt natürlicher Lebensräume bilden die Leitplanken unserer gemeinsamen Gesellschaftsvision. Jenseits einer konkreten Festlegung auf explizit eine politische Linie, eint uns ein antikapitalistischer, antirassistischer, antisexistischer und antimilitaristischer Konsens, sowie das Eintreten gegen Rechtsradikalismus, Antisemitismus, Islamfeindlichkeit, religiösen Fundamentalismus und jegliche reaktionäre Ideologie, die Menschen zu unterdrücken und auszubeuten trachtet.\r\n\r\nDurch die kontinuierliche Auseinandersetzung mit diversen Themenfeldern und politischen AkteurInnen und Gruppen bilden wir uns stets selbstkritisch weiter und sind somit undogmatisch und offen für neue Perspektiven und Ideen, sofern sie unserem Konsens nicht widersprechen. Da wir bewegungsnah arbeiten wollen, befeuern wir keine innerlinken Grabenkämpfe. Als Medienkollektiv liegt es uns jedoch nicht fern, einen argumentativen Austausch relevanter Positionen und Strömungen abzubilden und den ZuschauerInnen und ZuhörerInnen zugänglich zu machen, falls an einem solchen Interesse besteht.\r\n\r\nDa wir in Frankfurt beheimatet sind, sehen wir den Kern unserer Arbeit in der Berichterstattung zu lokalen und regionalen Ereignissen, was uns aber nicht davon abhält, bei überregional relevanten Themen und Geschehnissen mit in einen Bus zu steigen und uns unter die Mobilisierten zu mischen.\r\n\r\nAlle von uns waren oder sind in politischen, Bildungs- oder linken Bewegungszusammenhängen aktiv oder sympathisieren mit diesen. Darum verstehen wir uns als Medien-AktivistInnen und beziehen mit unseren Veröffentlichungen politisch Position: wir sind nicht neutral und werden es auch niemals sein. Und das ist auch gut so.\r\n\r\n## Was wir machen\r\n\r\nDas Medienkollektiv Frankfurt produziert zurzeit Berichte, Reportagen, Dokumentationen und Mobi-Videos. In unserem bisherigen Fokus stehen dabei Protestformen wie Demonstrationen oder künstlerische und direkte Aktionen, die wir filmend und interviewend begleiten. Wir sind uns der Brisanz solcher Bilder bewusst. Darum veröffentlichen wir unveränderte Bild- und Tonaufnahmen von Einzelpersonen nur mit deren Einverständnis und anonymisieren diese bei Bedarf. Gerne können sich Gruppen oder Einzelpersonen vorab mit uns in Verbindung setzen, um sich über Form und Inhalt, sowie \"Aktionslevel\" einer möglichen Begleitung auszutauschen und zu beraten. Des Weiteren bieten wir an, Veranstaltungen wie Lesungen, Podiumsdiskussionen oder Konzerte aufzuzeichnen und zu veröffentlichen. Auch längere Interviews zu aktuellen Anlässen stehen auf unserer Agenda. Just contact us!\r\n\r\nWir wollen mit den Videos so viele Menschen wie möglich ansprechen und werden deshalb stets versuchen, Inhalte in einer einfachen und niedrigschwelligen Sprache so zu vermitteln, dass sie auch für bisher an linker Politik und deren Narrative nicht gewohnte Menschen zugänglich und interessant bleiben. Es geht uns nicht darum, gesellschaftliche bzw. publizistische Allgemeinplätze zu reproduzieren, sondern die Perspektive von links und von unten stark zu machen und zu persönlichem Engagement und Selbstorganisation anzustiften.\r\n\r\nUm den modernen Sehgewohnheiten gerecht zu werden, streben wir eine audio-visuelle Qualität an, die diesen zwar gerecht wird, jedoch ebenfalls offen für ästhetische Experimente und Neuerungen bleibt. Gerade weil unterschiedliche Menschen mit verschiedenen ästhetischen und philosophischen Positionen im Kollektiv beteiligt sind, wollen wir diese Diversität auch in Formen und Formaten widerspiegeln. Denn für eine andere Gesellschaft einzutreten heißt auch hier: Kein Identitätszwang, mit gewohnten Mustern brechen, neue Wege wagen!\r\n\r\n## Was wir brauchen\r\n\r\nDa wir leider noch in einer Gesellschaft der warenförmigen Produktion von Gebrauchsgegenständen leben, sind wir nicht unabhängig vom Geld. Bisher bestreiten wir die Anschaffung von Aufnahme- und Bearbeitungstechnik mit unseren eigenen Lohnarbeitsertägen. Da gutes Equipment sehr teuer ist, sind wir kurz- und mittelfristig erfreut über jegliche materielle Unterstützung, sei es in Form von Geld- oder Sachspenden. Auch das kostenfreie Ausleihen von technischen Geräten oder die Bereitstellung von Arbeitsräumen können eine große Unterstützung für uns sein.\r\n\r\nUnsere langfristige Vision ist ein Medienzentrum, in dem wir gemeinsam arbeiten und uns und andere dazu befähigen können, mehr qualitative Berichterstattung und Informationsvermittlung von links und von unten umzusetzen.\r\n\r\nVielerorts entstehen derzeit Medienkollektive, sodass eine zukünftige Vernetzung denkbar und sinnvoll erscheint. Wer Kontakte zu anderen Medienkollektiven hat oder selbst einem solchem angehört, möge sich gerne bei uns melden.\r\n\r\nUnd last but not least: Da niemand alles wissen und keine/r jede/n kennen kann, sind wir auch dankbar für sachdienliche Hinweise und die Vermittlung von spannenden InterviewpartnerInnen.\r\n\r\n_Filmend schreiten wir voran!_",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}