{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10652.html",
  "id": 10652,
  "guid": "56e58bc1-1a30-4eae-a81b-78cf86732865",
  "logo": "/system/events/logos/000/010/652/large/Train_wreck_at_Montparnasse_1895_FAIL.jpg?1571601627",
  "date": "2019-12-28T22:10:00+01:00",
  "start": "22:10",
  "duration": "01:00",
  "room": "Ada",
  "slug": "36c3-10652-bahnmining_-_punktlichkeit_ist_eine_zier",
  "title": "BahnMining - Pünktlichkeit ist eine Zier",
  "subtitle": "",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "de",
  "abstract": "Seit Anfang 2019 hat David <i>jeden</i> einzelnen Halt <i>jeder</i> einzelnen Zugfahrt auf <i>jedem</i> einzelnen Fernbahnhof in ganz Deutschland systematisch gespeichert. Inklusive Verspätungen und allem drum und dran. Und die werden wir in einem bunten Vortrag erforschen und endlich mal wieder ein bisschen Spaß mit Daten haben.\r\n\r\n<i>Rechtlicher Hinweis: Es liegt eine schriftliche Genehmigung der Bahn vor, von ihr abgerufene Rohdaten aggregieren und für Vorträge nutzen zu dürfen. Inhaltliche Absprachen oder gar Auflagen existieren nicht.</i>",
  "description": "Die Bahn gibt ihre Verspätungen in \"Prozent pünktlicher Züge pro Monat\" an. Das ist so radikal zusammengefasst, dass man daraus natürlich nichts interessantes lesen kann. Jetzt stellt euch mal vor, man könnte da mal ein bisschen genauer reingucken.\r\n\r\nStellt sich raus: Das geht! Davids Datensatz umfasst knapp 25 Millionen Halte - mehr als 50.000 pro Tag. Wir haben die Rohdaten und sind in unserer Betrachtung völlig frei. \r\n\r\nDer Vortrag hat wieder mehrere rote Fäden.\r\n\r\n<b> 1) Wir vermessen ein fast komplettes Fernverkehrsjahr der deutschen Bahn.  </b> Hier etwas Erwartungsmanagement: Sinn ist keinesfalls Bahn-Bashing oder Sensationsheischerei - wer einen Hassvortrag gegen die Bahn erwartet, ist in dieser Veranstaltung falsch. Wir werden die Daten aber nutzen, um die Bahn einmal ein bisschen kennenzulernen. Die Bahn ist eine riesige Maschine mit Millionen beweglicher Teile. Wie viele Zugfahrten gibt es überhaupt? Was sind die größten Bahnhöfe? Wir werden natürlich auch die unerfreulichen Themen ansprechen, für die sich im Moment viele interessieren: Ist das Problem mit den Zugverspätungen wirklich so schlimm, wie alle sagen? Gibt es Orte und Zeiten, an denen es besonders hapert? Und wo fallen Züge einfach aus?\r\n\r\n<b> 2) Es gibt wieder mehrere Blicke über den Tellerrand</b>, wie bei Davids vorherigen Vorträgen auch. Ihr werdet wieder ganz automatisch und nebenher einen <i>allgemeinverständlichen</i> Einblick in die heutige Datenauswerterei bekommen. (Eine verbreitete Verschwörungsheorie sagt, euch zur Auswertung öffentlicher Daten zu inspirieren, wäre sogar der Hauptzweck von Davids Vorträgen. :-) )Die Welt braucht Leute mit Ratio, die Analyse wichtiger als Kreischerei finden. Und darum beschreibt davod auch, wie man so ein durchaus aufwändiges Hobbyprojekt technisch angeht, Anfängerfehler vermeidet, und verantwortungsvoll handelt.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 5240,
      "public_name": "David Kriesel"
    }
  ],
  "links": [],
  "attachments": []
}