{
  "id": 570,
  "guid": "576f75a7-ed66-5071-b51c-7f1b19a0d030",
  "logo": "",
  "date": "2019-12-29T19:00:00+01:00",
  "start": "19:00",
  "duration": "03:00",
  "room": "WikiPaka WG: Bibliothek",
  "slug": "EFPNMB",
  "url": "https://cfp.verschwoerhaus.de/36c3/talk/EFPNMB/",
  "title": "Mini-Hackathon \"Hacking Ecology\"",
  "subtitle": "",
  "track": "Resilience & Sustainability",
  "type": "Workshop",
  "language": "de",
  "abstract": "We want to meet up in the Wikipaka WG to start working on an interactive data visualization tool for publicly accessible ecological (and socio-economical) time series datasets from different sources. The goal of the project is to help people to get an idea of the challenges ecosystems are facing in the Anthropocene and to encourage people to become active.",
  "description": "Hacking Ecology is a citizen science collective that, on the basis of the ideas of open source and open data, wants to contribute to the research necessary to avert the ecological crisis. In this mini-Hackathon, we want to kickstart out first project, an easily useable interactive (web-)tool (in Python, using Bokeh) and brings together and visualizes publicly available time series datasets from very different sources. With it, it should be possible to visualize e. G. the change in precipitation or rate of urbanization as well as the numbers of earthworms in the same figure, so that one can get a feeling for the challenges ecosystems are facing in the Anthropocene. Furthermore, this tool will be a good basis for future work of Hacking Ecology, as it makes it easier to e. G. form hypotheses on which human actions are harmful for the environment or what actions could be taken to avoid ecosystems from breaking down. \r\nWe will provide a first, clumsy version of the tool and a list of datasets that might be relevant to ecosystems, but are very happy to take up all helpful input and ideas; all code will be immediately published on Github and we'll try to run this as collaborative as possible. Please bring something you can write and submit code with.\r\n\r\nSource Code for Videt: https://github.com/HackingEcology/videt\r\nPads (for discussion and coordination):\r\nVidet https://pad.totalism.org/p/Hacking_Ecology_Hackathon_36c3\r\nSnooze Against The Machine: https://pad.totalism.org/p/snooze\r\nWildretter: https://pad.totalism.org/p/wildretter\r\nWebsite: http://hackingecology.eu/ \r\nMailing list: https://lists.posteo.de/listinfo/hackingecology",
  "recording_license": "",
  "do_not_record": true,
  "persons": [
    {
      "id": 78,
      "code": "7NXHQB",
      "public_name": "Theo Sperlea",
      "biography": "I'm a microbiologist-turned-data-scientist and PhD student at the University of Marburg, where I am researching the ecology of microorganisms in lakes using machine learning techniques. In that work I keep noticing how little we know about ecology -- and how easy it might (just might) be to change that if all the relevant data was open and well-structured.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}