{
  "url": "https://frab.riat.at/en/36C3/public/schedule/events/160.html",
  "id": 4360,
  "guid": "58532b02-e6b2-4c31-b342-32c17a92e2c9",
  "logo": "/system/events/logos/000/000/160/large/Screenshot_from_2019-12-24_14-52-04.png?1577196822",
  "date": "2019-12-29T21:30:00+01:00",
  "start": "21:30",
  "duration": "00:30",
  "room": "CDC - Stage",
  "slug": "36C3-160-3_8_billion_users_future_email_3_0",
  "title": "3.8 Billion users' future: Email 3.0",
  "subtitle": "",
  "track": "Stage",
  "type": "lecture",
  "language": "en",
  "abstract": "Hundreds of messaging platforms have launched and failed over the last 50 years, while one Open Standards, and mostly Open Source powered decentralised platform has conquered the world. What is the magic formula that has powered email to adoption by 3.8bn users, and what is the future of decentralised messaging as firms like Google and Facebook try desperately to replace it?",
  "description": "Hundreds of messaging platforms have launched and failed over the last 50 years. One has grown voraciously, netting 3.8 billion users, and handling 103 trillion messages each year. \r\n\r\nLike the Internet itself, email is decentralised and censorship resistant by design. It is technically extensible, powered by Free Software, and Open Standards agreed independently by consensus.\r\n\r\nLinkedIn, Facebook, Google and others are racing to own the future of this space, with Gmail alone accounting for 28% of email opens in 2018, in Western countries. Email's freedom, privacy, and security are taken for granted and under threat. \r\n\r\nWhat formula made email outlive it's contenders until now? What recent innovations are making it hip again? And what economic model could bring a renaissance of decentralised, Free Software messaging on the multi-billion user scale? ",
  "recording_license": "The talks at Critical Decentralisation Cluster will be live streamed and recorded. I consent to the use by Monero or RIAT of my image, video, and voice. I understand that this consent is perpetual and my image, video, and voice may appear publicly as part of Monero or RIAT website, Twitter account, YouTube channel and/or other marketing materials, which will be licensed under a Creative Commons Attribution-NonCommercial 4.0 International License. If you would like to opt-out and not be recorded, please contact office@riat.at",
  "do_not_record": false,
  "persons": [
    {
      "id": 128,
      "public_name": "Sam Tuke"
    }
  ],
  "links": [],
  "attachments": []
}