{
  "id": 1018,
  "guid": "5b1bc8ca-0bdb-5fab-8542-f0ed1465fd00",
  "logo": "",
  "date": "2019-12-28T16:00:00+01:00",
  "start": "16:00",
  "duration": "00:00",
  "room": "Sendetisch",
  "slug": "SXTNVZ",
  "url": "https://fahrplan.das-sendezentrum.de/36c3/talk/SXTNVZ/",
  "title": "Die mit dem schwarzen Hund tanzen",
  "subtitle": "",
  "track": "Sendetisch",
  "type": "Normale Länge",
  "language": "de",
  "abstract": "Ein Podcast über Depressionen - von Betroffenen (nicht nur) für Betroffene",
  "description": "Der Podcast \"Die mit dem schwarzen Hund tanzen\" entsteht gerade. Wir - Anne und Ludger - sind selbst an Depression erkrankt. Mit dem Podcast möchten wir einen Einblick in unsere Leben mit psychischen Erkrankungen geben und unsere Erfahrung (mit-)teilen.\r\n\r\nPsychische Erkrankungen sind zwar auch \"nur\" Erkrankungen, die in den allermeisten Fällen sehr gut behandelbar sind. Aber sie unterscheiden sich eben doch: oft \"unsichtbar\" (im Gegensatz zu einem Beinbruch oder Kopfschmerzen), unvorhersehbar (Stimmungsschwankungen, unklare Auslöser...) und daher - so meinen wir - eben keine Erkrankung wie jede andere.\r\n\r\nWir möchten mit Expert:innen, anderen Betroffenen und Angehörigen sprechen und uns mit allen austauschen, die ewas zum Thema \"mental health\" (psychische Gesundheit) zu sagen haben, also gerne podcasten möchten. :-)\r\n\r\nWir freuen uns auf euch!",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 116,
      "code": "JMAGA7",
      "public_name": "Ludger",
      "biography": "Seit ein paar Jahren bin ich den \"Podcast-Topf\" gefallen und habe viel zu Technik und Vorgehen gelesen, einiges ausprobiert und (noch!) nichts produziert. ;-)\r\nIn 2016 war ich das erste Mal auf dem Podstock - das beste Podcast-Festival, das es gibt!\r\nVielleicht ist der 36c3 der Startschuss für eine ungeahnte, neue Podcast-Karriere. ;-)",
      "answers": []
    },
    {
      "id": 128,
      "code": "TAR7XK",
      "public_name": "Anne",
      "biography": null,
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}