{
  "id": 1234,
  "guid": "5d4714ef-b83c-4cca-9d78-c43b15114af7",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Kefir_Making",
  "logo": null,
  "date": "2019-12-28T14:00:00+01:00",
  "start": "14:00",
  "duration": "2:00",
  "room": "Assembly:Foodhackingbase",
  "slug": "36c3-1234-session_kefir_making",
  "title": "Kefir Making",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "hands-on",
  "language": "en",
  "abstract": "",
  "description": "At this workshop you will learn how to make your own kefir ferments using the kefir grain culture.\n[[File:Kefir cake.jpg|thumb|right|Kefir cake]][[File:Kefir grain.jpg|thumb|right|Kefir grain]][https://dudle.inf.tu-dresden.de/kefir36c3/ To secure spot on this workshop please sign in here.][https://foodhackingbase.org/wiki/Recipe:Kefir_making_manual_-_short_workshop_form Workshop manual is shared here.]At this workshop you will learn how to make your own [https://en.wikipedia.org/wiki/Kefir kefir] ferments using the kefir grain culture. We will explain basic concepts of probiotic, prebiotic and biofilm based polycultures and why it is good to consume foods “labeled” by these terms. You will prepare your own kefir culture, based on the working manual and take it with you so you will be ready to brew wherever you decide hopefully “positively infecting” your local hackerspace. This time we will also try to make at least as a demonstration a \"kefir cake\" and base of probiotic kefir drink, depending on how much time we will have.We will be talking about milk/dairy fermentations focusing on kefir and yogurt cultures, explaining also the concept of slow food and related terms like probiotics etc. We will demonstrate how to make a new batch of kefir and how to harvest the old one. The main aim of this workshop is for the participants to understand the principles behind the milk fermentation with kefir culture. Combined with the practical experience which I provide you will be able to take care properly about your kefir cultures which is the key for your successful long term fermentation adventures! Don't worry too much about loosing a batch or two, that happens from time to time, keeping the \"mother culture\" happy is the important part. As usually there will be tasters, cultures sharing, manuals and various hints how to use the products in alternative ways making for example probiotic drinks from whey, cream cheese, kefir cake et cetera. I can be also your troubleshooting help if you need it.This workshop is donation based no one turned away for lack of funds and it fallows the usual fhb approach of money handling.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:0x378",
      "public_name": "0x378"
    }
  ],
  "links": [
    "https://foodhackingbase.org/wiki/Kefir_making_36c3"
  ]
}