{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10909.html",
  "id": 10909,
  "guid": "60017c5f-e30d-493c-afd7-9a44f6b0e8f2",
  "logo": null,
  "date": "2019-12-28T20:50:00+01:00",
  "start": "20:50",
  "duration": "01:00",
  "room": "Eliza",
  "slug": "36c3-10909-reusing_ict_equipment_why_how",
  "title": "Reusing ICT equipment, why & how",
  "subtitle": "Practical experiences and processes for repurposing ICT equipment",
  "track": "Resilience & Sustainability",
  "type": "lecture",
  "language": "en",
  "abstract": "Since 2011, FAIR (FAIR Allocation of Infotech Resources) has reused 3,000 computers from Denmark 11,000 computers from Norway. We'll go through how we're setup to provide reuse, and how ultimately fellow communities are benefiting from this.",
  "description": "As the wheels of economy turn, companies and public institutions are incentivized to replace their ICT equipment, leaving behind equipment that can be repurposed for the greatest possible human value and impact in the hands of those that need it the most.\r\n\r\nFAIR Denmark is a civic society that has worked to source and redistribute this equipment in an overall program to give ICT access to youths in Malawi: From the logistics and data sanitization to university-based collaborations for training and maintenance in Malawi and offline software platforms for access to quality education at secondary schools in Malawi.\r\n\r\nAll the software and contents that we work with are Open Source / Open Access.\r\n\r\nMaybe you're interested in reuse? Maybe for the sake of the environment or maybe in the interest of helping others? We're going to have to be working together in bigger alliances to avoid the pitfalls of our wasteful culture, planned obsolescence and physical shredding of computer equipment. The the extend of my knowledge and awareness, the talk will try to introduce other actors with similar objectives.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9660,
      "public_name": "Benjamin Balder Bach"
    }
  ],
  "links": [
    {
      "url": "https://www.fairdanmark.dk/en/",
      "title": "FAIR website (English)"
    },
    {
      "url": "https://twitter.com/FairDanmark/",
      "title": "Twitter: @fairdanmark"
    },
    {
      "url": "https://lcrs.fairdanmark.dk/",
      "title": "Large-scale Computer Reuse Suite (LCRS)"
    }
  ],
  "attachments": []
}