{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10766.html",
  "id": 10766,
  "guid": "60936beb-b15d-44ec-a9ca-9dc0807fd889",
  "logo": null,
  "date": "2019-12-27T20:50:00+01:00",
  "start": "20:50",
  "duration": "01:00",
  "room": "Clarke",
  "slug": "36c3-10766-digitalisierte_migrationskontrolle",
  "title": "Digitalisierte Migrationskontrolle",
  "subtitle": "Von Handyauswertung, intelligenten Grenzen und Datentöpfen",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "de",
  "abstract": "Die sogenannten digitalen Assistenzsysteme des BAMF, „intelligente Grenzen“ in der EU und immer größer werdende Datenbanken: Wer ins Land kommt und bleiben darf, wird immer mehr von IT-Systemen bestimmt. Davon profitiert die Überwachungsindustrie, während Menschen von automatisierten Entscheidungen abhängig werden.",
  "description": "Deutschland hat in den letzten Jahren massiv in Technik investiert, um Asylverfahren zu digitalisieren. Biometrische Bilder mit Datenbanken abgleichen, Handys ausgelesen und analysieren, Sprache durch automatische Erkennungssysteme schleifen. Ganz abgesehen von der Blockchain, die alles noch besser machen soll. Doch nicht nur in Deutschland werden zum Zweck der Migrationskontrollen immer mehr Daten genutzt. In Norwegen werden Facebook-Profile Geflüchteter ausgewertet, in Dänemark sogar USB-Armbänder. Die Grenzagentur Frontex soll für „intelligente Grenzen“ sorgen, Datenbanken werden EU-weit ausgebaut und zusammengelegt. Rechtschutzmechanismen versagen größtenteils. Worum es dabei geht? Schnellere Abschiebungen. Wer davon profitiert? Die Überwachungsindustrie.\r\n\r\nIn Vorbereitung von Klageverfahren bringt die Gesellschaft für Freiheitsrechte e.V. (GFF) gemeinsam mit der Journalistin Anna Biselli im Laufe des Dezembers eine Studie heraus, die sich diesem Thema genauer widmet. Die Ergebnisse der Studie wollen Lea Beckmann und Anna Biselli gemeinsam vorstellen und kontextualisieren.\r\n\r\nAnna Biselli ist Informatikerin und Journalistin und arbeitet seit Jahren zu Fragen der Digitalisierung von Migrationskontrolle. \r\nLea Beckmann ist Juristin und Verfahrenskoordinatorin der Gesellschaft für Freiheitsrechte e.V. (GFF). Die GFF ist eine NGO, die durch strategische Gerichtsverfahren Grund- und Menschenrechte stärkt und zivilgesellschaftliche Partnerorganisationen rechtlich unterstützt. In vielen ihrer Verfahren setzt sich die GFF dabei für Datenschutz und einen verantwortungsvollen Einsatz von Technologie und gegen Diskriminierung ein. ",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 4465,
      "public_name": "Anna Biselli"
    },
    {
      "id": 9577,
      "public_name": "Lea Beckmann"
    }
  ],
  "links": [
    {
      "url": "https://freiheitsrechte.org/refugee-daten/",
      "title": "Handyauslesung bei Asylsuchenden"
    }
  ],
  "attachments": []
}