{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10881.html",
  "id": 10881,
  "guid": "622f1d31-5900-4cbc-b274-770e1a172898",
  "logo": null,
  "date": "2019-12-30T13:50:00+01:00",
  "start": "13:50",
  "duration": "01:00",
  "room": "Borg",
  "slug": "36c3-10881-verkehrswende_selber_hacken",
  "title": "Verkehrswende selber hacken",
  "subtitle": "",
  "track": "Resilience & Sustainability",
  "type": "lecture",
  "language": "de",
  "abstract": "Der Talk wird eine wilde Fahrt, vorbei an umfallenden Rollern, etwas Kunst mit Sharing-Daten, einer Shoppingtour aus Recherchegründen auf asiatischen Großhandelsplattformen, Sicherheitslücken in Fahrradschlössern, welche einen deutschen Bikesharer dazu bringen, seine 6000 Räder weltweit wieder einzusammeln, der Analyse von risikokapitalgetriebenen Sharingsystemen bis hin zum Gegenentwurf: Wie angewandte Lobbyarbeit für mehr offene Mobilitätsdaten aussieht. Und wie man es selbst in die Hand nehmen kann.",
  "description": "Der Markt der Mobilitätsangebote ist in den letzten Jahren immer schneller immer größer geworden.\r\nVon einfachen Bikesharing-Rädern über E-Bikes, Lastenrädern hin zu Scootern bekommen wir in Großstädten immer mehr Möglichkeiten, ohne eigenes Gefährt trotzdem mobil zu sein.\r\n\r\nAber warum nur in Großstädten? Wie nachhaltig ist das? Warum brauche ich immer noch 20 Apps für jede Stadt? Wie sehen diese Sharingsysteme eigentlich technisch aus? Was passiert mit den Daten und was lässt sich mit ihnen anfangen? Und warum sollten wir Mobilität eigentlich risikokapitalgetriebenen Technologieunternehmen überlassen?\r\n\r\nDaher bauen wir ein Open Source Bikesharingsystem: nicht profitorientiert und offen für alle, erprobt auf dem CCCamp19.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9538,
      "public_name": "robbi5"
    },
    {
      "id": 9658,
      "public_name": "ubahnverleih"
    }
  ],
  "links": [
    {
      "url": "https://radforschung.org",
      "title": "radforschung"
    }
  ],
  "attachments": []
}