{
  "id": 251,
  "guid": "626da982-aac8-5eca-9577-826e0a825049",
  "logo": "",
  "date": "2019-12-29T14:00:00+01:00",
  "start": "14:00",
  "duration": "00:50",
  "room": "Chaos-West Bühne",
  "slug": "LF3YYH",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/LF3YYH/",
  "title": "Public Money? Public Code! A campaign framework to promote software freedom",
  "subtitle": "",
  "track": "The real basic about Bits and Nibbles",
  "type": "Doppelter Slot",
  "language": "en",
  "abstract": null,
  "description": "Do you want to promote Free Software in public administrations? Then the campaign framework of \"Public Money? Public Code!\" might be the right choice for you; no matter if you want to do it as an individual or as a group; no matter if you have a small or large time budget. \r\n\r\nMore than 170 organisations, and more than 26,000 individuals demand that publicly financed software should be made publicly available under Free Software licenses. Together we contacted politicians and civil servants on all levels -- from the European Union and national governments, to city mayors and the heads of public libraries about this demand. This did not just lead to important discussions about software freedom with decision makers, but also already to specific policy changes.\r\n\r\nIn the talk, we will explain how the campaign framework including the website publiccode.eu, the videos, the open letter, the expert brochure,and example letters can be used to push for the adoption of Free Software friendly policies in your area; be it your public administration, your library, your university, your city, your region, or your country.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 201,
      "code": "GBQW73",
      "public_name": "Bonnie Mehring",
      "biography": "Bitte nachtragen",
      "answers": []
    },
    {
      "id": 173,
      "code": "Y3LKK7",
      "public_name": "Matthias Kirschner",
      "biography": "Matthias Kirschner is President of FSFE. In 1999 he started using GNU/Linux and realised that software is deeply involved in all aspects of our lives. Matthias is convinced that this technology has to empower society not restrict it. While studying Political and Administrative Science he joined FSFE in 2004.\r\n\r\nHe helps other organisations, companies and governments to understand how they can benefit from Free Software -- which gives everybody the rights to use, understand, adapt and share software -- and how those rights help to support freedom of speech, freedom of press or privacy.\r\n\r\nMatthias loves playing with his children, and in his spare time assists in wilderness first aid seminars, enjoys comics like XKCD and Transmetropolitan; and Die Ärzte.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}