{
  "id": 1706,
  "guid": "62fcda2b-d535-4667-a86e-68278d392aed",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:PROPERTY_-_TR%C3%84UME_VON_R%C3%84UMEN_-_Dokumentarfilm_2019",
  "logo": null,
  "date": "2019-12-29T18:30:00+01:00",
  "start": "18:30",
  "duration": "1:30",
  "room": "Roter Salon",
  "slug": "36c3-1706-session_property_traeume_von_raeumen_dokumentarfilm_2019",
  "title": "PROPERTY - TRÄUME VON RÄUMEN - Dokumentarfilm 2019",
  "subtitle": "Was heißt das eigentlich, sich einen Raum aneignen?",
  "track": "self organized sessions",
  "type": "other",
  "language": "de",
  "abstract": "",
  "description": "A dreamy big city atmosphere from a haven in the middle of Berlin, where a motley community of eccentric people have created their own world.\nNahezu unbemerkt von neu Zugezogenen und den Touristenströmen, die heute die Berliner Mitte prägen, nur ein Steinwurf von der Berliner Volksbühne entfernt, liegt die Kleine Bremer Höhe. Dieses von der Zeit vergessene Gebäudeensemble aus rotem Backstein, ein genossenschaftliches Arbeiterquartier aus der Kaiserzeit, dient seit der Wendezeit seinen Bewohnern aus Künstlern, Punks und Rentnern als Refugium. Die gelassene Ruhe im Innenhof mit den verträumten Linden wirkt auf die gelegentlichen Besucher wie ein verwunschener Garten inmitten des Trubels der Torstraße. Eine Kamerafahrt an den Mülltonnen vom Hauseingang vorbei eröffnet uns den Blick auf einen ungeordneten Raum, in dem die wenigen verbliebenen Bewohner gemeinsam ihren Träumen nachhängen. Was heißt das eigentlich, sich einen Raum aneignen?, fragt der Filmemacher und Hausbewohner Matthias Lintner gleich zu Beginn seines Films und gibt uns mit seiner Liebeserklärung an seine Nachbarn die Antwort gleich hinterher. Er bleibt nah an seinen Mitbewohnern dran, die sich hier ihre eigene Welt erschaffen haben und verweigert konsequent den Blick nach draußen. Der Leerstand und Leerstelle als subversiver Akt gegen die Utopie des geordneten Raums ganz im Sinne des im Film zitierten Autoren Georges Perec.deutsch mit englischen Untertiteln",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Kreatur",
      "public_name": "Kreatur"
    }
  ],
  "links": [
    "https://www.dffb.de/films/traeume-von-raeumen/"
  ]
}