{
  "id": 200,
  "guid": "63410ac1-263b-5327-9c4b-ba3b0098228c",
  "logo": "",
  "date": "2019-12-27T23:00:00+01:00",
  "start": "23:00",
  "duration": "00:50",
  "room": "Chaos-West Bühne",
  "slug": "RAFTCU",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/RAFTCU/",
  "title": "Broken Beyond Repair - No Patch for Verfassungsschutz: Kritische Analyse der Verfassungsschutzberichte",
  "subtitle": "",
  "track": "Antifaschimus",
  "type": "Doppelter Slot",
  "language": "de",
  "abstract": null,
  "description": "Der deutsche Inlandsgeheimdienst bietet seit Jahrzehnten mit seinen Berichten eine interessante Propaganda an. Dieser wollen wir in diesem Talk auf den Zahn fühlen. Dazu ordnen wir die Erwähnungen von linken und antifaschistischen Akteur:innen kritisch ein. Dabei legen wir die Ideologie des sog. Verfassungsschutzes offen.\r\n\r\nDie Verfassungsschutzämter veröffentlichen jährlich Berichte über ihre Arbeit – auch im Netz. Doch die Berichte wurden zumeist nach 5 Jahre depubliziert. Wir sammeln alte und neue Berichte auf [Verfassungschutzberichte.de](https://vsberichte.de). Mit diesem digitalen Archiv vereinfachen wir die Recherche. Neben einer Suche lassen sich so z. B. Erwähnungen von Begriffen oder Organisationen im zeitlichen Verlauf betrachten. Einige interessante Resultate stellen wir in dem Vortrag vor.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 157,
      "code": "EZVYCT",
      "public_name": "Andreas Krämer",
      "biography": "@Housetier84\r\n\r\nAntifaschist-Aktivist-Data Science",
      "answers": []
    },
    {
      "id": 145,
      "code": "FD3B7J",
      "public_name": "Johannes Filter",
      "biography": "Johannes Filter ist freiberuflicher Software-Entwickler und Aktivist für Informationsfreiheit. Seit November 2019 sammelt er Verfassungsschutzberichte auf https://vsberichte.de. [@fil_ter](https://twitter.com/fil_ter) [@vsberichte](https://twitter.com/vsberichte)",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}