{
  "id": 200,
  "guid": "63410ac1-263b-5327-9c4b-ba3b0098228c",
  "logo": "",
  "date": "2019-12-27T23:00:00+01:00",
  "start": "23:00",
  "duration": "00:50",
  "room": "Chaos-West Bühne",
  "slug": "RAFTCU",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/RAFTCU/",
  "title": "Broken Beyond Repair - No Patch for Verfassungsschutz: Qualitative und quantitative Auswertung der Verfassungsschutzberichte mit Schwerpunkt auf den sog. Linksextremismus",
  "subtitle": "",
  "track": "Antifaschimus",
  "type": "Doppelter Slot",
  "language": "de",
  "abstract": null,
  "description": "Der deutsche Inlandsgeheimdienst, bietet seit Jahrzehnten mit seinen Berichten eine interessante Propaganda an, dieser wollen wir in diesem Talk auf den Zahn fühlen. Zudem stellen wir mit [vsberichte.de](https://vsberichte.de)  ein freies Tool vorstellen, womit ihr das in Zukunft auch könnt.\r\n\r\nDie Verfassungsschutzämter veröffentlichen jährliche Berichte über ihre Arbeit. Die Berichte entzogen sich bisher durch ihre Depublikation (zumeist nach 5 Jahren) einer Einordnung durch die Öffentlichkeit.\r\nWir sammeln die Berichte auf Verfassungschutzberichte.de und bieten dort ein Recherchewerkzeug an.\r\nErwähnungen können mit diesem Werkzeug im historischen Verlauf verglichen werden, so kann zum Beispiel die Einordnung der RAF durch den Verfassungsschutz mit der des NSU verglichen werden.\r\nZur Einordnung der (Un)Sinnhaftigkeit der Berichte wird im qualitativen Teil mit Zitaten gearbeitet. Demonstrieren lässt sich das etwa an der Erwähnung von #Unteilbar im Bericht von Sachsen-Anhalt oder #Wirsindmehr im sächsischen Bericht von 2018.\r\nDieser Talk soll helfen die Berichte einzuordnen, um einen kritischen Umgang mit dem Geheimdienst zu ermöglichen. \r\nDie Aufarbeitung der Berichte wird die Schwächen dieses Inlandsgeheimdienstes anhand ihrer eigenen Publikationen vor Augen führen.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 157,
      "code": "EZVYCT",
      "public_name": "Andreas",
      "biography": "Antifaschist-Aktivist-Data Science",
      "answers": []
    },
    {
      "id": 145,
      "code": "FD3B7J",
      "public_name": "Johannes Filter",
      "biography": "Johannes Filter is a freelance software developer and an activist for freedom of information, civic tech and open data. He studied computer science at the Hasso Plattner Institute in Potsdam, Germany and during this time he also lived abroad in Tallinn, Estonia and Madrid, Spain. He is active in various projects of the Open Knowledge Foundation Germany (FragDenStaat, OffeneGesetze and CodeForGermany) to increase government transparency and empower citizens.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}