{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10598.html",
  "id": 10598,
  "guid": "658728fa-dce0-4c6b-ab80-cd513ee1f0ac",
  "logo": "/system/events/logos/000/010/598/large/Bild1.png?1573823792",
  "date": "2019-12-27T22:10:00+01:00",
  "start": "22:10",
  "duration": "01:00",
  "room": "Eliza",
  "slug": "36c3-10598-kritikalitat_von_rohstoffen_-_wann_platzt_die_bombe",
  "title": "Kritikalität von Rohstoffen - wann platzt die Bombe?",
  "subtitle": "Ein nicht nuklearer Blick auf das Ende der Welt ",
  "track": "Science",
  "type": "lecture",
  "language": "de",
  "abstract": "Einführung in das Forschungsfeld der Kritikalitätsanalysen. Anhand der Rohstoffe Tantal, Wolfram, Zinn und Gold werden exemplarisch die quantitativen und qualitativen Indikatoren für eine Versorgungsengpassanalyse vorgestellt.",
  "description": "Moderne High-Tech-Produkte benötigen chemische Elemente, die in spezifischen Rohstoffen (z. B. Erze) vorkommen. Dabei unterliegen Verfügbarkeit und Preis dieser Rohstoffe in hohem Maße den Einflussfaktoren der Konzentrationsrisken, politischen Risiken, Angebotsreduktions- und Nachfrageanstiegsrisiken. Da Unternehmen oftmals über Jahre hinweg an bestimmte Rohstoffe gebunden sind, müssen sie den Unsicherheiten mit vielfältigen Strategien begegnen. Vom Abbau und der Verarbeitung bis zur Nutzung und Entsorgung wird die gesamte Wertschöpfungskettenkritikalität bewertet. Dadurch können Verwundbarkeiten von Unternehmen und Ländern durch Rohstoffengpässe objektiv identifiziert und Handlungsempfehlungen definiert werden. Die Kritikalitätsanalyse wird am Beispiel der 3TG-Materialien (Tantal, Wolfram, Zinn und Gold) veranschaulicht.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9335,
      "public_name": "Martin Hillenbrand"
    }
  ],
  "links": [
    {
      "url": "https://ressourcen.fm",
      "title": "Ressourcen.fm-Podcast"
    }
  ],
  "attachments": []
}