{
  "id": 1538,
  "guid": "662bce46-ca80-4bd6-9c8a-03961ed938ee",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Japanese_(Reading)_Beginner_to_Expert_(Encore)",
  "logo": null,
  "date": "2019-12-29T23:00:00+01:00",
  "start": "23:00",
  "duration": "1:30",
  "room": "Lecture room M1",
  "slug": "36c3-1538-session_japanese_reading_beginner_to_expert_encore_",
  "title": "Japanese (Reading) Beginner to Expert (Encore)",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "talk",
  "language": "en",
  "abstract": "",
  "description": "An overview to writing and studying Japanese from zero to native comprehension.\nThis is the exact same talk as [[Session:Japanese_(Reading)_Beginner_to_Expert|the talk with the same name from day 1]], but with less \"try yourself\" and more, optimized information, as I got some useful feedback from my first talk and the wish to do it again.   Here is a Copy-Paste from the original Workshop (but this time there won't be any time for writing yourself):   This is for everyone eager to get started in Japanese reading and writing or get a few ideas on how to improve.      No knowledge of Japanese required, we will start from scratch. '''Please bring a pen and some paper to try some writing.'''      What we'll discuss:   * What Japanese writing is made up of und which symbols are used for what purposes.   * The most basic Japanese symbols, Hiragana and Katakana and try writing a few ourselves while also experiencing the ridiculously simple pronunciation. With that we can already read our first few words.   * How to study Japanese in general   * Why adults have a hard time reading texts made for children and why Japanese writing is a huge mess   * The next step would be studying around 2000 Kanji, but we will just try writing a few, talk about the wacky world of reading Japanese texts with Kanji and how they are a complete mess and close the Workshop with looking at a method to get them into your head within half a year. The presented method for studying Kanji will be the Heisig method using koohii and Anki for best results in properly understanding the Kanji.   After this course and a few more minutes-hours of studying you will be ready to read a few easy Japanese children's books.      '''Useful stuff:'''* search for \"Hiragana Chart\" or \"Katakana Chart\" or \"Hiragana chart stroke order\" or \"Katakana chart stroke order\" to get all sorts of useful charts* Recommended Textbooks for studying Japanese: \"Genki I\" and \"Genki II\"* a detailed explanation of the Heisig method to study all the Kanji and an introduction to using Anki to do that. There is also a deck there to download with the best koohii stories up to 2015, but it needs some adjustments to be really useful: https://nihongoshark.com/learn-kanji/* Anki's website: https://apps.ankiweb.net/ for Android look for AnkiDroid and for iOS look for AnkiMobile (or something like that)* Kanji deck from above post from NihongoShark.com: https://ankiweb.net/shared/info/1956010956* -UPDATED- Kanji deck from NihongoShark with adjustments as I would study them (only meaning to Kanji, no information that is too much): https://megastore.uni-augsburg.de/get/Luhehlw_4Z/* the koohii Community: https://kanji.koohii.com/ (<- not a page I used or visit, but that's where the stories are from for the deck)* Tae Kim's Complete Guide to Japanese: http://www.guidetojapanese.org/learn/complete/ <- also pretty nice, I read through this one (on my phone, there is an android app of it) after finishing Genki I and Genki II* Animelon: https://animelon.com/ <- anime with Japanese and English subtitles (customizable) and more. Consider donating or offering technical help!* Abroad in Japan: https://www.youtube.com/channel/UCHL9bfHTxCMi-7vfxQ-AYtg <- entertaining English videos about Japan* Nihongo no Mori: https://www.youtube.com/user/freejapaneselessons3 <- grammar lessonsIf anything you wanted to see here is missing, write me an e-mail: alex.m.s@gmx.de",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Taulex",
      "public_name": "Taulex"
    }
  ],
  "links": []
}