{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10895.html",
  "id": 10895,
  "guid": "67cb8a49-14b0-4448-a224-95a15d8f30a6",
  "logo": null,
  "date": "2019-12-29T22:50:00+01:00",
  "start": "22:50",
  "duration": "00:40",
  "room": "Ada",
  "slug": "36c3-10895-15_jahre_deutsche_telematikinfrastruktur_ti",
  "title": "15 Jahre deutsche Telematikinfrastruktur (TI)",
  "subtitle": "Die Realität beim Arztbesuch nach 15 Jahren Entwicklung einer medizinischen Digitalstrategie",
  "track": "Security",
  "type": "lecture",
  "language": "de",
  "abstract": "Seit spätestens 2005 wird in Deutschland an der Einführung der Telematik Infrastruktur, kurz die TI, gearbeitet. Diese soll nicht weniger als die komplette Digitalisierung der deutschen Medizinbranche bedeuten. Vom Arzt, Krankenhaus, Psychotherapeut bis hin zum Apotheker sollen alle Heilberufler miteinander vernetzt werden. Der Patient soll dabei die Datenhoheit behalten, und seine Daten mittels elektronischer Gesundheitskarte, sowie alternativ per mobiler Smartphone App steuern.",
  "description": "Mit Gründung der Gematik GmbH am 11. Januar 2005 begann die offizielle Entwicklung der Telematik-Infrastruktur (TI). Ziel war die Einführung einer elektronischen Gesundheitskarte mitsamt einer Infrastruktur, die langfristig alle Teilnehmer der Medizinischen Versorgung miteinander vernetzen sollte.\r\nDer Arzt speichert alle Befunde samt Röntgen Bilder in der elektronischen Patientenakte (ePA) ab, kommuniziert verschlüsselt mit anderen Ärzten über die „Sichere Kommunikation zwischen Leistungserbringer“ (KOM-LE), der Medikationsplan ist digital verfügbar (eMP), das Rezept wird beim Apotheker digital eingelöst (E-Rezept) und im Notfall sind relevante Gesundheitsdaten (NFDM) auf der elektronischen Gesundheitskarte (eGK) des Patienten abgespeichert. So soll der digitale Arztbesuch der Zukunft aussehen.\r\nAllerdings ist nach 15 Jahren Entwicklung und 1,5 Milliarden Euro Investitionen nur ein Dienst der TI online, das Versichertenstammdatenmanagement (VSDM). Damit können die Stammdaten des Patienten, bspw. Adresse und Krankenkasse online beim Arzt aktualisiert werden, ohne Austausch der elektronischen Gesundheitskarte.\r\nNachdem dieser Dienst nun eingeführt wurde sollen zeitnah die nächsten oben aufgeführten Dienste online gehen. Die Spezifikationen, Zulassungsunterlagen sowie Feldtestkonzepte für diese Dienste sind dafür weitestgehend fertig.\r\nParallel zu der von der Politik und Gematik getriebenen Entwicklung setzten sich technik-affine Personen wie bspw. Thomas Maus [1] mit der Technik auseinander und zeigten viele Probleme und ungelöste Fragestellungen. Nachdem die TI nun größtenteils online ist und die ersten Dienste in der Praxis genutzt werden ist es an der Zeit sich die konkrete Umsetzung anzuschauen, zu evaluieren und bei Bedarf entsprechend zu verbessern.\r\n\r\nDieser Vortrag soll einen aktuellen Überblick auf die Telematikinfrastruktur geben. Es werden die bestehenden Dienste (VSDSM) sowie die schon spezifizierten Dienste wie KOM-LE oder ePA vorgestellt. Insbesondere wird auf die Sicherheit der verschiedenen Systeme eingegangen. Die Schutzziele sowie die spezifizierten Methoden um diese Ziele zu erreichen werden dargestellt und grob analysiert. \r\nDabei zeigt sich dass die TI vor allem ein sehr komplexes System mit aktuell über 7500 Seiten Spezifikationen und mehr als 1000 Seiten sogenannter Konzepten ist.\r\nDazu ist das Projekt ein sogenanntes Running Target mit regelmäßigen Updates der Spezifikationen. Diese werden entweder durch Änderungen der Stand der Technik, oder durch Wünsche von Seiten der Politik, meist durch Gesetzte, in das Projekt hereingetragen.\r\n\r\n[1] https://events.ccc.de/congress/2005/fahrplan/attachments/640-Gesundheitstelematik22C3v1.0.pdf",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9222,
      "public_name": "Christoph Saatjohann"
    }
  ],
  "links": [
    {
      "url": "https://events.ccc.de/congress/2005/fahrplan/attachments/640-Gesundheitstelematik22C3v1.0.pdf",
      "title": "Thomas Maus 2005 über die TI"
    },
    {
      "url": "https://fachportal.gematik.de/spezifikationen/",
      "title": "TI Spezifikationen"
    }
  ],
  "attachments": []
}