{
  "id": 247,
  "guid": "693d16cf-a258-5c00-a9b4-64ba49317708",
  "logo": "",
  "date": "2019-12-29T11:00:00+01:00",
  "start": "11:00",
  "duration": "00:50",
  "room": "Chaos-West Bühne",
  "slug": "Q7LV9G",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/Q7LV9G/",
  "title": "Datengewerkschaften im Kampf gegen Facebook, Google und Co.",
  "subtitle": "",
  "track": "All about computers",
  "type": "Doppelter Slot",
  "language": "de",
  "abstract": null,
  "description": "Die Datenverarbeitung auf Basis von Einwilligungen macht uns zu Klickrobotern und gibt uns gegenüber übermächtigen Anbietern keine wirklich freie Wahl. Wir zeigen eine Alternative auf, mit der wir unser Grundrecht auf informationelle Selbstbestimmung gegenüber den Großkonzernen wieder durchsetzen könnten.\r\n\r\nAusgehend von den Nachteilen der meistens alternativlosen Einwilligung, die Facebook, Google und Co. für die Nutzung ihrer Services verlangen, wird das Modell von Datengewerkschaften erläutert, ein Zusammenschluss von datenerzeugenden Einzelpersonen. Die Bündelung der Interessen vieler Betroffener zur Schaffung einer ernstzunehmenden Verhandlungsposition und die damit verbundene Ermöglichung von differenzierten und wirklich freiwilligen Einwilligungen könnten zu einer besseren Balance der Interessen führen, ohne die einzelnen Betroffenen dabei zu bevormunden. Eine erste Datengewerkschaft wurde bereits 2018 in den Niederlanden gegründet, deren erklärtes Ziel es ist, direkt mit den Anbietern zu verhandeln, um den Erzeuger*innen der Daten auch einen fairen Anteil an den Gewinnen zu verschaffen.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 195,
      "code": "MVX8Y9",
      "public_name": "Jörn Erbguth",
      "biography": "Als Jurist und Informatiker setze ich mich für digitale Grundrechte ein. Aktiv im Bereich Blockchain und DSGVO, lehre ich an der Uni Genf, der Geneva School of Diplomacy und der Universität Luzern. Ich engagiere mich für die Standardisierung von Blockchain und organisiere Veranstaltungen zum Thema [Blockchain und DSGVO](https://blockchain-gdpr.info).\r\nIm Vorstand des [EDV-Gerichtstag](https://edvgt.de) bemühe ich mich um eine gerechte digitale Justiz und im Vorstand von [entscheidsuche.ch](https://entscheidsuche.ch) für den freien Zugang zu Schweizer Gerichtsentscheiden.",
      "answers": []
    },
    {
      "id": 189,
      "code": "UFDKUK",
      "public_name": "Katrin",
      "biography": "In Berlin lebende Rechtsanwältin mit einer hohen Affinität zur IT",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}