{
  "id": 1580,
  "guid": "6a81c3e5-104b-4383-8f3d-d6815ecaeaf7",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Wondrous_Mathematics:_The_curious_world_of_four-dimensional_geometry",
  "logo": null,
  "date": "2019-12-30T00:30:00+01:00",
  "start": "00:30",
  "duration": "0:50",
  "room": "Lecture room 11",
  "slug": "36c3-1580-session_wondrous_mathematics_the_curious_world_of_four_dimensional_geometry",
  "title": "Wondrous Mathematics: The curious world of four-dimensional geometry",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "talk",
  "language": "en",
  "abstract": "",
  "description": "You couldn't tie your shoelaces if we lived in four dimensions! And spheres would be much smaller and spikier. We'll take you on a visual tour of these and other curious phenomena unfolding in four dimensions.\nThe space we live in is three-dimensional. But mathematically, four dimensions can be just as easily defined as three dimensions. In the talk, we'll give an accessible introduction to four-dimensional thinking. We'll discuss how to imagine four dimensions, see examples of beautiful four-dimensional shapes, learn how to glue three-dimensional forms to four-dimensional ones and discover what's special about four dimensions. We'll also explore a four-dimensional labyrinth.There's some chance that you'll leave the talk with a new favourite platonic solid.The talk doesn't require any mathematical prerequisites. Exactly two formulas will appear. There will be pretty pictures. Bring your kids (age 12 and above), if they understand English! If you have seen the installment of this talk at the 33c3, then skip this talk, there is very little new material.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Iblech",
      "public_name": "Iblech"
    },
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:MatthiasHu",
      "public_name": "MatthiasHu"
    }
  ],
  "links": []
}