{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10506.html",
  "id": 10506,
  "guid": "6a8a2bfc-cc63-4938-8895-8ea84ba1544f",
  "logo": "/system/events/logos/000/010/506/large/niklas-jordan2.jpeg?1570198505",
  "date": "2019-12-29T20:50:00+01:00",
  "start": "20:50",
  "duration": "00:40",
  "room": "Clarke",
  "slug": "36c3-10506-the_planet_friendly_web",
  "title": "The Planet Friendly Web",
  "subtitle": "Warum unser Web nachhaltiger werden muss und wie wir das anstellen!",
  "track": "Resilience & Sustainability",
  "type": "lecture",
  "language": "de",
  "abstract": "Wo beginnt unsere Verantwortung bei der Gestaltung und Entwicklung einer Website und wo endet sie? Wusstest Du, dass die durch das Internet hervorgerufenen CO2-Emissionen die der Flugindustrie überschritten haben? Beim Design einer Website oder Web-App denken die wenigsten an CO2-Emissionen. So ist auch dieser Fakt weitgehend unbekannt. Warum wir uns dringend über ein nachhaltigeres Web Gedanken machen sollten und wie wir das in unserem Alltag umsetzen können, erfahrt Ihr in diesem Vortrag.",
  "description": "Auf unserer Erde gibt es viele Probleme, die es für unsere und zukünftige Generationen zu lösen gilt: Die globale Erwärmung und weltweiter Hunger sind nur einige davon.\r\n\r\nIn unserem privaten Alltag beschäftigen sich viele von uns schon sehr ausgiebig mit dem Thema Nachhaltigkeit und dem verantwortungsvollen Umgang mit Ressourcen. Wir achten darauf, dass unsere Schokolade FairTrade ist, dass unser Apfel vom Bauern aus der Region kommt oder das Fleisch aus verantwortungsvoller Tierhaltung stammt.\r\n\r\nAber wer weiß schon, dass für ein modernes Smartphone über 80 Kilogramm Natur verbraucht wird? Und wie viele von euch, die aktiv das Web gestalten, beschäftigen sich damit, es auch nachhaltiger zu machen? Oder wusstet ihr, dass die durch das Internet hervorgerufenen CO2-Emissionen die der Flugindustrie überschritten haben?\r\n\r\nIn meinem Vortrag möchte ich euch zeigen, wie ihr auch im beruflichen Alltag, bspw. beim Konzipieren, Entwicklen, Designen oder Managen einer Website oder App, auf verantwortungsvollen Ressourcenverbrauch, besonders in Bezug auf den Energiebedarf, achten könnt. Auch die Fragen, wie ihr helfen könnt, das Web nachhaltiger zu machen, und was die Anforderungen an moderne Websites und Apps sind, damit sie nicht zu Lasten unserer Umwelt gehen, möchte ich euch beantworten.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9228,
      "public_name": "Niklas Jordan"
    }
  ],
  "links": [
    {
      "url": "https://noti.st/niklasjordan/vg8d1N/warum-unser-web-nachhaltiger-werden-muss-und-wie-wir-das-anstellen",
      "title": "Slides und alle Links"
    },
    {
      "url": "https://www.niklasjordan.com/",
      "title": "Website"
    },
    {
      "url": "https://blog.niklasjordan.com/",
      "title": "Blog"
    },
    {
      "url": "https://blog.niklasjordan.com/newsletter",
      "title": "Newsletter"
    },
    {
      "url": "https://twitter.com/niklas_jordan",
      "title": "Twitter"
    }
  ],
  "attachments": []
}