{
  "id": 750,
  "guid": "6bb6632b-2f89-51eb-a4de-206d04523631",
  "logo": "",
  "date": "2019-12-29T17:30:00+01:00",
  "start": "17:30",
  "duration": "02:00",
  "room": "ChaosZone Workshop",
  "slug": "EGQPVY",
  "url": "https://cfp.chaoszone.cz/36c3/talk/EGQPVY/",
  "title": "Mit Antikorruptionsgesetzen und Data Science wirtschaftliche Interessen Visualisieren",
  "subtitle": "",
  "track": null,
  "type": "Workshop 2h",
  "language": "de",
  "abstract": "Versuchen Einfluss auf die Wissenschaft zu nehmen? Ist die Freiheit von Forschung und Lehre in Gefahr?",
  "description": "Im Selbstverständnis vieler Forschenden, unabhängig vom Forschungsbereich, besteht das Ziel ihrer Arbeit im Fortschritt und in der Weiterentwicklung der Gesellschaft. Es liegt im Interesse der Wissenschaftler*innen, durch folgenverantwortliches Handeln die Herbeiführung und Sicherung des Friedens nachhaltig zu unterstützen. \r\n\r\n\r\n**Öffentliche Daten Nutzen, Private Daten Schützen:** Nach dem Vorbild von [Hochschulewatch.de](https://netaction.github.io/hochschulwatch/) habe ich Graphen erstellt, um die Verquickung von Wissenschaft und Wirtschaft aufzuzeigen.\r\n\r\nIm Workshop möchte ich euch zeigen wie Ihr mit einem bisschen Wissen über Python und matplotlib interaktive und aussagekräftige Graphen zu Wirtschaftlichen und Machtpolitischen Interessen erstellen könnt. Dafür werden wir Daten vom Finanzamt und co. nutzen. Werkzeug: **Jupyternotebooks, Matplotlib oder Plotly**",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 60,
      "code": "C8VK3Z",
      "public_name": "Sw0rdDoom",
      "biography": "Studies Life, especially Computer Science in Bremen at Day, Makes Computers do things at Night.\r\n\r\nI am currently doing my bachelor in Computer Science at the University Bremen. I work there as a student research assistant at the Cyber-Physical Systems Institute of German Research Centre for Artificial Intelligence.   https://www-cps.hb.dfki.de/ where my Research Focus is Software Verification",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}