{
  "id": 1263,
  "guid": "6c5d9e12-9e6e-47b0-8935-8617159686e6",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:DeliberativeDemocracy",
  "logo": null,
  "date": "2019-12-29T12:30:00+01:00",
  "start": "12:30",
  "duration": "1:30",
  "room": "C-base",
  "slug": "36c3-1263-session_deliberativedemocracy",
  "title": "DeliberativeDemocracy",
  "subtitle": "Andre",
  "track": "self organized sessions",
  "type": "workshop",
  "language": "de",
  "abstract": "",
  "description": "About the idea of deliberative democracy, how the concepts can be instantiated within our current political systems, what has happened and will happen in the near future. How this could help us to find civilisational ways to handle the disruptions ahead.\nCurrent environmental, social, and economic crises may be rooted to an institutional crisis of representative democracy. Consistent further development has always been an important constant in the history of democracy. Present climate and ecological crisis threaten our own existence and requires a radical transformation. Current democratic institutions will not suffice to reintegrate into our planet’s boundaries. But how to address this fundamental challenge as a democratic society?A promising option for a sustainable just transition towards global climate justice is a further development of democracy! Extinction Rebellion demands a national ‘citizens assembly’ on climate and ecological justice. Citizens’ Assemblies are innovative processes that can empower people, communities and entire countries to make important decisions in a way that is fair and deeply democratic. The Citizens’ Assembly on Climate and Ecological Justice will bring together ordinary people to investigate, discuss and make recommendations on how to respond to the climate emergency. Similar to jury service, members will be randomly selected from across the country. The process will be designed to ensure that the Assembly reflects the whole country in terms of characteristics such as gender, age, ethnicity, education level and geography. Assembly members will hear balanced information from experts and those most affected by the emergency. Members will speak openly and honestly in small groups with the aid of professional facilitators. Together they will work through their differences and draft and vote on recommendations.The Citizens’ Assembly will be run by non-governmental organizations under independent oversight. This is the fairest and most powerful way to cut through party politics. It will empower citizens to actually work together and take responsibility for our climate and ecological emergency. This isn’t pie in the sky – it’s proven practice. Citizens’ Assemblies around the world have shown that ordinary people can understand complex information, weigh the options, and make informed choices. Examples include Ireland, Canada, Australia, Belgium and Poland.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Andre",
      "public_name": "Andre"
    }
  ],
  "links": []
}