{
  "id": 1065,
  "guid": "6e3896e7-2912-46a3-a20a-49839a263bd8",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Wie_man_ein_klimafreundliches_Haus_baut",
  "logo": null,
  "date": "2019-12-28T20:00:00+01:00",
  "start": "20:00",
  "duration": "0:30",
  "room": "Lecture room M1",
  "slug": "36c3-1065-session_wie_man_ein_klimafreundliches_haus_baut",
  "title": "Wie man ein klimafreundliches Haus baut",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "talk",
  "language": "en",
  "abstract": "",
  "description": ". Der Vortrag beschreibt Möglichkeiten, komfortabel zu bewohnende Häuser fast ohne Heizung zu bauen. In diesem Vortrag werden nur neu zu bauende Gebäude betrachtet. Die gezeigten Methoden sind für Wohn- und Nichtwohngebäude aller Größen verwendbar.\nHeizung von Häusern ist für etwa ein Drittel der Treibhausgasemissionen Deutschlands verantwortlich. Dabei gibt es bessere Möglichkeiten als einfach irgendeinen Brennstoff anzuzünden. Dieses Problem muss und kann gelöst werden. Der Vortrag beschreibt Möglichkeiten, komfortabel zu bewohnende Häuser fast ohne Heizung zu bauen. In diesem Vortrag werden nur neu zu bauende Gebäude betrachtet. Die gezeigten Methoden sind für Wohn- und Nichtwohngebäude aller Größen verwendbar.    Es geht um folgende Details:    * Wärmeverluste: Wo geht die Wärme raus? Wo müssen wir also ran?    * Zuerst isolieren: Wände, Fenster, Dach, Boden    * Dann Wärme zurückgewinnen: Maschinelle Lüftung mit Wärmerückgewinnung    * Vorhandene Wärme nutzen: Solare und innere Gewinne    * Restwärmebedarf und Warmwasser erzeugen    * Wie lebt es sich darin? Thermoskannengefühl oder komfortabel?, Langzeiterfahrungen    * Standards: KfW-Effizienzhaus, Passivhaus, Efffizienzhaus-Plus    * \"Free Money\": Heizkosten, Mehrkosten und Zuschüsse beim Bau in Deutschland    * Warum nicht einfach erneuerbare Energie für die Wärmeerzeugung nehmen?",
  "persons": [],
  "links": []
}