{
  "id": 356,
  "guid": "6eeb1e22-ff82-54be-af15-08e562eca26f",
  "logo": "",
  "date": "2019-12-30T12:00:00+01:00",
  "start": "12:00",
  "duration": "00:30",
  "room": "OIO Stage",
  "slug": "GGV8G3",
  "url": "https://talks.oio.social/36c3-oio/talk/GGV8G3/",
  "title": "Cryptography of Killing Proof-of-Work [YBTI/wefixthenet session]",
  "subtitle": "",
  "track": "Security",
  "type": "Talk 20 minutes + 5 minutes Q&A",
  "language": "en",
  "abstract": "We briefly discuss the range of cryptographic primitives being used by protocols that seek to make proof-of-work protocols obsolete. We shall focus primarily on these cryptographic building blocks themselves, not overly on the different protocols built form them.",
  "description": "There are a handful of protocols consuming enormous amounts of energy in proof-of-work schemes, which provide only rather tenuous security assurances. In practice, proof-of-work also invalidates these protocols original goal of being distributed.\r\n\r\nThere is also a zoo of protocols designs, both new and from the 80s, that provide far stronger security than proof-of-work at minimal cost. We shall discuss the distinctive cryptographic primitives used by these protocols, without examining any of these critters too closely.\r\n\r\nIn essence, our taxonomy splits as blind signatures vs. verifiable random functions (VRFs) vs. randomness beacons, with the latter consisting of publicly verifiable secret sharing (PVSS) and verifiable delay functions (VDFs). We only have time for a cursory look at the mathematics usable to build each of these, but this should explain some of their uses, strengths, and weaknesses.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 128,
      "code": "MCE83P",
      "public_name": "dvn",
      "biography": "p2p communications and privacy researcher and developer\r\n\r\nCurrently organizing a \"youbroketheinternet/wefixthenet\" session at 36c3, representing GNUnet.",
      "answers": []
    },
    {
      "id": 130,
      "code": "BQ99TB",
      "public_name": "Jeffrey Burdges",
      "biography": "Jeff Burdges is an applied cryptography researcher working with the [Web3 foundation](https://research.web3.foundation/en/latest/), where he works on cryptography for decentralized and/or privacy preserving protocols.\r\n\r\nJeff's work often involves collaborative randomness, specialized signature schemes like verifiable random functions (VRFs) or anonymous credentials, and increasingly both zero-knowledge proofs and incentives or mechanism design using VRFs.  Jeff is also researching a peer-to-peer private messaging service that will use mix networks.\r\n\r\nJeff previously worked on [Taler](https://taler.net/en/) and [GNUNet](https://gnunet.org/en/) as a postdoc for Christian Grothoff at Inria, Rennes, where he worked on anonymity protocols primarily mix networks, blind signatures, security proofs, distributed authentication, forward-secure ratchets, and pairing-based protocols.  Jeff holds a PhD degree in Mathematics from Rutgers University in New Jersey.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}