{
  "id": 1092,
  "guid": "729d330b-b0a8-4b77-afec-158982b9d2b4",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:(Python)_Programming_for_Absolute_Beginners",
  "logo": null,
  "date": "2019-12-28T10:00:00+01:00",
  "start": "10:00",
  "duration": "1:30",
  "room": "Lecture room M2",
  "slug": "36c3-1092-session_python_programming_for_absolute_beginners",
  "title": "(Python) Programming for Absolute Beginners",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "workshop",
  "language": "de",
  "abstract": "",
  "description": "In this workshop, addressed at (absolute) beginners, you will get your feet wet in (Python) programming. Don't worry, everyone who wants to have a (first?) look at programming is welcome independently of their skills or background.\n''(While this abstract is in English, this workshop will be held either in English or German; depending on who wants to participate!)''This workshop is intended as a first introduction to (Python) programming '''for absolute beginners'''. While C3 traditionally is a 'tech/hacker conference', more and more people without a background in programming attend - as far as I'm concerned, this is awesome!While you certainly don't have to be a 'coder' to be a part of congress (or to be a hacker), programming is still fun, wonderfully creative, and also an extremely valuable skill. Don't be afraid to give it a go!Of course, by the end of this 90-minute workshop, you will not be a programmer. You will, however, have attempted a deep dive into (Python) programming, learned some basics, and set yourself up for further learning (if you choose to do so).'''About Me'''<br>My name is Ingo, and I'm currently working at Heidelberg University as a computational/corpus linguist and teacher educator. I'm particularly involved with teacher education/training and foreign language teaching.My love for Python stems from my work as a (computational) linguist and various projects I've been involved with. :)'''Required Previous Knowledge'''<br>No previous knowledge is required!'''Technical Requirements'''<br>If you want to participate actively (i.e., code along), you should bring a device that is capable of running a modern browser and has Internet access. Being able to type comfortably is also recommended ;). Alternatively, any device capable of running Python 3.6+ (ideally in a Jupyter Notebook) will do just fine!'''Material'''<br>All material (e.g., slides) will be provided on this page after the workshop. Please also check back here a day before the workshop because I will provide some additional material useful for active participation.Ps. This is a slightly updated version of the workshop(s) I gave at 35c3 last year.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Ingo",
      "public_name": "Ingo"
    }
  ],
  "links": []
}