{
  "id": 1413,
  "guid": "7590b13e-fed5-43d9-8e90-375aeedb0771",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:FFF-Demo",
  "logo": null,
  "date": "2019-12-29T11:00:00+01:00",
  "start": "11:00",
  "duration": "2:00",
  "room": "Assembly:City center",
  "slug": "36c3-1413-session_fff_demo",
  "title": "FFF-Demo",
  "subtitle": "$password=saveForFuture",
  "track": "self organized sessions",
  "type": "outside",
  "language": "",
  "abstract": "",
  "description": "„$password=saveForFuture“: Peaceful “Fridays for Future” protest for climate justice (better climate politics) in the city. Officially registered at the relevant government agency, legal to attend for citizens of any country.Deteils:Angemeldete Demonstration im Rahmen von Fridays for Future in der Stadt; Termin am Vormittag, damit 36c3-Besuchende direkt morgens von der Schlafgelegenheit zur Demo können und nach der Demo weiter zum Messegelände.\nDemonstration im Rahmen von Fridays for Future in der Stadt; Termin am Vormittag, damit 36c3-Besuchende direkt morgens von der Schlafgelegenheit zur Demo können und nach der Demo weiter zum Messegelände.Thematisch orientiern wir uns dann auch mehr am Thema des Chaos Communication Congress, welcher \"Resource Exhaustion\" zum eigenen Motto gemacht hat. Somit widmen wir uns eben der Digitalisierung und deren Auswirkungen auf den menschgemachten Klimawandel. The strike is part of the local Friday For Future group. The date and time were chosen to take care of the visitors of 36c6. Simply to stand up, strike and move on to the congress.Having the topic of the chaos communication congress \"Resource Exhaustion\" in mind, the strike will focus on that topic also – especially the responsibility of digitalization on the human-made climate crisis.* '''Ort/Location:''' [https://www.openstreetmap.org/#map=19/51.34390/12.37910 Willy-Brandt-Platz, Leipzig]* '''Zeit/Time:''' 11:00 CET* '''Datum/Date:''' 2019-12-29",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:E1mo",
      "public_name": "E1mo"
    }
  ],
  "links": []
}