{
  "id": 1549,
  "guid": "784c8269-4616-42a8-a7bd-3b0cfaae3170",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Wondrous_Mathematics:_Gro%C3%9Fe,_sehr_gro%C3%9Fe_und_sehr_sehr_gro%C3%9Fe_Zahlen",
  "logo": null,
  "date": "2019-12-28T14:30:00+01:00",
  "start": "14:30",
  "duration": "0:30",
  "room": "Seminar room 13",
  "slug": "36c3-1549-session_wondrous_mathematics_grosse_sehr_grosse_und_sehr_sehr_grosse_zahlen",
  "title": "Wondrous Mathematics: Große, sehr große und sehr sehr große Zahlen",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "talk",
  "language": "de",
  "abstract": "",
  "description": "(für Erwachsene und Kinder) Dieser Kurzvortrag ist für alle, die als Kind Spaß am Spiel \"wer die größere Zahl sagen kann\" hatten.\nDieser Kurzvortrag nimmt dich auf eine Tour durch die wundersame Welt der supra-astronomisch Gehirn-überwältigenden großen Zahlen mit. Wenn du neu im Geschäft der absurd großen (aber noch endlichen) Zahlen bist, dann bereite dich darauf vor, von \"Hyperoperatoren\" und \"Grahams Zahl\" völlig erstaunt zu sein. (Grahams Zahl ist eine Zahl die so groß ist, dass nicht mal die Anzahl ihrer Stellen in unser Universum passt.) Und falls du schon seit Urzeiten mit Grahams Zahl vertraut bist: Stell dich auf Zahlen ein, gegen die Grahams Zahl im Vergleich völlig verblasst, ja winzig und völlig irrelevant erscheint.Einige der Zahlen, die behandelt werden, sprengen die Grenzen der Berechenbarkeit, sogar der rein theoretischen Berechenbarkeit, und andere sogar die Grenzen der Logik.In der Nacht wird es eine [[Session:Wondrous_mathematics:_Fun_with_transfinite_games|Schwesterveranstaltung zu unendlich großen Zahlen]] geben (auf Englisch, gespickt mit transfiniten Spielen). In diesem Kurzvortrag bleiben wir im Reich des Endlichen.'''[https://rawgit.com/iblech/mathezirkel-kurs/master/35c3/large-numbers/slides-weihnachtsvorlesung2019.pdf Vortragsfolien]'''",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Iblech",
      "public_name": "Iblech"
    }
  ],
  "links": []
}