{
  "id": 752,
  "guid": "78b3c768-391a-5ac5-b9f3-1efd7014a70f",
  "logo": "/media/36c3/images/38KMGV/image002.jpg",
  "date": "2019-12-27T18:00:00+01:00",
  "start": "18:00",
  "duration": "01:00",
  "room": "ChaosZone Bühne",
  "slug": "38KMGV",
  "url": "https://cfp.chaoszone.cz/36c3/talk/38KMGV/",
  "title": "Bridging equality to the Middle East through volunteer-driven technology education: lessons learned from a revolutionary Beirut",
  "subtitle": "",
  "track": null,
  "type": "Vortrag 60min  (inkl. Q&A)",
  "language": "en",
  "abstract": "Lebanon is experiencing a revolution, a system shift, from which the Western media remains largely silent. Entrepreneurs, particularly women are playing a critical role now when the society will be rebuilt. To support the much-needed creation of solutions to tackle corruption, inequality and the lack of democracy, a team of rebel academics and culture hackers, both men and women, have established a cross-country knowledge-sharing platform called WTSUP!. We will share experiences of doing culture hacking in Lebanon and hear what is the current entrepreneurial reality for women in Beirut via live stream.",
  "description": "The talk is about stories from Beirut, related to WTSUP! platform, which is a volunteer-powered initiative that focuses on the education of women entrepreneurs via events and in the future via cross-country programs. How exactly? We will present, both live on stage and with a connection from Beirut with Priscilla Sharuk, issues related to building a community around equality, volunteerism, and transparency.  The talk also covers the pilot event 2019, where the education consistent specific tech lectures, but also aspects such as sexual harassment and corruption. The initiative is research-driven, where the research aim is to study how empowering women through tech-driven entrepreneurship and leverage the societal status might affect on peacebuilding in the region. \r\n\r\nFinally, the presentation looks positively towards the future changes and to the forthcoming non-commercial event in Beirut, March 2020 that has a core focus on sustainability and content is aligned with UNs Sustainable Development Goals. In addition to giving training on entrepreneurship and resilience, there are also sidetracks on governance innovations. Content is participatory, the 2020 event is open for volunteers from Europe and Lebanon to suggest workshops or mentoring for local female talents. The long term aim is to bridge technology-driven communities between the Nordics, Germany and Lebanon, and in the future scale the initiative wider to the MENA region.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 61,
      "code": "KPHEXT",
      "public_name": "Jukka-Pekka Heikkilä",
      "biography": "A scholar, co-creator, culture hacker and entrepreneurship educator specialized in extreme settings.\r\n\r\nJukka-Pekka has taught entrepreneurship courses and organized startup and science diplomacy events in Pyongyang between 2012 - 2017. He is a co-founder of WTSUP! Beirut that aims to foster equality and volunteerism culture in the Middle East and a founder of Burning Stories research project that aims to study the transformation of Burning Man participants and its impact on the society. From academic stamps, Jukka-Pekka is a Newton Fellow of the Royal Society (UK) and British Academy, an Academy of Finland post-doctoral Fellow based in Aalto University, Finland, and a visiting scholar at Stanford University. In Finland, he works as a board member with The Shortcut, a sister organisation of Slush and an initiative that aims to integrate immigrants to the Finnish society via tech entrepreneurship education.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}