{
  "id": 1010,
  "guid": "78f23d24-3e17-53a6-8cbc-5ffc5fd0226c",
  "logo": "/media/36c3/images/78BJ3S/RR_Cover.jpeg",
  "date": "2019-12-28T21:45:00+01:00",
  "start": "21:45",
  "duration": "01:00",
  "room": "Bühne",
  "slug": "78BJ3S",
  "url": "https://fahrplan.das-sendezentrum.de/36c3/talk/78BJ3S/",
  "title": "Reichlich Randale – Der feministische Jahresrückblick",
  "subtitle": "",
  "track": "Bühne Sendezentrum",
  "type": "Normale Länge",
  "language": "de",
  "abstract": "Von antifeministischen Hasskampagnen bis zu Mental Load, von unangemessenen Preisvergaben bis zu intersektionalen Fragezeichen, von Megan Rapinoe bis zu Greta Thunberg – es gibt viel zu besprechen. Zeit für einen empowernden feministischen Jahresrückblick!",
  "description": "„Reichlich Randale“ ist ein Personal-Pöbel-Podcast – inklusive exklusiver Becci-Rants.\r\n„Reichlich Randale“ ist feministisch, fußballverliebt, immer unterwegs, cinephil, laut, politisch, offen. Weil ich es bin.\r\n„Reichlich Randale“ erzählt euch ein bisschen aus meinem Leben, aber es fühlt sich gleichzeitig nach viel mehr an.\r\n\r\nHi, ich bin Becci (@genderbeitrag) und veranstalte mittlerweile traditionell auf dem Congress im Rahmen meines Podcasts „Reichlich Randale“ einen feministischen Jahresrückblick mit tollen Gäst*innen. Von antifeministischen Hasskampagnen bis zu Mental Load, von unangemessenen Preisvergaben bis zu intersektionalen Fragezeichen, von Megan Rapinoe bis zu Greta Thunberg – es gibt viel zu besprechen. Ich freue mich darauf, mich mit euch über empowernde Gedanken und Strukturen auszutauschen. Für intersektionale Solidarität und Freund:innenschaft!",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 109,
      "code": "VYP9NR",
      "public_name": "Becci (@genderbeitrag)",
      "biography": "Ihr könnt mich sonst noch bei FRÜF – Frauen reden über Fußball (ein Fußball-Frauen-Kollektiv), bei den Filmlöwinnen (feministische Filmanalyse), bei den Kulturpessimist:innen und den Klassikern der Filmgeschichte (aktuelle und alte Filme und Serien aus emanzipatorischer Perspektive betrachtet) oder bei einem meiner vielen Cameoauftritte in der deutschsprachigen Podcastwelt hören. Ich mache beruflich was mit Öffentlichkeitsarbeit, zelebriere Kaffee, lebe und liebe intersektionalen Feminismus, singe, vermisse Israel (wo ich mal 1 Jahr gelebt habe), bingewatche Serien, lebe in diesem Internet (und manchmal auch in Brandenburg), esse Hummus, mache gerne Quatsch, mag Nerdkram und Fußball (besonders VfL Wolfsburg und Turbine Potsdam).",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}