{
  "id": 823,
  "guid": "78f69eda-cbbc-5918-ba42-b7bf08ad174b",
  "logo": "",
  "date": "2019-12-27T13:00:00+01:00",
  "start": "13:00",
  "duration": "02:00",
  "room": "nokingdome",
  "slug": "SYPPL7",
  "url": "https://talks.komona.org/36c3/talk/SYPPL7/",
  "title": "Fashion Hacktivism - House of All / Make a Kimona - CoDesign?!",
  "subtitle": "",
  "track": null,
  "type": "Workshop",
  "language": "en",
  "abstract": "Let's hack the fashion system. Deep dive into collaborative design. In this workshop we explore methods of collaborative fashion hacktivism creating Kimonas for the House of All - Clothes Commons Assembly. It's part of an experiment by House of Zsa to involve as many people as possible in designing a new system for fashion. This is a hands on workshop where you engage in crafting pieces to protect, sense, feel, show, dance, live in. You don't need to have any former knowledge and it's all but complicated. It's for everyone. like fashion should be.",
  "description": "++ Let's hack the fashion system ++ Deep dive into collaborative design. In this workshop we explore methods of collaborative fashion hacktivism creating Kimonas for the House of All - Clothes Commons Assembly. It's part of an experiment by House of Zsa to involve as many people as possible in designing a new system for fashion. This is a hands on workshop where you engage in crafting pieces to protect, sense, feel, show, dance, live in. You don't need to have any former knowledge and it's all but complicated. It's fun & for everyone - like fashion should be. Max. 12 people.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 30,
      "code": "UF97ME",
      "public_name": "Sarah Bürger",
      "biography": "How do we cope with singularity? What is the value of things & what is their role in our relationships? How can we design futures that involve everybody and be gentle to all & everything there is...these are some of the questions that drive me whilst working in my favorite field of cloth. I research ways of hacking the fashion system and strive for a decentralized system of garment use. Mission: Beautifully crafted sustainable cloth to everyone - no to capitalism. Vision: Clothes Commons, Collaborative Fashion System, Decentralized Production, No Work.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}