{
  "id": 872,
  "guid": "7ac5799e-efb3-5886-b7d6-0816f4270bb3",
  "logo": "",
  "date": "2019-12-28T17:00:00+01:00",
  "start": "17:00",
  "duration": "01:00",
  "room": "headnut",
  "slug": "K9ZVRH",
  "url": "https://talks.komona.org/36c3/talk/K9ZVRH/",
  "title": "Museum of Care: The Women's Revolution of Rojova",
  "subtitle": "",
  "track": null,
  "type": "Session",
  "language": "en",
  "abstract": "They have the guns. We have the poets. Therefore, we will win. - Howard Zinn\r\nWhy is art so important, anyway?\r\n\r\nReading the Western media about the civil war in Syria, it might have seemed that the most horrifyingly violent events that occurred were not even the mass killing and torture of civilians, but the destruction of the art and historical artifacts; objects that were considered to be, unlike the mere pain and suffering of Syrians, a matter of concern for the whole of humanity.\r\n\r\nWith Kurdish Tea and Snacks",
  "description": "This might seem perverse, and in many ways it is, but it worth reflection why it is that only things we refer to as “art” seem to evoke the notion of a common human spirit.\r\n\r\nAnd if we do grant art this special status, more important even than individual human lives, we need to reflect equally on how we define “art”, which means not just to which objects we grant this status, but equally, to which we do not.\r\n\r\nWe are all trained to believe that art is rare and special and priceless. This is why we protect and maintain it in museums. But at the same time, there is always a parallel notion of art as an aspect of everything we do, as cultural expression, of artistry as an aspect of how we (all people) dress, the songs we sing, the language we employ. In this sense, art is the way we connect socially; in fact, it is constantly being created and recreated in any social interaction.\r\n\r\nIt's important to bear in mind here that the very idea of “culture” is relatively recent, and the notion of art in the contemporary sense even more so. As we have emphasized in earlier essays, while we are taught to see artistic “genius” as the ultimate scarce resource, in fact, there is an endless abundance of art all around us.\r\n\r\nWhat produces scarcity is not a shortage of artistic creations, but rather, the specific forms of distribution and maintenance of art. It is not a lack of resources, but a matter of political choices. In this sense, the apparent scarcity of art and culture is created by the same mechanisms as create artificial shortages of money, food, or education, in a mutually reinforcing vicious circle that, we feel, must be overcome.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nWhat is the Museum of Care?\r\n\r\n\r\n\r\nWe produce a cup only once,\r\n\r\nbut we wash and dry it a thousand times.\r\n\r\n\r\n\r\n\r\n\r\nOur Museum is meant to travel, to be taken home, to be donated, to be developed and reorganized. We aim to create a space that could be used as a space of care and a space for public wellbeing.\r\n\r\nDa Vinci painted his Mona Lisa once, and then for centuries, people have written about it, argued about it, researched it, made jokes about it, and jigsaw puzzles out of it, used it in their own artworks, loved it, and taken care of it.\r\n\r\nAll this involved an enormous amount of work. Without that work, Mona Lisa would never have been so important to humanity, but would have shared the same fate as innumerable other works of art, many perhaps just as (potentially) enchanting, that were either lost and physically destroyed, and which we have never therefore heard of.\r\n\r\nThe Mona Lisa, as a painting, does not contain any inherent magical powers by itself; what we call \"the Mona Lisa\" is not simply a work by Leonardo, but a combination of efforts of innumerable people in every part of the world and many different historical epochs.\r\n\r\nThere are many ways to conceptualize this labor, but it seems to us it is best seen as a form of caring labor.\r\n\r\nLike most forms of caring labor, it is performed, disproportionately, by women. The overwhelming majority of those recognized as artists in the world today are male, but the overwhelming majority of those who take care of art: the teachers, guides, art researchers, art historians, museum workers, artist's wives, and \"muses\" (whatever shape or form that takes)—not to mention exhibition visitors—are women.\r\n\r\nIf art is so crucial for humanity, can we create a space for new art that would not be like this?\r\n\r\nBy saying this, we don't mean just some a new style of art, or art whose recognized producers have different names or identities, but an art that would itself be able to reorganize existing power structures, by prioritizing the values of care and maintenance over production, extraction and patriarchal order.\r\n\r\nOne of the few places in the world where this kind of Museum would be entirely at home is Rojava: a place where a women's revolution has not only succeeded in taking control of an extensive territory, but continued to survive for almost a decade.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 15,
      "code": "NW9YKF",
      "public_name": "ekes",
      "biography": null,
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}