{
  "id": 1014,
  "guid": "7e748a07-89f3-51bb-927a-f8560617f180",
  "logo": "/media/36c3/images/HSYE8L/NSU_Podcast_serif.png",
  "date": "2019-12-29T20:30:00+01:00",
  "start": "20:30",
  "duration": "01:00",
  "room": "Bühne",
  "slug": "HSYE8L",
  "url": "https://fahrplan.das-sendezentrum.de/36c3/talk/HSYE8L/",
  "title": "NSU-Watch: Aufklären & Einmischen - Der NSU-Watch Jahresrückblick 2019",
  "subtitle": "",
  "track": "Bühne",
  "type": "Normale Länge",
  "language": "de",
  "abstract": "NSU-Watch: Aufklären & Einmischen. Der Podcast über den NSU-Komplex, rechten Terror und Rassismus\r\nhttps://www.nsu-watch.info/podcast/",
  "description": "Das Netzwerk des NSU wurde nicht aufgedeckt und rechtem Terror nicht die Grundlage entzogen. Diese beiden Fakten hatten 2019 massive Konsequenzen und kosteten Menschenleben. Im Juni wurde der Kasseler Regierungspräsident Walter Lübcke von einem Neonazi hingerichtet und im Oktober wurden Jana L. und Kevin S. bei einem antisemitischen und rassistischen Anschlag in Halle ermordet. Recherchen deckten weitere Details zu den rechten Netzwerken in Polizei und Bundeswehr, bekannt unter Namen wie \"Nordkreuz\" oder \"NSU 2.0\", auf. Weltweit verloren dutzende Menschen ihr Leben, weil Rassisten einen \"Großen Austausch\" herbei phantasieren, den sie stoppen wollen. Sie alle werden angeheizt durch eine gesellschaftliche rechte Mobilisierung.\r\n\r\nUnd was wird medial und von Politiker*innen diskutiert? Der Verfassungsschutz soll besser ausgestattet werden und nebenbei kehrte die längst überwunden geglaubte \"Killerspiel-Debatte\" zurück. Die AfD, auch bekannt als \"parlamentarischer Arm des Rechtsterrorismus\" sitzt in allen Parlamenten und Talkshows.\r\n\r\nIm Jahresrückblick des Podcasts \"NSU-Watch: Aufklären&Einmischen\" wollen wir auf dieses von rechtem Terror geprägte Jahr zurückblicken und auch fragen: Womit haben wir es zu tun? Wie können wir dagegen angehen? Wir blicken auch auf das Jahr 2020, in dem viele dieser Ereignisse weiterhin uns aber auch die Gerichte beschäftigen werden.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 112,
      "code": "TYSUD7",
      "public_name": "Caro Keller",
      "biography": "Caro Keller ist seit 2013 Teil des antifaschistischen Bündnisses NSU-Watch, seit Ende 2016 dort auch Redakteurin, verantwortlich u.a. für Website- und Social Media Output sowie den Podcast \"NSU-Watch: Aufklären & Einmischen  -Der Podcast über den NSU-Komplex, rechten Terror und Rassismus\". \r\n\r\nDas bundesweite antifaschistische Bündnis „NSU-Watch: Aufklären und Einmischen” recherchiert Hintergründe und dokumentiert aktuelle Entwicklungen zum NSU-Komplex und rechtem Terror. NSU-Watch begleitet die verschiedenen juristischen und parlamentarischen Aufklärungsbemühungen von rechtem Terror kritisch. Die unabhängige Beobachtungsstelle wurde von antifaschistischen und antirassistischen Projekten aus dem gesamten Bundesgebiet gegründet, die teilweise seit mehr als zwei Jahrzehnten die extreme Rechte beobachten.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}