{
  "id": 863,
  "guid": "7e8e1f35-89a4-538b-a3f8-a5a2cc2df862",
  "logo": "",
  "date": "2019-12-29T18:00:00+01:00",
  "start": "18:00",
  "duration": "01:00",
  "room": "headnut",
  "slug": "SGQQW9",
  "url": "https://talks.komona.org/36c3/talk/SGQQW9/",
  "title": "Lesung: Transhumanistische Mythologie",
  "subtitle": "",
  "track": null,
  "type": "Session",
  "language": "de",
  "abstract": "Lesung und Diskussion über das Buch Transhumanistische Mythologie - Rechte Utopien einer Erlösung durch künstliche Intelligenz (Unrast Verlag 2019)",
  "description": "Unter den neuen Machteliten, die das Silicon Valley hervorgebracht hat, macht neuerdings eine Sorge die Runde, die nichts Geringeres betrifft als die Zukunft der Menschheit: Was, wenn die Erforschung künstlicher Intelligenz am Ende eine künstliche Gottheit hervorbringt, die uns alle vernichtet?\r\n\r\nWährend die einen vor dem Untergang warnen, prophezeien die anderen, dass uns die göttlichen Maschinen in ein digitales Himmelreich führen werden. Doch bei genauem Hinsehen entpuppt sich die Vision beider Seiten als Mythologie ohne Bezug zur Realität. Trotzdem werden unter dem Deckmantel des Kampfes gegen die digitale Apokalypse autoritäre Politikformen normalisiert, Ausbeutung vorangetrieben und Eugenik salonfähig gemacht.\r\n\r\nDas vorliegende Buch ist eine ideologiekritische Analyse der Mythologien um superintelligente KI. Dabei zeigt sich, dass die Grundlagen dieser Mythologien keineswegs so neu sind, wie ihr Gegenstand uns glauben machen könnte. Vielmehr wiederholen sich hier – in technologischem Gewand und scheinbar säkularisiert – alte Ideen der protestantischen Rechten. Noch drehen sie sich nur um die Zurichtung für die Erfordernisse des digitalisierten Kapitalismus und die Radikalisierung seines Glücksversprechens. Doch die Grundlagen für eine autoritäre Wende sind im Glauben an die Superintelligenz bereits angelegt.\r\n\r\nEs wird Zeit, die Ideologie des Transhumanismus genauer in den Blick zu nehmen, weil sie das Potenzial hat, sich zu einer Herrschaftsmythologie des digitalen Zeitalters zu entwickeln.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 54,
      "code": "JVFKYL",
      "public_name": "Max Schnetker",
      "biography": "Max Franz Johann Schnetker promoviert über Digitalisierung und Menschenbilder, ist ansonsten Anarchist und immer mal wieder in diversen Projekten aktiv.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}