{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10855.html",
  "id": 10855,
  "guid": "7f3817cf-bab4-42f3-b4d8-95cfb1cee28b",
  "logo": "/system/events/logos/000/010/855/large/LB__01-7_icons-chrome_128px.png?1574197515",
  "date": "2019-12-28T19:10:00+01:00",
  "start": "19:10",
  "duration": "00:40",
  "room": "Eliza",
  "slug": "36c3-10855-listening_back_browser_add-on_tranlates_cookies_into_sound",
  "title": "Listening Back Browser Add-On Tranlates Cookies Into Sound ",
  "subtitle": "The Sound of Surveillance",
  "track": "Art & Culture",
  "type": "lecture",
  "language": "en",
  "abstract": "‘Listening Back’ is an add-on for the Chrome and Firefox browsers that sonifies internet cookies in real time as one browses online. By translating internet cookies into sound, the ‘Listening Back’ browser add-on provides an audible presence for hidden infrastructures that collect personal and identifying data by storing a file on one’s computer. Addressing the proliferation of ubiquitous online surveillance and the methods by which our information flows are intercepted by mechanisms of automated data collection, ‘Listening Back’ functions to expose real-time digital surveillance and consequently the ways in which our everyday relationships to being surveilled have become normalised. This lecture performance will examine Internet cookies as a significant case study for online surveillance with their invention in 1994 being historically situated at the origins of automated data collection, and the commercialisation of the World Wide Web. I will integrate online browsing to demonstrate the ‘Listening Back’ add-on and explore it’s potential to reveal algorithmic data capture processes that underlie our Web experience.",
  "description": "‘Listening Back’ is an add-on for the Chrome and Firefox browsers that sonifies internet cookies in real time as one browses online. Utilising digital waveform synthesis, ‘Listening Back’ provides an audible presence for hidden infrastructures that collect personal and identifying data by storing a file on one’s computer. By directing the listener’s attention to hidden processes of online data collection, Listening Back functions to expose real-time digital surveillance and consequently the ways in which our everyday relationships to being surveilled have become normalised. Our access to the World Wide Web is mediated by screen devices and ‘Listening Back’ enables users to go beyond the event on the screen and experience some of the algorithmic surveillance processes that underlie our Web experience.  This project therefore explores how sound can help us engage with complex phenomena beyond the visual interface of our smart devices by highlighting a disconnect between the graphical interface of the Web, and the socio-political implications of background mechanisms of data capture. By sonifying a largely invisible tracking technology ‘Listening Back’ critiques a lack of transparency inherent to online monitoring technologies and the broader context of opt in / default cultures intrinsic to contemporary modes of online connectivity. By providing a sonic experiential platform for the real-time activity of Internet cookies this project engages listening as a mode of examination and asks what is the potential of sound as a tool for transparent questioning? ",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9518,
      "public_name": "Jasmine Guffond"
    }
  ],
  "links": [
    {
      "url": "https://chrome.google.com/webstore/detail/listening-back/gdkmphlncmoloepkpifnhneogcliiiah",
      "title": "Listening Back Chrome Browser Add-On"
    },
    {
      "url": "https://addons.mozilla.org/en-GB/firefox/addon/listening-back/",
      "title": "Listening Back Firefox Browser Add-On"
    },
    {
      "url": "http://jasmineguffond.com/",
      "title": "jasmineguffond.com"
    }
  ],
  "attachments": []
}