{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10896.html",
  "id": 10896,
  "guid": "7f7de0de-2955-40be-8df1-fabe740b0b83",
  "logo": null,
  "date": "2019-12-27T17:30:00+01:00",
  "start": "17:30",
  "duration": "01:00",
  "room": "Dijkstra",
  "slug": "36c3-10896-climate_modelling",
  "title": "Climate Modelling",
  "subtitle": "The Science Behind Climate Reports",
  "track": "Science",
  "type": "lecture",
  "language": "en",
  "abstract": "When climate activists say you should listen to the science they usually\r\nrefer to reports by the Intergovernmental Panel on Climate Change (IPCC). The IPCC is an Intergovernmental organization (IGO) providing an objective summary of scienctific results regarding climate change, its impacts and its reasons. The simulation of future climate is one\r\nfundamental pillar within climate research. But what is behind it? How does the science sector look like? How do we gain these insights, what does it mean?",
  "description": "This lecture aims at answering these questions. In particular, it\r\nprovides an overview about some basic nomenclature for\r\na better understanding of what climate modelling is about.<br>\r\n\r\nThe following topics will be addressed:\r\n<ul>\r\n<li>Who does climate modelling?<br>\r\nWhich institutes, infrastructures, universities, initiatives are\r\nbehind it and which are the conferences climate scientists go to. What\r\nbackground do climate scientists have?\r\n</li>\r\n\r\n<li>What is the difference between climate projections and weather\r\npredictions? Why is it called a climate projection\r\nand not climate prediction? While climate scientists are not able to\r\npredict weather at a specific date in a decade, why does it\r\nstill make sense to propose general trends under certain conditions?\r\n</li>\r\n\r\n<li>What is a climate model, what is an impact model and what is the\r\ndifference between these? What are components and features\r\nof the different kind of models? Here, some examples will be shortly\r\npresented (e.g.atmosphere, ocean, land, sea ice).\r\n</li>\r\n\r\n<li>Quite a few models are open source and freely accessible. If there is\r\ntime I will shortly show you how you\r\ncould install an impact model (example mHM) on your local PC. How\r\naccessible is the data used for the projections\r\nfor the IPCC reports?</li>\r\n\r\n<li>Overview over the used infrastructure (for example JUWELS, a\r\nsupercomputer in Jülich), programming languages, software components\r\n</li>\r\n</ul>",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9647,
      "public_name": "karlabyrinth"
    }
  ],
  "links": [],
  "attachments": []
}