{
  "id": 372,
  "guid": "809d07c4-a9c7-5004-811e-409aa6bf4296",
  "logo": "",
  "date": "2019-12-30T12:40:00+01:00",
  "start": "12:40",
  "duration": "00:55",
  "room": "OIO Stage",
  "slug": "B3TZGV",
  "url": "https://talks.oio.social/36c3-oio/talk/B3TZGV/",
  "title": "Going fully Foss! A non-profits adventure in building a completely FOSS IT environment.",
  "subtitle": "",
  "track": null,
  "type": "Talk 45 minutes + 10 minutes Q&A",
  "language": "en",
  "abstract": "In this talk we'll dive into the challenge of going fully FOSS. We'd like to introduce you to the principles behind our decision to choose FOSS. We'll explain the why and how, focusing on ethics as well as our tech stack. We'll share what daily trials and tribulations we had to overcome, how our organization coped with these changes, and what our day to day work now looks like. We'll give an honest review of the cost of choosing FOSS over proprietary software. We'll also detail our migration experience and talk about our efforts to build a global network of other non-profits using FOSS. Finally we'd like to talk about our relationship with the FOSS community. Our goal of sharing our FOSS adventure is to show other organizations that it is important and possible to choose ethical IT alternatives.",
  "description": "Imagine if you could banish all proprietary software out of your workplace and use only free and opensource software. Would it be possible? How would you build this? What technical skills do you need? Will your coworkers appreciate the change? Can you rely on free and opensource apps in a production environment without support? These were all questions we had to answers when we embarked on our FOSS adventure. In 2017 the Mama Cash foundation committed itself to building an entirely new IT environment with as much free and opensource software as possible. Through our activism we recognized the importance of FOSS for non-profits who can't rely on proprietary cloud solutions, for privacy, ethical or financial reasons. As we committed ourselves to the Feminist Principles of the Internet, we quickly realized that using FOSS was the preferred option. The FOSS community has been immensely successful in advocating the use of opensource alternatives. However, implementing these in a business settings is a whole different story. While many organizations would like to contribute to a GAFAM-less world, a combination of lack of experience, knowledge and support prevents them from doing so. Our objective is to show the world that it is possible to build an ethical IT environment that respects open standards, community building and data privacy. \r\n\r\nIn this talk we'll dive into the challenge of going fully FOSS. We'd like to introduce you to the principles behind our decision to choose FOSS. We'll explain the why and how, focusing on ethics as well as our tech stack. We'll share what daily trials and tribulations we had to overcome, how our organization coped with these changes, and what our day to day work now looks like. We'll give an honest review of the cost of choosing FOSS over proprietary software. We'll also detail our migration experience and talk about our efforts to build a global network of other non-profits using FOSS. Finally we'd like to talk about our relationship with the FOSS community. Our goal of sharing our FOSS adventure is to show other organizations that it is important and possible to choose ethical IT alternatives.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 137,
      "code": "PCJYPA",
      "public_name": "segal",
      "biography": "Ich reiche Vorträge für about:freedom hier ein.",
      "answers": []
    },
    {
      "id": 146,
      "code": "8VCF8M",
      "public_name": "Gina Plat",
      "biography": null,
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}