{
  "id": 1404,
  "guid": "8373a1a1-5f03-481c-8a2f-c65888d0c9dd",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Video_Editing_for_Absolute_Beginners",
  "logo": null,
  "date": "2019-12-28T21:30:00+01:00",
  "start": "21:30",
  "duration": "0:30",
  "room": "Seminar room 14-15",
  "slug": "36c3-1404-session_video_editing_for_absolute_beginners",
  "title": "Video Editing for Absolute Beginners",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "workshop",
  "language": "en",
  "abstract": "",
  "description": "All the fundamental basics of editing videos to get you started editing your own masterpieces.\n'''!Important!:''' You need to have kdenlive (it's free, afaik available on all Linux and Ubuntu etc devices) or any other video editing software installed to try the contents of this session yourself. We won't have time to install software on your laptop or troubleshoot start-up errors. Any video editing software should be fine, but we will work with kdenlive as it is free.This is for absolute beginners. If you know how to cut together a few clips and add some effects, this session might be boring for you.If you can, find some video files on your laptop before the session starts that you can use as an example. You can also just download something from the Internet, like one of the 36c3 talks or look for free stock footage, like on [https://www.videvo.net/ videvo.net]. We won't have enough time to actually edit anything anyone would watch, we'll just mess around a bit.In this session we will look at the most basic things you should know to edit a video and a few things more:- basic editing and exporting your projects- adding music and sounds- adjusting volume and speed- adding text and pictures- simple effects like moving things around using keyframes- quick look at greenscreen removal",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Taulex",
      "public_name": "Taulex"
    }
  ],
  "links": []
}