{
  "id": 832,
  "guid": "849beefc-ef58-5e06-818b-c0dc21fd1a87",
  "logo": "",
  "date": "2019-12-28T13:00:00+01:00",
  "start": "13:00",
  "duration": "00:45",
  "room": "soupworx",
  "slug": "Q3RDGV",
  "url": "https://talks.komona.org/36c3/talk/Q3RDGV/",
  "title": "Introduction to OpenAppStack: Self-hosting a private application cloud",
  "subtitle": "",
  "track": null,
  "type": "Talk",
  "language": "en",
  "abstract": "OpenAppStack is a **free and open source (libre) platform** that will offer self-managed, click-and-play provisioning of online applications. Users will be able to easily set up a self-hosted instance of OpenAppStack, so they can keep control over their data. It provides an extensible platform that enables **collaboration like google docs without selling it's users to a 3rd party!** By pre-configuring the installed applications in a **privacy by default** manner and by providing a very simple mechanism to upgrade applications OpenAppStack aims to reduce the pain for administrators that is usually involved in self-hosting collaboration platforms.",
  "description": "Our current focus lies on providing free and open source alternatives for chat, file storage and collaborative document editing and will be extended in the future.\r\n\r\nOpenAppStack applications are managed with Kubernetes, a popular container orchestration system. \r\nOpenappstack sets up a simple, single node Kubernetes cluster with relatively simple configuration which is compatible with future scaling of your cloud and adding new applications.\r\nSetting up a Kubernetes cluster can be hard and can be done in many different ways. To complicate things further, a lot of choices need to be made when configuring your cluster. What Ingress should you use? How are you going to do storage?\r\nWith running applications on self owned infrastructure a new challenge arises: somebody needs to keep the software up to date, configure it to work together and make sure people can use it.\r\n\r\nIn this session we'll show OpenAppStack's design, installation procedure and challenges that come with self-hosted container infrastructure. We'll cover the following topics:\r\n\r\n* Automatic updates\r\n* Single-sign-on\r\n* Monitoring of containerized deployments\r\n* Cloud-native vs. old-school aplications",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 36,
      "code": "D9F87B",
      "public_name": "Varac",
      "biography": "Loves developing FOSS systems and software with a privacy and decentralised focus.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}