{
  "id": 1056,
  "guid": "85fe9ff2-d148-49d4-89df-c4e6284ea3a5",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Das_Freie_Software_1_x_1",
  "logo": null,
  "date": "2019-12-28T17:30:00+01:00",
  "start": "17:30",
  "duration": "1:00",
  "room": "Lecture room 11",
  "slug": "36c3-1056-session_das_freie_software_1_x_1",
  "title": "Das Freie Software 1 x 1",
  "subtitle": "Grundlagen & typische Missverständnisse aufklären",
  "track": "self organized sessions",
  "type": "talk",
  "language": "en",
  "abstract": "",
  "description": "Der Talk ist ein \"Foundation Talk\" vom Präsident der FSFE und  dazu gedacht den Zuhörenden einen leichten Einstieg in die Welt Freier Software zu ermöglichen.\nFreie Software und Open Source - ist das eigentlich das gleiche? GPL, AGPL, LGPL, MIT, Apache und hunderte mehr ... warum braucht Freie Software eigentlich Lizenzen und wir unterscheiden sie sich? Wer benutzt eigentlich Freie Software außer der NASA und dem CCC? Und kann man damit Geld verdienen?Der Talk ist ein \"Foundation Talk\" und ist dazu gedacht den Zuhörenden einen leichten Einstieg in die Welt Freier Software zu ermöglichen. Im zweiten Teil werde ich einige der weitverbreitetsten Missverständnisse zu Freier Software aufgeklär, die sich schon seit Jahren halten und dadurch erschweren, möglichst schnell das Potential Freier Software zu nutzen. Zum Beispiel a) Freie Software sei kostenlos, b) wer Freie Software ändert, muss die Änderungen wieder allen verfügbar machen und c) Freie Software ist (un)sicherer als proprietäre Software oder d) Freie Software ist das überlegene Entwicklungsmodell. Oft hört man auch e) Freie Software bringe einem nichts, wenn man nicht selbst programmieren kann, und so weiter ...Dieser Foundation Talk ist auch dann richtig für dich, wenn Du Dich wunderst warum eine der Aussagen falsch sein soll oder Du Anregungen suchst, wie und was Du auf solche oder ähnliche Aussagen in Zukunft in unter zwei Minuten erwidern kannst.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Dreirik",
      "public_name": "Dreirik"
    }
  ],
  "links": []
}