{
  "id": 233,
  "guid": "86094db0-3c31-5eae-8c4a-85b03d191069",
  "logo": "/media/36c3/images/JYS88M/talk_image.jpeg",
  "date": "2019-12-30T16:00:00+01:00",
  "start": "16:00",
  "duration": "00:50",
  "room": "Chaos-West Bühne",
  "slug": "JYS88M",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/JYS88M/",
  "title": "Lithium-Ion Batteries: Why do they work? Do they even work?? And why do they get so angery when you poke them?",
  "subtitle": "",
  "track": "Nicht Computers",
  "type": "Doppelter Slot",
  "language": "en",
  "abstract": null,
  "description": "Lithium-Ion batteries are everywhere and are here to stay. They're wonderful to bring mechanical and electronic creations to life, but can also be dangerous if one is not careful with them. Many come with dedicated protection features or at least claim to do so, while others rely on different features to make them safe. Due to how the materials are sourced and which materials are used the environmental and geopolitical factor of them also can’t be neglected.\r\nThis talk is for you if you're someone tinkering with electronics or if you're just curious and want to know more about the strange creatures batteries are.\r\n\r\nThis is an introduction and overview, covering the essentials of:\r\n- Safety, or how to not burn your house down\r\n- Chemistries and why some can perfectly cope at -40°C and others won't\r\n- Failure is optional and why some just don't burn or explode\r\n- The major do's and dont's\r\n- Charging, Discharging and why is it empty it said 20% left\r\n- Recycling and when you can and when you shouldn't reuse old batteries\r\n- Ethics and politics\r\n- What does the future hold?",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 179,
      "code": "3RK3QW",
      "public_name": "ln",
      "biography": "I'm a maker, tinkerer and recovering infosec addict now on a path to build better electronics. With the help of others I'm trying to build a collective of hackers to build hardware and software for a better and more repairable future.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}