{
  "id": 1416,
  "guid": "88e18a5f-524f-46f0-877d-df82516e22b2",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Wondrous_mathematics:_How_does_artificial_intelligence_accomplish_the_feat_of_learning%3F",
  "logo": null,
  "date": "2019-12-30T11:00:00+01:00",
  "start": "11:00",
  "duration": "1:00",
  "room": "Lecture room M2",
  "slug": "36c3-1416-session_wondrous_mathematics_how_does_artificial_intelligence_accomplish_the_feat_of_learning_",
  "title": "Wondrous mathematics: How does artificial intelligence accomplish the feat of learning?",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "talk",
  "language": "en",
  "abstract": "",
  "description": "How a mathematical breakthrough made at the end of the 17th century is the workhorse of the artificial neural networks of today\nConventional computer algorithms are superior to the human intellect in many regards: for instance at multiplying large numbers or winning at chess by analyzing huge numbers of moves. But there are also many tasks which come naturally to us yet exceed the capabilities of algorithms by vast amounts: Rigid algorithms can't decipher human handwriting or drive cars.The recent breakthroughs in artificial intelligence circumvent these barriers by employing quite a different approach: They use artificial neural networks, which are inspired by the partially-understood way the human brain works.The unique feature of artificial neural nets is that they aren't rigid, but can <em>learn</em>. Human programmers specify their rough structure and supply training data, but don't write a single line of code governing their behavior.<strong>In the spirit of a good Unix command-line tool, this talk aspires to explain one thing and explain it well: How do artificial neural nets accomplish the feat of learning?</strong>We'll see that the answer is related to a mathematical breakthrough made at the end of the 17th century and discuss why deep learning only surged in the last few years, even though the basics of artificial neural nets were already understood in the 1980s. We'll also touch upon some of the biggest problems of neural nets, which emerge directly from the way neural nets learn.The talk doesn't require any advanced knowledge of mathematics. If you're already familiar with [http://neuralnetworksanddeeplearning.com/ Michael Nielsen's book], then don't expect to learn anything new and come to this talk only if you want to contribute interesting remarks.'''[https://rawgit.com/iblech/mathematik-der-vorhersagen/master/vortrag-34c3/slides.pdf Slides]'''",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Iblech",
      "public_name": "Iblech"
    }
  ],
  "links": []
}