{
  "id": 1640,
  "guid": "8a72a3ef-0ef9-48c3-91ae-ef4af580d9e0",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Daniel_Domscheit_Berg_-_Verstehbahnhof_F%C3%BCrstenberg",
  "logo": null,
  "date": "2019-12-28T13:30:00+01:00",
  "start": "13:30",
  "duration": "1:00",
  "room": "Roter Salon",
  "slug": "36c3-1640-session_daniel_domscheit_berg_verstehbahnhof_fuerstenberg",
  "title": "Daniel Domscheit Berg - Verstehbahnhof Fürstenberg",
  "subtitle": "Einfach mal mitgedacht",
  "track": "self organized sessions",
  "type": "talk",
  "language": "de",
  "abstract": "",
  "description": "Einfach mal mitgedacht. Offene Prozessentwicklung anhand anschaulicher Beispiele wie dem Verstehbahnhof erklärt.\nEinfach mal mitgedacht. Offene Prozessentwicklung anhand anschaulicher Beispiele wie dem Verstehbahnhof erklärt.Der Verstehbahnhof FürstenbergIn der ehemaligen Bahnhofswartehalle des Bahnhofs Fürstenberg/Havel ist ein Makerspace und Veranstaltungsort für junge Menschen entstanden -- die Halle wurde zur Station junger Naturforscher und Techniker des 21. Jahrhunderts. Wir möchten neugierig auf die Zukunft machen, einen selbstbestimmten Umgang mit Technologien vermitteln und junge Menschen dazu befähigen, die digitale Gesellschaft nach ihren Vorstellungen mitzugestalten.Dafür vermitteln wir praktische Fertigkeiten wie Elektronik-Löten und Programmieren, beschäftigen uns aber auch mit theoretischen und ethischen Fragen, wie dem verantwortungsvollen Umgang mit sozialen Medien und den eigenen Daten. Das alles kann eine Menge Spass machen. Der Spass am Entdecken, Lernen und Verstehen steht bei uns an erster Stelle! Wir wollen so Hemmschwellen abbauen und dabei kreative Geister wecken, unabhängig von Geldbeutel, Geschlecht oder sozialem Hintergrund.Der Verstehbahnhof ist mit dem RE5 in einer Stunde vom Berliner Hauptbahnhof ohne Umsteigen erreichbar. Wir befinden uns am Beginn der Mecklenburgischen Seenplatte und können somit auch Ausgangspunkt für Klassenfahrten der etwas anderen Art sein.Träger des Verstehbahnhofs ist der gemeinnützige Verein havel:lab e.V.havel:lab -- where citizens meet activists meet hackers meet makers meet crafters meet refugees meet gardeners meet kids meet cats.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Kreatur",
      "public_name": "Kreatur"
    }
  ],
  "links": [
    "https://www.verstehbahnhof.de/"
  ]
}