{
  "id": 1488,
  "guid": "8c62a567-0190-4020-9767-01f66003194c",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Refugee-datathon-munich",
  "logo": null,
  "date": "2019-12-29T14:30:00+01:00",
  "start": "14:30",
  "duration": "2:30",
  "room": "C-base",
  "slug": "36c3-1488-session_refugee_datathon_munich",
  "title": "Refugee-datathon-munich",
  "subtitle": "collecting information for refugee supporters",
  "track": "self organized sessions",
  "type": "workshop",
  "language": "en",
  "abstract": "",
  "description": "We collect open data to inform better about asylum and migration\nSince 2016, the Refugee Datathon Munich meet to find and collect open data to inform about the refugee situation world wide. The original target audience are refugee supporters. They often aren't technical, but need information on acceptance quotas and similar data. The public is another audience. And then there is us: While discussing, researching and working with this data, we learn a lot about migration on this planet, the legal situation in Germany, and Open Data.Let us work on some issues. It can be getting data from the OECD API, or eurostat, or from PDFs in documents. Or bringing this data in a more presentable form (visualizations), or explaining it in an online article.What we can work on:* OECD API, https://github.com/muc-fluechtlingsrat/global-refugee-data/issues/2* Quiz Software, https://github.com/muc-fluechtlingsrat/refugee-quiz/issues/6* Make the Kibana Dashborad accessible without username / password, https://refugee-datathon-muc.org/english-pages/welcome-to-our-dashboard/* scrape the CIA world factbook for refugees, IDPs (internally displaces persons), stateless persons: https://www.cia.gov/library/publications/the-world-factbook/fields/327.html* For German speaking people with a lot of patience, extract data from \"Ergänzende Informationen zur Asylstatistik\" Kleine Anfragen, see e.g. https://refugee-datathon-muc.de/?p=1246* For people with domain specific knowledge e.g. on asylum laws, or recent developments in countries (e.g. Venezuela), share this with us (e.g. https://refugee-datathon-muc.de/?p=1513 needs an update, and background information)",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Ynux",
      "public_name": "Ynux"
    }
  ],
  "links": [
    "https://refugee-datathon-muc.org/"
  ]
}