{
  "id": 254,
  "guid": "8e581acd-efbb-5bd7-a5a8-b32a75eca8ec",
  "logo": "",
  "date": "2019-12-29T19:00:00+01:00",
  "start": "19:00",
  "duration": "00:50",
  "room": "Chaos-West Bühne",
  "slug": "MAFMDL",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/MAFMDL/",
  "title": "Die Ereignisse in Hong Kong - Der Versuch einer Zusammenfassung",
  "subtitle": "",
  "track": "Nicht Computers",
  "type": "Doppelter Slot",
  "language": "de",
  "abstract": null,
  "description": "Was passiert überhaupt, wo und warum eigentlich? Diese Frage habe ich mir im Frühsommer diesen Jahres gestellt und da Twitter sich zwar \r\nsehr gut zur schnellen Verbreitung von Nachrichten, aber nicht zur längeren Archivierung eignet, habe ich angefangen für mich \r\nInformationen zu sammeln. Daraus entstanden ist eine relativ große Sammlung an Fotos, Tweets, Vides/Livestreams und aufgeschriebenen \r\nErfahrungen und Meinungen, von Menschen, die da waren oder noch sind zu vielen verschiedenen Themen. Was waren eigentlich die Auslöser der Proteste? Aus welchen gesellschaftlichen und politischen Gruppierungen speisen sich die Proteste? Wie lief die Mobilisierung? Was gab es für Probleme und wie wurde mit ihnen umgegangen? Dieser Vortrag wird ein, sehr grober und garantiert unvollständiger, Versuch eines Überblicks um Menschen den Einstieg in die Thematik zu erleichtern und ein kleiner Appell, sich in Zeiten in denen immer mehr Menschen nach rechts rücken und die Welt immer unfreier wird, sich auch mal mit Ereignissen zu beschäftigen, die einen vermeintlich nicht betreffen (Kleiner Spoiler: tun sie meißtens doch, weil die Errosion von Grund-, Menschen-, und Freiheitsrechten uns halt doch alle angehen auch, wenn es in knapp 9000 Kilometern Entfernung passiert.).",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 171,
      "code": "YPMTZT",
      "public_name": "raketenlurch",
      "biography": "Macht was mit Computern und Politik und hat deswegen oft schlechte Laune.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}