{
  "id": 841,
  "guid": "8ee17c4a-e726-5e0c-b89a-a45a72b8cfce",
  "logo": "/media/36c3/images/799ABE/maxresdefault.jpg",
  "date": "2019-12-28T21:00:00+01:00",
  "start": "21:00",
  "duration": "00:40",
  "room": "cinopolis",
  "slug": "799ABE",
  "url": "https://talks.komona.org/36c3/talk/799ABE/",
  "title": "Hack the System",
  "subtitle": "",
  "track": null,
  "type": "Workshop",
  "language": "en",
  "abstract": "Anarcho hackers documentary that explains the day to day fight against those who took the internet from hackers and used it to create a network of surveillance and closed source, centralized services to force a uber surveillance capitalist dystopia upon everyday people. a(A)a",
  "description": "Every day, more and more of our activities and communications take place online. We’ve become addicted to connectivity…. to constant access to an endless catalogue of information, entertainment and engagement, all available at the click of a button. The Internet has become deeply ingrained into all facets of our lives, to the point where it often seems like a neutral appendage to reality itself – a “digital commons” where billions of global citizens hold the keys to a vast, decentralized, library of human knowledge. But in reality, the Internet is far from neutral… and it’s certainly not a commons. The server farms and fiber optic cables that make up the Internet’s physical infrastructure are increasingly owned, operated and controlled by a small handful of incredibly powerful corporations. Social Media platforms have become sites of mass indoctrination and anchors of social control. Liberal democratic societies are under attack from Russian trolls. We are at the dawn of a new era in history, in which states wage covert and perpetual cyber warfare against one another, with real world consequences that are hidden and unknown.\r\n\r\nMany of us choose to avoid these harsh truths, pleading ignorance of how technology works, and gladly immersing ourselves in the spectacle that it creates. But there are also those who are inexorably drawn to seeking out a better understanding of how the complex mechanics of power operate in our digital age… and how that power might be harnessed for our own ends. In this month’s episode of Trouble, sub.Media talks to a number of hackers and digital security experts, as they share their experiences and offer tips on how to best to navigate the battleground of the Internet.\r\n\r\nfree Jeremy Hammond \r\na(A)a\r\nhttps://matrix.hispagatos.org\r\nhttps://hispagatos.space\r\nhttps://hispagatos.org\r\nhttps://submedia.tv",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 41,
      "code": "FYDSCF",
      "public_name": "rek2",
      "biography": "rek2 from hispagatos",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}