{
  "id": 359,
  "guid": "98591fc6-852a-5251-bba5-12436614c1f3",
  "logo": "/media/36c3-oio/images/BJQTYA/avatar1_cqxI94G.png",
  "date": "2019-12-28T13:45:00+01:00",
  "start": "13:45",
  "duration": "00:25",
  "room": "OIO Stage",
  "slug": "BJQTYA",
  "url": "https://talks.oio.social/36c3-oio/talk/BJQTYA/",
  "title": "Exploring and empowering participatory culture communities with the use of online ethnography platform",
  "subtitle": "",
  "track": null,
  "type": "Talk 20 minutes + 5 minutes Q&A",
  "language": "en",
  "abstract": "We explore the potential of scalable online ethnography to study the rapidly growing phenomenon of participatory culture communities and discuss the potential benefits and challenges of using an online platform in hacker communities. The presentation shares views, with a demo, on how to build participatory online communities from a pilot that focused on the global Burning Man community.",
  "description": "The talk is grounded on the collaboration of two high-impact research projects, Burning Stories and Edgeryders. Firstly the aim of Burning Stories, by combining science and arts, is to study the global Burning Man community and seek to explain the processes through which community membership of Burning Man participants evolves across time and space, and how this, in turn, affects the society. By combining the Burning Stories research project with an online ethnography tool from Edgeryders, who use it for multiple Horizon 2020 funded project, the talk aims to present novel ways of disrupting the traditional ways of conducting ethnography in order to understand the emergence of a new cultural phenomenon and apply new, participatory methodology, in order to advance social sciences and community building. The presentation particularly focuses on lessons learnt from these two research projects and with the combination of the projects, explores the potential future use of the co-creative templates for hacker communities.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 131,
      "code": "9LVDDR",
      "public_name": "Jukka-Pekka Heikkilä",
      "biography": "A scholar, co-creator, culture hacker and entrepreneurship educator specialized in extreme settings.\r\n\r\nJukka-Pekka has taught entrepreneurship courses and organized startup and science diplomacy events in Pyongyang between 2012 - 2017. He is a co-founder of WTSUP! Beirut aims to foster equality and volunteerism culture in the Middle East and a founder of Burning Stories research project that aims to study the transformation of Burning Man participants and its impact on society. From academic affiliations, Jukka-Pekka is a Newton Fellow of the Royal Society (UK) and British Academy, an Academy of Finland post-doctoral Fellow based in Aalto University, Finland, and a visiting scholar at Stanford University. In Finland, he works as a board member with The Shortcut, a sister organisation of Slush and an initiative that aims to integrate immigrants to the Finnish society via tech entrepreneurship education.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}