{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/11178.html",
  "id": 11178,
  "guid": "9af057bd-eb94-41f6-8005-f322ecf66662",
  "logo": null,
  "date": "2019-12-30T11:30:00+01:00",
  "start": "11:30",
  "duration": "00:40",
  "room": "Dijkstra",
  "slug": "36c3-11178-art_against_facebook",
  "title": "Art against Facebook",
  "subtitle": "Art against Facebook Graffiti in the ruins of the feed and the party-info-capital is emigrating",
  "track": "Art & Culture",
  "type": "lecture",
  "language": "en",
  "abstract": "Currently Facebook has a tight grip on the cultural scene with its events-calendar and with Instagram as a spectacular image feed. But there is graffiti in the ruins of the feed and the party-info-capital is emigrating. The talk calls upon the critical net scene to contribute arguments and skills - theory and practice - in order to build bridges and include many.",
  "description": "Currently Facebook has a tight grip on the cultural scene with its events-calendar and with Instagram as a spectacular image feed. Even the leftist-critical scene of alternative culture and protests is busy contributing for the sake of outreach. Their contributions feed the filter systems, and profiling and affect loops run hot.\r\n<br>\r\nBut an opposition is rising. Graffiti and net-art are merging with hacking. Activists in Berlin, Paris, Rio and Sao Paulo are using facebook graffiti, through circulating UTF-8 textbombs that cross the layout of the feed (Check the wiki for workshop materials from 34C3).\r\n<br>\r\nThe Berlin network Reclaim Club Culture meanwhile is calling for a Facebook Exodus (CCCamp2019). They want to motivate the club and cultural scene to support free alternatives, by moving their biggest information capital, which are the event announcements. Once the information monopoly is cut through, maybe more people will make the step to leave the platform they don't even like anymore.\r\n<br>\r\nAll of this is part of a bigger network of refusal, from Fuck Off Google (31C3) to Facebook Resistance Artists. The talk calls upon the critical net scene to contribute arguments and skills - theory and practice - in order to build bridges and include many.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9777,
      "public_name": "el"
    },
    {
      "id": 8761,
      "public_name": "Rosa Rave"
    }
  ],
  "links": [],
  "attachments": []
}