{
  "id": 597,
  "guid": "9bda0f73-0ff7-5244-8690-4dcd9fce1007",
  "logo": "",
  "date": "2019-12-29T16:00:00+01:00",
  "start": "16:00",
  "duration": "00:45",
  "room": "WikiPaka WG: Esszimmer",
  "slug": "B3JTS9",
  "url": "https://cfp.verschwoerhaus.de/36c3/talk/B3JTS9/",
  "title": "StayAlive-Insektencounter – eine Diskussion über Daten, ML, Hardware und Community",
  "subtitle": "",
  "track": "Resilience & Sustainability",
  "type": "Lightning Talk",
  "language": "de",
  "abstract": "Wir entwickeln den StayAlive–Insektencounter, ein Citizen Science-Monitoringtool für Umweltschützer, NGOs, Hobbygärtner – für dich und mich. Das Raspi-basierte und KI-gestützte Gerät soll durch Echtzeitmessungen zeigen, welche Insekten (Fliegen, Hummeln, Falter etc) es noch gibt, wie sich die Zahl über die Zeit verändert und welche deiner Schutzmaßnahmen einen direkten positiven Einfluss haben werden.",
  "description": "Das Insektensterben wurde durch die „Krefelder Langzeitstudie“ einer breiten Öffentlichkeit bekannt. Für die Studie wurden die Tiere ganz analog in Fallen gelockt und konserviert (also getötet), so dass man anschließend ihre Biomasse bestimmen konnte.\r\nMit unserem Projekt StayAlive-Insektencounter gehen wir einen anderen Weg. \u2028Wir zählen und klassifizieren die Tiere digltal – und lassen sie leben. Der Counter soll Insekten anhand seiner Körperform und durch den Flügelschlag unterscheiden und lernt dank Künstlicher Intelligenz (KI) ständig hinzu. Die Daten werden über eine Map visualisiert und zeigen an, welche insektenfreundlichen Maßnahmen direkt wirken, wenn wir bestimmte Pflanzen säen, Wiesen ungemäht lassen oder pestizidfrei ackern.",
  "recording_license": "",
  "do_not_record": true,
  "persons": [
    {
      "id": 89,
      "code": "UN8RVY",
      "public_name": "Nicola",
      "biography": null,
      "answers": []
    },
    {
      "id": 101,
      "code": "QJ8PNC",
      "public_name": "Levin Brinkmann",
      "biography": "",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}