{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10756.html",
  "id": 10756,
  "guid": "9c139fdf-f96b-4957-865c-565cfc04d476",
  "logo": "/system/events/logos/000/010/756/large/blatt3000-pandas.jpg?1576528919",
  "date": "2019-12-29T18:50:00+01:00",
  "start": "18:50",
  "duration": "01:00",
  "room": "Eliza",
  "slug": "36c3-10756-p2panda",
  "title": "p2panda",
  "subtitle": "Social, artistic & theoretical experiments with decentralized festivals",
  "track": "Art & Culture",
  "type": "lecture",
  "language": "en",
  "abstract": "This is a technical, artistic, theoretical reflection on how we use technology to run and experiment with decentralised chaos festivals. We will look into implementations / realisations and talk about how they influenced our way of discussing and producing art and technology. Finally we will discuss p2panda, an idea of a p2p protocol for (self-)organising resources, places and events, which is based on the SSB protocol.",
  "description": "<p>This is a technical, artistic, theoretical reflection on how we use technology to run and experiment with decentralised festivals. VERANTWORTUNG 3000 (2016), HOFFNUNG 3000 (2017) and now p2panda are platforms and protocols to setup groups, festivals, gatherings, events or spaces in a decentralised, self-organised manner which allow us to raise questions on how we organise ourselves in our social, artistic & theoretical communities.</p>\r\n\r\n<p>In this presentation we want to:</p>\r\n\r\n<ul>\r\n<li>Show work and reflection processes of BLATT 3000 and Liebe Chaos Verein e. V. i. G. in Berlin on how technology informs art production and how these systemic \"meta\"-questions can be made the actual means of art, theory and discussion.</li>\r\n\r\n<li>Introduce some technical key-concepts of the p2panda protocol and how offline-first, append-only data-types, user authorization through cryptographic keys are interesting for ephemerality, self-organization, non-individuality, decentralization and anonymity in art and theory production.</li>\r\n\r\n<li>Present fictional ideas for festivals of the future.</li>\r\n\r\n<li>Talk about pandas.</li>\r\n</ul>",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 8994,
      "public_name": "adz"
    },
    {
      "id": 9886,
      "public_name": "sophiiistika"
    },
    {
      "id": 9483,
      "public_name": "cafca"
    }
  ],
  "links": [
    {
      "url": "https://github.com/p2panda/design-document",
      "title": "p2panda - Design document"
    },
    {
      "url": "https://hoffnung3000.de/",
      "title": "HOFFNUNG 3000 - Experimental festival platform"
    },
    {
      "url": "https://liebechaos.org/",
      "title": "Liebe Chaos Verein e. V."
    }
  ],
  "attachments": []
}