{
  "id": 583,
  "guid": "9c287c6a-7af8-5a1d-b2c9-97c30fd108c2",
  "logo": "",
  "date": "2019-12-28T19:00:00+00:00",
  "start": "19:00",
  "duration": "01:00",
  "room": "WikiPaka WG: Bibliothek",
  "slug": "P39SXD",
  "url": "https://cfp.verschwoerhaus.de/36c3/talk/P39SXD/",
  "title": "Hacking Legal Data",
  "subtitle": "",
  "track": null,
  "type": "Workshop",
  "language": "de",
  "abstract": "Initiativen wie [Offene Gesetze](https://offenegesetze.de/) oder [Open Legal Data](https://openlegaldata.io/) versuchen mit dem Veröffentlichen von juristischen Dokumenten den Rechtsstaat transparenter zu machen. Wir stellen euch vor, welche Daten es gibt, was man mit den Daten anfangen kann und planen mit euch, welche Daten als nächstes veröffentlicht werden sollten!",
  "description": "Gesetze und Urteile gelten als “amtliche Werke” und sind somit vom Urheberrecht ausgenommen. Frei verfügbar im Sinne von Open Data sind sie dadurch aber noch lange nicht. Ein privater Verlag bestimmt darüber, wie unsere Gesetze in Kraft treten. Wer Gesetzesblätter des Bundes durchsuchen, kopieren oder ausdrucken will, wird zur Kasse gebeten. Ähnlich verhält es sich mit Gerichtsentscheidungen. Zwar ergehen Urteile “Im Namen des Volkes”, gleichzeitig ist es aber für das Volk oft nicht möglich diese Urteile einzusehen, geschweige denn sie statistisch auszuwerten. Ursache dafür ist eine sehr geringe Veröffentlichungsquote von ca. 1%  und, dass von den veröffentlichten Urteilen, die meisten in kommerziellen Datenbank landen und somit auch nicht frei verfügbar sind. Initiativen wie Offene Gesetze oder Open Legal Data versuchen den Status Quo zu verändern, indem juristischen Dokumenten als Open Data veröffentlicht werden. \r\n\r\nIn diesem Workshop erläutern wir die Hintergründe und zeigen euch welche Daten bereits verfügbar sind. Beim alleinigen Informieren soll es aber nicht bleiben. Wir wollen euch motivieren selber aktiv zu werden und mit uns gemeinsam den Rechtsstaat ein Stück transparenter zu machen!",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 83,
      "code": "ZGGQTG",
      "public_name": "Saskia Ostendorff",
      "biography": "[Saskia Ostendorff](https://ostendorff.legal) is a lawyer from Berlin specializing in personality rights, new technologies and the legal challenges of digital transformation in law. She is a keynote speaker for digital change with lectures on 3D printing, open data, artificial intelligence, and personal rights. From 2015 to 2019 she did her Ph.D. at the Humboldt University of Berlin in the field of law and 3D-printing. In 2018, Saskia co-founded the platform and initiative Open Legal Data and is the chairwoman of the board of the Open Justice e.V. . She works as an expert on personal rights/hate comments on the internet.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}