{
  "id": 360,
  "guid": "9ca25e43-bcd8-541c-b79c-bfb6db1c2789",
  "logo": "/media/36c3-oio/images/8D7DBP/logos_to_replace_78tfwYe.png",
  "date": "2019-12-28T18:15:00+01:00",
  "start": "18:15",
  "duration": "00:25",
  "room": "OIO Stage",
  "slug": "8D7DBP",
  "url": "https://talks.oio.social/36c3-oio/talk/8D7DBP/",
  "title": "A dozen more things you didn't know Nextcloud could do",
  "subtitle": "",
  "track": "Hardware & Making",
  "type": "Talk 45 minutes + 10 minutes Q&A",
  "language": "en",
  "abstract": "With Nextcloud you can sync, share and collaborate on data, but you don't need to put your photos, calendars or chat logs on an American server. Nope, Nextcloud is self-hosted and 100% open source! Thanks to hundreds of apps, Nextcloud can do a lot and in this talk, I will highlight some cool things.",
  "description": "Consider this a follow-up from my talk about 200 things Nextcloud can do last year! An update on what's new and some cool new stuff. What, what is `Nextcloud`? Let's see. A private cloud is one way to put it, though that's a contradiction of course. It is a way to share your data, sync your files, communicate and collaborate with others - without giving your data to GAFAM! Keep it on your own server, or something close (like a local hosting provider or data center). Nextcloud is a PHP app that does all that, and more! Easy to use, secure (really) and fully open source of course.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 59,
      "code": "KMKHUZ",
      "public_name": "Jos Poortvliet",
      "biography": "People person, technology enthusiast and all-things-open evangelist. Head of marketing at Nextcloud, previously Community Manager at ownCloud and SUSE, recovering business consultant with decade long involvement in the KDE community. Enjoys avoiding traffic and public transport on bike through Berlin, but only when the weather is good. Loves cooking for friends and family and playing with the dog.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}