{
  "id": 176,
  "guid": "9da34e1b-b51c-5c43-9769-a71ae015028b",
  "logo": "",
  "date": "2019-12-30T14:00:00+01:00",
  "start": "14:00",
  "duration": "00:50",
  "room": "Chaos-West Bühne",
  "slug": "GVQMJW",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/GVQMJW/",
  "title": "Technische Kompetenzen vermitteln - nur wie?",
  "subtitle": "",
  "track": "The real basic about Bits and Nibbles",
  "type": "Doppelter Slot",
  "language": "de",
  "abstract": null,
  "description": "Während Marketingabteilungen mit Buzzwords wie \"KI\", \"IoT\" und \"Blockchain\" um sich werfen, schütteln die meisten hier den Kopf. Und womit? Mit Recht. Vielen Anwender*innen und polizischen Entscheidungsträger*innen fehlt es aber schlicht an technischer Kompetenz, um Probleme wie Stalkerware, politische Einflussnahme durch soziale Medien und Algorithmen(ethik) im Kern zu begreifen.\r\n\r\nAber wie können wir die Erfahrungen und das Wissen in dieses Draußen vermitteln, um den Menschen eine Chance zu geben, nicht bei jeder kleinsten Gelegenheit auf die Dummschwätzer reinzufallen? Wie können wir positiv Einfluss nehmen auf die Gesellschaft, damit informierte Entscheidungen überhaupt möglich sind? Wie kriegen wir vermittelt, was technisch bereits alles möglich ist und was (noch) nicht?\r\n\r\nIn vier Jahren PrivacyWeek haben wir die Themenbreite der \"Digitalisierung\" (BINGO!) mehrfach durchgearbeitet und gemeinsam mit den Vortragenden kommen wir immer wieder zum selben Schluss: Es braucht mehr Aufklärung und technische Kompetenz in der Bevölkerung, um die Probleme, die die weltweite Vernetzung mit sich bringt, überhaupt zu begreifen und ihnen begegnen zu können. Und letztlich bleibt die Frage, wo wollen wir als CCC letztlich hin? Wie können wir einen Informationstransfer forcieren, der über einige im eigenen Saft kochenden Initiativen hinausgehnt? Und wollen wir das überhaupt?\r\n\r\nEine Zusammenstellung der inhaltlichen Learnings von vier Jahren PrivacyWeek.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 37,
      "code": "SGAYBT",
      "public_name": "jinxx",
      "biography": "Klaudia Zotzmann-Koch, aka jinxx, ist Autorin, Podcasterin und Datenschutzexpertin. Seit Ende 2015 ist sie aktiv im Chaos und seit 2016 in der Kernorga der jährlichen PrivacyWeek in Wien. Sie ist aktiv bei Chaos macht Schule beteiligt, hält Workshops für Vereine, NGOs und Firmen, gibt Kurse zu Medienkompetenz an der VHS und schreibt Sachbücher im Bereich Datenschutz.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}