{
  "id": 805,
  "guid": "9e042d3f-798b-52ce-af01-ad52f07a2f4a",
  "logo": "",
  "date": "2019-12-28T12:30:00+00:00",
  "start": "12:30",
  "duration": "01:00",
  "room": "Dome 2",
  "slug": "8GQNUJ",
  "url": "https://talks.komona.org/36c3/talk/8GQNUJ/",
  "title": "Book club for grown-up victims",
  "subtitle": "",
  "track": null,
  "type": "Session",
  "language": "en",
  "abstract": "I am proposing to share information, thoughts, likes, dislikes...  about useful books for victims.",
  "description": "**DISCLAIMER:**\r\n*This session is NOT a group therapy, it is NOT a substitute for therapy and I am NOT a psychologist (I work as an IT engineer actually, I am just a regular victim in late stage recovery and who grew up with an overentitled mother and suicidal father.)*\r\n\r\n\r\nBeing a victim is a hard experience. Being raised as a victim within a **[dysfunctional family](https://en.wikipedia.org/wiki/Dysfunctional_family)** (or more generally sustaining long, repeated abuse/neglect with no possible escape) is even worse. Your mind gets conditioned to tolerate abusive behaviours from others, your intimate life seems like a perpetual Cornelian oscillation between isolation (to protect yourself) and toxic relationships (because you are a magnet for narcissist personalities). Recovery is a long journey with many digressions and set-backs.\r\n\r\nThis workshop is primarily intended to **raise awareness, knowledge and resilience among victims**. These are critical ingredients, because:\r\n\r\n- taking care of oneself is part of the recovery\r\n- good therapists are hard to find\r\n- even a even a good therapist can become a SPOF in your life\r\n- the pharmaceutical industry won't help (somatisation is good for business, you know)\r\n- traumas are diverse, reading about others can give perspective and reduce isolation\r\n\r\n\r\nThere are lots of self-help books (of varying relevance and quality) and the ecosystem is in steady movement, especially this year with the [complex post-traumatic stress disorder (C-PTSD)](https://en.wikipedia.org/wiki/C-PTSD) being officially recognized by the World Health Organization (since the adoption of [ICD-11](https://en.wikipedia.org/wiki/ICD)). Naming problems helps to fight them.\r\n\r\n**All kinds of books are welcome**, whether it is a self-help book, a scientific publication, a fiction or anything else. Also we may talk about other works of art (films,...) if you like.\r\n\r\n**Bring your favorite books with you** (to share their content with the other attendees) and **be supportive(*) to each other!**\r\n\r\n\r\n(*) I prefer avoiding the word 'excellent' here because I understand that its superlative nature can be over-interpreted by those of us who are [codependent](https://en.wikipedia.org/wiki/Codependency).",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 14,
      "code": "ULMBAR",
      "public_name": "procrastinator",
      "biography": "",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}