{
  "id": 1218,
  "guid": "9ef2a13a-61f1-4b47-a4f5-2bdd2c1b66de",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Alternatives_to_Google_Apps_on_Android",
  "logo": null,
  "date": "2019-12-29T15:00:00+01:00",
  "start": "15:00",
  "duration": "0:30",
  "room": "Lecture room M1",
  "slug": "36c3-1218-session_alternatives_to_google_apps_on_android",
  "title": "Alternatives to Google Apps on Android",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "talk",
  "language": "en",
  "abstract": "",
  "description": "I will go over my experience with finding and implementing alternatives. I go over how I used different tools, protocols, and software such as OwnCloud, CardDAV, CalDAV,, RSS, FreeOTP. and OpenVPN to decentralize my digital life and the pros and cons of doing such.\nFollow the journey of a long time Android user who sawone day, every aspect of their digital life was centralized by Google.Calendar, Contacts, email, instant messaging, etc. Is it worth it toseek alternatives when the phone's ecosystem is centrally communicatingwith Google?I will go over my experience with finding and implementing alternatives.I go over how I used different tools, protocols, and software such asOwnCloud, CardDAV, CalDAV,, RSS, FreeOTP. and OpenVPN to decentralize mydigital life and the pros and cons of doing such.Alexis works to secure the web by working on HTTPSEverywhere. She has previously been a web developer and systemadministrator for 5 years and a statistician in the education realm. Shehas earned degrees from the Rochester Institute of Technology in MediaArts and Technology and The New School in Organizational ChangeManagement. She is very passionate about encryption and tech equity forall. Alexis can be found either online ranting about bad security &surveillance policies, crocheting, or tinkering with a new tech toy.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Dreirik",
      "public_name": "Dreirik"
    }
  ],
  "links": []
}