{
  "id": 1545,
  "guid": "9f583b3c-31da-4e13-862d-7732412400bb",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Wondrous_mathematics:_Fun_with_transfinite_games",
  "logo": null,
  "date": "2019-12-29T00:00:00+01:00",
  "start": "00:00",
  "duration": "0:40",
  "room": "Lecture room M1",
  "slug": "36c3-1545-session_wondrous_mathematics_fun_with_transfinite_games",
  "title": "Wondrous mathematics: Fun with transfinite games",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "hands-on",
  "language": "en",
  "abstract": "",
  "description": "What's better than ordinary finite games? Transfinite games! Learn how these work, and how you win at them, in this hands-on workshop.\nWhat's better than ordinary finite games? Transfinite games, of course!In this fast-paced talk with many hands-on parts, you will learn about:* Nim, a fun game played with a finite number of coins. Learn how to optimally play this game!* Numbers larger than infinity. (This will be a five-minute excerpt of the [https://events.ccc.de/congress/2018/wiki/index.php/Session:Wondrous_Mathematics:_Fun_with_infinitely_large_numbers longer talk] on infinite numbers.) After the talk, you can impress your friends by effortlessly computing with numbers larger than infinity!* Transfinite Nim, a fun variant of Nim which is played with infinitely many coins. And learn how to optimally play this game!* The epic battle of Herkula against the hydra. The hydra grows more and more heads, but with your knowledge of infinity you'll be able to fight it!* Transfinite variants of puzzles like: \"I don't know which number you mean. – Neither do I know which number ''you'' mean. – Now I know your number. – And now I know yours as well.\"Bring your kids (age 12 or older)!",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Iblech",
      "public_name": "Iblech"
    },
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:MatthiasHu",
      "public_name": "MatthiasHu"
    }
  ],
  "links": []
}