{
  "id": 1660,
  "guid": "a0089148-2f70-4957-9b7e-e327d7c4e457",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Germany_stands_with_Hongkong",
  "logo": null,
  "date": "2019-12-29T15:00:00+01:00",
  "start": "15:00",
  "duration": "1:00",
  "room": "1komona dezentrale*",
  "slug": "36c3-1660-session_germany_stands_with_hongkong",
  "title": "Germany stands with Hongkong",
  "subtitle": "Germany stands with Hongkong",
  "track": "self organized sessions",
  "type": "discussion",
  "language": "en",
  "abstract": "",
  "description": "Germany Stands with Hongkong! What is necessary, what can be done to supportHongkong?\nOn June 9, 2019, over 1 million people in Hong Kong gathered to protest against an extradition bill proposed by our government, in favor of the authoritarian Communist Party of China. Fast forward to today, the city is now under constant threat of deteriorating freedom and violation of human rights. More than 6000 People have been arrested as of now. As a community of Hong Kongers living in Germany, we share the worries and sobs with those living in our home town. With the mission to support the democratic movement, HongKongers in Germany Concern Group was therefore founded and has grown organically since then.Our goal is to raise awareness and to support the ongoing democratic movement in Hong Kong. The group has no leader nor political background. All of us have gathered for one shared belief—Hong Kong is a place we call home.We organize and support a diverse range of events in Germany such as rallies, educational programs, art exhibitions, and discussion panels.  We also collaborate and align closely with Hongkonger in Deutschland e.V, with the goal to support and optimize resource utilization for facilitating relevant activities held in Germany.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Max",
      "public_name": "Max"
    }
  ],
  "links": [
    "http://wirfuerhongkong.com"
  ]
}