{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10762.html",
  "id": 10762,
  "guid": "a0e6927b-ae7f-412d-b494-06dcc76911db",
  "logo": null,
  "date": "2019-12-28T17:10:00+01:00",
  "start": "17:10",
  "duration": "00:40",
  "room": "Dijkstra",
  "slug": "36c3-10762-die_zukunft_grenzuberschreitenden_datenzugriffs_und_politischer_verfolgung",
  "title": "Die Zukunft grenzüberschreitenden Datenzugriffs und politischer Verfolgung",
  "subtitle": "",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "de",
  "abstract": "In Brüssel wird über eine Verordnung verhandelt, die es allen EU-Staaten ermöglichen soll, Provider zur Herausgabe von Inhalten oder Metadaten zu verpflichten – egal wo die Daten gespeichert sind, egal ob die Tat, um die es geht, dort eine Straftat ist. Werden CLOUD-Act, e-Evidence und ähnliche Kodifikationen bald dafür sorgen, dass Strafverfolgungsbehörden aller Länder Daten von Providern weltweit abgreifen können?",
  "description": "Strafverfolger hierzulande würden gern möglichst schnell alle möglichen Daten von allen möglichen Online-Diensten über ihre Kunden erhalten. Juristisch stehen dem bisher einige Hürden im Weg, wenn die Anbieter nicht im Inland sitzen oder wenn sie Daten auf Servern im Ausland speichern. Hinter der  Auskunft, mit welcher IP eine Morddrohung auf Facebook gepostet wurde, verbergen sich Diskussionen über die großen Themen des Völkerrechts: Souveränität und Territorialität. Weil Daten oft auf der ganzen Welt gespeichert werden, wird das etablierte System der gegenseitigen Rechtshilfe in Frage gestellt.\r\n\r\nWährend die EU noch über die eEvidence-Verordnung berät, haben die USA schon mit UK ein Abkommen für unbegrenzten Direktzugriff geschlossen und verhandeln mit Australien. \r\n\r\nWarum diesen neuen Regeln jeder Grundrechtsschutz fehlt und wie grenzüberschreitende Repression politische Verfolgung verändern könnte, erfahrt ihr in diesem Talk.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9567,
      "public_name": "Elisabeth Niekrenz"
    }
  ],
  "links": [],
  "attachments": [
    {
      "url": "/attachments/original/missing.png",
      "title": "file"
    },
    {
      "url": "/system/event_attachments/attachments/000/004/071/original/praesi_36c3.pdf?1577539214",
      "title": "Folien"
    }
  ]
}