{
  "url": "https://frab.riat.at/en/36C3/public/schedule/events/102.html",
  "id": 4302,
  "guid": "a10b52bd-55f4-4673-83f8-a3b92dd7cf9e",
  "logo": null,
  "date": "2019-12-28T16:30:00+01:00",
  "start": "16:30",
  "duration": "00:30",
  "room": "CDC - Stage",
  "slug": "36C3-102-digital_integrity_of_the_human_person",
  "title": "Digital integrity of the human person",
  "subtitle": "proposal for a new fundamental right.",
  "track": "Stage",
  "type": "lecture",
  "language": "en",
  "abstract": "Description/Abstract: Every human evolves today in multi-dimensional physical and digital environment. If each individual is to keep its individuality and autonomy in its daily choices, it must be protected and given effective tools to defend its own autonomy.\r\nRecognizing that human life has been digitally extended must question ourselves on what makes us human today. Should personal data be considered as component of the person, rather than objects that can be owned by whoever collects that data? Should our digital integrity be protected?\r\nIf each human person already has a right to physical and mental integrity (Swiss Constitution article 10 al.2), shouldn't it have a right to digital integrity?\r\nThis talk will introduce this new legal concept, its possible implications for data protection and how this concept could be introduced in the current legal framework.\r\n",
  "description": "Additional Talk Information: The addition of this new right will be discussed by the Walliser Verfassungsrat in charge of writing the new Cantonal Constitution. \r\n\r\nThe association of French speaking Data Protection Authorities, including the Swiss authority, has issued a comment that \"personal data are components of the human person\"",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 118,
      "public_name": "Alexis"
    }
  ],
  "links": [
    {
      "url": "https://www.vs.ch/documents/3914032/5755154/20191011_Rapport%20de%20s%C3%A9ance%20de%20commission%202%20-%20Bericht%20Sitzung%20Kommission%202",
      "title": "New Cantonal Constitution"
    },
    {
      "url": "https://www.afapdp.org/wp-content/uploads/2018/11/AG2018_4_Resolution-sur-la-propriete-sur-les-donnees-ADOPTE-LE-19-OCT-2018.pdf",
      "title": "\"personal data are components of the human person\""
    }
  ],
  "attachments": []
}