{
  "url": "https://frab.riat.at/en/36C3/public/schedule/events/99.html",
  "id": 4299,
  "guid": "a1239394-3f0a-46cd-9dd8-485d8062bb0f",
  "logo": "/system/events/logos/000/000/099/large/Screen_Shot_2019-12-23_at_4.36.41_PM.png?1577137027",
  "date": "2019-12-30T15:15:00+01:00",
  "start": "15:15",
  "duration": "00:15",
  "room": "CDC - Stage",
  "slug": "36C3-99-designing_a_communal_computing_interface",
  "title": "Designing a communal computing interface",
  "subtitle": "The top of the peer-to-peer stack",
  "track": "Stage",
  "type": "lightning_talk",
  "language": "en",
  "abstract": "How does a full peer-to-peer stack change how we organise and present user interfaces? If the PC was a 1970s desk for single-player computing, what's the right way to think of the way we actually use networks: communally? Matilde Park presents some findings from working on Urbit, an open source project tackling a peer-to-peer internet from scratch.",
  "description": "When we talk about decentralisation as a movement, we often focus on the principles of cypherpunks and hackers; we describe it as a movement away from central command structures with imbalanced power dynamics; freely and totally owning your hardware, sharing what you know with others, constructing the world in a direct and transparent way.\r\n\r\nHowever, I think it has even more power than that. I think it can completely change how we use computers and where we fit them into our lives. I’d like to posit that decentralisation necessitates rethinking a lot of the ways people interact with computers -- and that the interfaces we use everyday are themselves relics of a creeping, inevitable centralisation in place since the 1970s.\r\n\r\nAs I work on Urbit as a userspace developer, I've found that we've come to some conclusions about how to discuss peer-to-peer operating systems — in ways that are agnostic to any stack that designs itself for seamless transitions between participating in peer swarms, and everyday, individual computing.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 104,
      "public_name": "Matilde Park"
    }
  ],
  "links": [],
  "attachments": [
    {
      "url": "/system/event_attachments/attachments/000/000/025/original/communal_computing.pdf?1577140598",
      "title": "communal_computing.pdf"
    }
  ]
}