{
  "id": 363,
  "guid": "a3f9136b-fa32-504d-a762-438d5141ac74",
  "logo": "",
  "date": "2019-12-29T16:10:00+01:00",
  "start": "16:10",
  "duration": "00:55",
  "room": "OIO Stage",
  "slug": "VPUTHL",
  "url": "https://talks.oio.social/36c3-oio/talk/VPUTHL/",
  "title": "Treating IS - Humanitäre Prinzipien im Konflikt",
  "subtitle": "",
  "track": null,
  "type": "Talk 45 minutes + 10 minutes Q&A",
  "language": "de",
  "abstract": "Frank Dörner von Ärzte ohne Grenzen und Sebastian Jünemann von CADUS diskutieren die jüngsten Angriffe auf humanitäre Prinzipien in verschiedenen Kontexten, wie beispielsweise während der medizinischen Nothilfe in Nordost-Syrien.",
  "description": "Eigentlich sollte es klar sein: Menschen die medizinische Hilfe benötigen sollen sie auch bekommen, Punkt. Doch in Medienkommentaren wird der humanitären Hilfsorganisation CADUS, die ein Feldkrankenhaus im Camp Al Hol in Nordost-Syrien betreibt, längst nicht nur Respekt ausgesprochen. Manche Kommentator*innen schlagen vor, humanitäre Prinzipien auszusetzen sobald es sich bei den Hilfesuchenden um mutmaßliche Angehörige des sogenannten Islamischen Staates (IS) handelt. Schließlich, so die Argumentation, missachte diese Organisation systematisch eben solche Prinzipien. \r\n\r\nIn vielen Konflikten werden humanitäre Grundsätze heute zunehmend missachtet. Helfende werden zu Feinden erklärt und damit legitime Ziele für jedwede Aggression. Krankenhäuser und Ambulanzen können gezielt angegriffen werden, ohne dass es Konsequenzen hat. Afghanistan, Syrien, Yemen – die Liste ist lang. Und aus der jüngsten Geschichte der Seenotrettung wissen wir: auch von staatlichen Stellen werden immer wieder humanitäre Grundsätze mit Füßen getreten. \r\n\r\nFrank Dörner von Ärzte ohne Grenzen und Sebastian Jünemann von CADUS geben einen Einblick was es bedeutet, in gesellschaftlich und politisch stark umstrittenen Kontexten Hilfe zu leisten, in denen humanitäre Prinzipien immer wieder aus verschiedensten Richtungen angegriffen werden.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 133,
      "code": "M7YNCY",
      "public_name": "Sebastian Jünemann",
      "biography": "Gründer der unabhängigen humanitären Hilfsorganisation CADUS e.V., die in Zusammenarbeit mit lokalen Partner*innen medizinische und technische Nothilfe leistet. CADUS ist hauptsächlich in Nordost-Syrien und im Nord-Irak tätig. Im Berliner Crisis Response Makerspace der Organisation werden open source Lösungen für Herausforderungen in der humanitären Hilfe entwickelt.",
      "answers": []
    },
    {
      "id": 150,
      "code": "ADFHYV",
      "public_name": "Frank Dörner",
      "biography": "Frank Dörner ist Allgemeinarzt und arbeitet seit Ende der 90er im humanitären Kontext mit Ärzte ohne Grenzen. Er hat in verschiedensten Projekten gearbeitet und war 6 Jahre lang Geschäftsführer in Berlin. Frank gehört zum Gründungskreis von Sea-Watch und war mehrfach im Einsatz auf dem Meer, letztmalig im Januar 2019. Seit Mai diesen Jahres gehört Frank zudem zum Vorstand von ÄoG.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}