{
  "id": 4119,
  "guid": "a544d2ae-ba7a-5d97-87d7-f037f8d82515",
  "logo": "",
  "date": "2019-12-30T18:00:00+01:00",
  "start": "18:00",
  "duration": "03:00",
  "room": "Installations",
  "slug": "XRKDYZ",
  "url": "https://stage.artesmobiles.art/36c3/talk/XRKDYZ/",
  "title": "Lambe Lambe: Conglomerate of Experiences: BLODEUWEDD/Dideldum/The Abyss/Anasyrma Temple",
  "subtitle": "",
  "track": "Installation",
  "type": "Individual shows (5-10 minutes for 1 spectator at a time)",
  "language": "en",
  "abstract": "\\#puppetry",
  "description": "**There will be individual shows from 5 to 10 minutes for 1 spectator at a time of the following pieces:**\r\n\r\nBLODEUWEDD (Blod-day-weth) Experience the story of a mystical woman made of flowers, told for you alone with handmade miniature puppets. Part of an ancient legend from Wales, Blodeuwedd is a tale of identity, hardship and free will.\r\n\r\nWith: Owain Griffiths, Hannah Morris\r\n\r\n---\r\n\r\nDideldum: We are full of memories. Memories of sounds, songs, voices, faces, events, smells and people. Memories pile up, branch out and yet they belong together.  All these memories define us, define who we were and who we actually are.  But what happens when forgetting threatens us, when our everyday life suddenly seems alien to us, when our minds flutter away and we cannot think clearly anymore?  What remains of us?\r\n\r\nWith: Eva-Maria Schneider\r\nwww.eva-mariaschneider.de\r\n\r\n---\r\n\r\nThe Abyss: A small glimpse into an archive of fear and nightmares. Within their participative installations “Private Dreams & Public Nightmares” Jan Jedenak and Jonas Klinkenberg invite their audience to get in touch with different forms of fear and reflect on nightmares, their own fears and the fears within our society. During different experiments those things are documented. This Lambe, built by Jonas Klinkenberg, allows a glimpse into the archive of fear – with a small touch of Poe and Lovecraft and bits of an old radio feature. Open your eyes and dive into the depth of nightmares and get to know different perspectives on what scares us. Look into the abyss.\r\n\r\nWith: Jonas Klinkenberg, Jan Jedenak\r\n\r\n---\r\n\r\nAnasyrma Temple: Come, get rid of your sorrows, leave all your worries behind. Dive into the universe of Anasyrma Temple and be healed!\r\n\r\nWith: Dana Sinaida Ersing",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 16,
      "code": "J8QSEC",
      "public_name": "Cie. What's in my box",
      "biography": "Lambe Lambe – this is theatre for individualists. For those who are reluctant to share theatre experience with a large audience. A show, just for one person at a time. A moment just for you! Lambe Lambe is a theatre technique that has been revived and celebrated since the 1990s, especially in Latin America. It is widespread all over the world and has recently been on the rise again. In miniature theatre boxes, figures and objects are played in short scenes for only one spectator at a time. Meet a strong woman out of an old myth from Wales, face memories and nightmares and let yourself be disco-healed. Compagnie What's in my box is based in Leipzig and invites you to choose your box and enter worlds that are made just for you.\r\n\r\nhttps://www.facebook.com/leckileckikolleki",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}