{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10795.html",
  "id": 10795,
  "guid": "a5d6dd63-ef24-4686-9a89-e06cb179d531",
  "logo": "/system/events/logos/000/010/795/large/NGI0_tag.png?1571958127",
  "date": "2019-12-30T12:30:00+01:00",
  "start": "12:30",
  "duration": "00:40",
  "room": "Dijkstra",
  "slug": "36c3-10795-ngi_zero_a_treasure_trove_of_it_innovation",
  "title": "NGI Zero: A treasure trove of IT innovation",
  "subtitle": "Resilient. Trustworthy. Sustainably Open.",
  "track": "Resilience & Sustainability",
  "type": "lecture",
  "language": "en",
  "abstract": "<p>The <a href=\"https://ngi.eu\">Next Generation Internet</a> initiative is the first concerted effort in Europe to put significant public funding to hands-on work to really fix the internet. The long term <a href=\"https://ngi.eu\">vision</a> of the initiative is to make the internet what we need and expected it to be in the first place: <strong>Resilient</strong>. <strong>Trustworthy</strong>. <strong>Sustainable</strong>. The concrete mission of the Next Generation Internet initiative is to \"re-imagine and re-engineer the Internet for the third millennium and beyond\". With new projects starting all the time, the density of awesome open source, open hardware, new science and new standards in-the-making is already intense: about 200 projects are currently on their way. These range from encrypted synchronisation for calendars and address books to symbolical protocol verification, from an open hardware RISC-V SoC to removing binary seeds from operating systems, from ethical search to the Fediverse etc.\r\n\r\n<p>NGI Zero offers funding to independent researchers and FOSS developers working on free and open projects in the area of privacy and trust enhancing technologies and on search, discovery and discoverability. It also offers an elaborate 'pipeline' of supporting activities that live up to high standards (sometimes called 'walk the talk') in terms of security, privacy, accessibility, open source licensing, standardisation, packaging, etc. The talk will provide an overview of the awesome R&D that is now in the pipeline, how the programme is organised and everything you need to know about the various opportunities to 'come and work for the internet'. </p>",
  "description": "<p><a href=\"https://nlnet.nl/discovery\">NGI Zero Discovery</a> and <a href=\"https://nlnet.nl/PET\">NGI Zero PET</a> are a significant effort and ambitious effort by a large group of organisations led by <a href='https://nlnet.nl/foundation' rel=\"me\">NLnet foundation</a> (that was instrumental in <a href=\"https://nlnet.nl/foundation/history\">pioneering the early internet in Europe</a>):\r\n\r\n<ul>\r\n<li><a href=\"https://accessibility.nl/english\">Accessibility Foundation</a> - Center of expertise on accessibility of internet and other digital media for all people, including the elderly and people with disabilities</li>\r\n<li><a href=\"https://apc.org\">Association for Progressive Communications</a> - A global network and organisation that strives towards easy and affordable access to a free and open internet to improve the lives of people and create a more just world</li>\r\n<li><a href=\"https://techcultivation.org/\">Center for the Cultivation of Technology</a> - A charitable non-profit host organization for international Free Software projects</li>\r\n<li><a href=\"https://commonscaretakers.com\">Commons Caretakers</a> - A not-for-profit service provider for the development of Commons</li>\r\n<li><a href=\"https://www.netsec.ethz.ch/\">Network Security Group</a> of <a href=\"https://www.netsec.ethz.ch/\">Eidgenössische Technische Hochschule Zürich</a> - Academic research institute focused on building secure and robust network systems</li>\r\n<li><a href=\"https://fsfe.org\">Free Software Foundation Europe</a> - Association charity that aims to empower users to control technology.</li>\r\n<li><a href=\"http://www.ifross.org/\" class=\"external\" target=\"_blank\">ifrOSS</a> - Provides not-for-profit legal services and studies in the context of free and open source software</li>\r\n<li><a href=\"https://nixos.org/nixos/foundation.html\">NixOS Foundation</a> - Foundation supporting development and use of purely functional configuration management tools, in particular NixOS and related projects</li>\r\n<li><a href=\"https://nlnet.nl\">NLnet Foundation (NL)</a> - Grantmaking public benefit organisation founded by pioneers of the early European internet</li>\r\n<li><a href=\"https://ps.zoethical.com/\">Petites Singularit&eacute;s</a> - Non profit organisation working with free sofware and focusing on collective practices</li>\r\n<li><a href=\"https://radicallyopensecurity.com\">Radically Open Security</a> - Not-for-profit open source security company</li>\r\n<li><a href=\"http://securesoftware.nl\" class=\"external\" target=\"_blank\">TIMIT</a> - Experts in secure software</li>\r\n<li><a href=\"http://translatehouse.org/\" class=\"external\" target=\"_blank\">Translate House</a> - Develops and implements open source localization solutions</li>\r\n</ul>\r\n\r\n<p>The budget for the effort is kindly provided by the European Commission.</p>",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9591,
      "public_name": "Michiel Leenaars"
    }
  ],
  "links": [
    {
      "url": "https://ngi.eu/vision",
      "title": "Next Generation Internet vision"
    },
    {
      "url": "https://nlnet.nl/PET",
      "title": "NGI Zero Privacy & Trust Enhancing Technologies"
    },
    {
      "url": "https://nlnet.nl/discovery",
      "title": "NGI Zero Discovery"
    },
    {
      "url": "https://nlnet.nl",
      "title": "NLnet Foundation"
    }
  ],
  "attachments": []
}