{
  "id": 1157,
  "guid": "a832bef1-11a0-42d4-bd49-c87332e71626",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Planet_A",
  "logo": null,
  "date": "2019-12-29T22:00:00+01:00",
  "start": "22:00",
  "duration": "1:00",
  "room": "Lecture room 11",
  "slug": "36c3-1157-session_planet_a",
  "title": "Planet A",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "discussion",
  "language": "en",
  "abstract": "",
  "description": "Hackers gathering to kickoff a social revolution project - Planet A. Updated description. Join #planet-a chat ! We have matrix server too (matrix.planet-a.org, chat name: 36c3).\nThis year there has been lot of attention drawn to the topic of globalecological crisis. But still people are oblivious. This may be not thatobvious to members of opensource community. We care about freedom. Levels ofawareness of the societal, political and ecological problems are generallyhigher than those among the rest of population. Not only that! We are, hackershave skills to make systemic change in the world with attitude and principlesthat have been the reasons of opensource movement success. And yet we surroundour selves with like minded people and never beak out the bubble. It won't getany better if we will not unite and act upon.Let's step out the bubble. Let's bring awareness to unaware and tools topowerless. How many concerned people have will and yet feel alone and powerlessin the face of scale of the disaster?In this session we will have a short presentation followed by discussion. Wehave some ideas we want to share and want to hear yours too. Everyone is invitedto form the team.We will soon setup a before chat for communication during the congress.Links:Documentary about CCC. You should watch it if you haven't yet.https://allcreatureswelcome.netWhat can the hacker community do to make things better?https://media.ccc.de/v/32c3-7501-ten_years_after_we_lost_the_warExtinction rebelionhttps://rebellion.earth/https://www.youtube.com/watch?v=b2VkC4SnwY0https://tellthetruth.media/",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Zap",
      "public_name": "Zap"
    }
  ],
  "links": [
    "http://planet-a.org"
  ]
}