{
  "id": 230,
  "guid": "a8ea9881-0e74-5dc4-8ce4-74abadf19030",
  "logo": "",
  "date": "2019-12-27T16:00:00+01:00",
  "start": "16:00",
  "duration": "00:50",
  "room": "Chaos-West Bühne",
  "slug": "XFXE9Q",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/XFXE9Q/",
  "title": "Ein Teil davon. Wie feministische Hackspaces Gemeinschaft herstellen.",
  "subtitle": "",
  "track": "Nicht Computers",
  "type": "Doppelter Slot",
  "language": "de",
  "abstract": null,
  "description": "In den vergangenen Jahren haben sich immer mehr feministische Hackspaces in den verschiedensten Formen gegründet. Warum eigentlich? Was bewegt Menschen dazu, was macht einen feministischen Hackspace überhaupt aus und wie können wir alle davon lernen? Das habe ich in meiner Masterarbeit untersucht und bin dafür durch Deutschland gereist, um mit Mitgliedern feministischer Hackspaces zu sprechen. Im Ergebnis werden die Funktionen feministischer Hackspaces beleuchtet und analysiert, warum diese Räume für ihre Mitglieder so wichtig sind.\r\n\r\nUm das herauszufinden, habe ich mit dem qualitativen Forschungsstil der „Grounded Theory“ in einem zirkulären Verfahren Interviews geführt und ausgewertet. So habe ich ein Modell entwickelt, das zeigen kann, welche Kernfunktionen Hackspaces haben, welche Faktoren Menschen davon abhalten, in ihrem lokalen Hackspace aktiv zu werden, und wie feministische Hackspaces versuchen, diese Defizite auszugleichen.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 176,
      "code": "R83MCR",
      "public_name": "Julia",
      "biography": "Fast fertig mit dem Soziologie-Masterstudium an der Uni Osnabrück geht es danach hoffentlich in den Journalismus. Daneben: Mit Code die Welt verbessern als Mentorin bei Jugend hackt, programmieren für Code for Osnabrück, Crypto-Workshops mit Digitalcourage und jede Menge Spaß mit dem Chaostreff Osnabrück.\r\n\r\nNach der Schnapsidee, das Bachelorstudium in Germanistik und Soziologie in Jena mit einer Arbeit in Computerlinguistik zu beenden, habe ich festgestellt, dass ich mehr mit diesen Computern machen will. Hintergrund bis dahin: Einführungsvorlesung Computerlinguistik + paar Jahre Linux-Erfahrung + bisschen Python + bisschen R + bisschen LaTeX + bisschen Übermut. Danach zum Hackover 2017 gefahren und seitdem immer weiter in diese Chaos-Bubble reingeflutscht. Uppsi. ¯\\_(ツ)_/¯",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}