{
  "id": 1691,
  "guid": "aa67a7cb-4a0f-4412-b91a-a0b2d8003093",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:The_Power_of_Participation:_Akteursbasierte_Stadtplanung",
  "logo": null,
  "date": "2019-12-29T15:00:00+01:00",
  "start": "15:00",
  "duration": "0:45",
  "room": "Roter Salon",
  "slug": "36c3-1691-session_the_power_of_participation_akteursbasierte_stadtplanung",
  "title": "The Power of Participation: Akteursbasierte Stadtplanung",
  "subtitle": "Neue Formen der Beteiligung",
  "track": "self organized sessions",
  "type": "talk",
  "language": "",
  "abstract": "",
  "description": "Neue Ansätze sind gefragt, die Top-Down-Planung und Bottom-Up-Initiativen miteinander zu verknüpfen, um nachhaltige und zukunftsfähige Lebensräume zu gestalten.\nMoritz Ahlert (* 1982) ist Architekt. Er war Teil des DFG-Forschungsprojekts ›Urbane Interventionen‹ (2013–14) und war Mitglied des Graduiertenkollegs ›Ästhetiken des Virtuellen‹ an der HFBK Hamburg (2015–17). In seiner künstlerisch-wissenschaftlichen Promotion (2019) setzte er sich kritisch mit den Beteiligungsformaten digitaler Kartenanwendungen auseinander. Er ist Autor mehrerer Publikationen, zuletzt gab er 2018 ›Moravia Manifesto – Coding Strategies for Informal Neighborhoods‹ mit heraus. Seit 2017 ist er Wissenschaftlicher Mitarbeiter an der ›Habitat Unit‹, dem Fachgebiet für Internationale Urbanistik und Design an der TU Berlin.The Power of Participation: Akteursbasierte StadtplanungIm Rahmen einer weltweit rasant fortschreitenden Urbanisierung müssen neue Formen der Beteiligung von städtischen Bewohner*innen entwickelt werden. Denn global wird sich ein Großteil der zukünftigen Stadtbewohner*innen in informellen Siedlungen, als ungeplante Erweiterungen bestehender urbaner Zentren, niederlassen. Instrumente und Methoden klassischer Stadtplanung stehen diesem Phänomen bislang ratlos gegenüber. Neue Ansätze sind gefragt, die Top-Down-Planung und Bottom-Up-Initiativen miteinander zu verknüpfen, um nachhaltige und zukunftsfähige Lebensräume zu gestalten. Anhand von drei internationalen Projekten (›Moravia Manifesto‹, ›Floating University‹ und dem ›Atlas of Digital Fragments‹) diskutiert Moritz Ahlert die Relevanz alternativer Planungspraktiken und zeigt neue Wege auf, wie Planung, Politik und Verwaltung in Koproduktion mit lokalen Communities inklusive urbane Transformationsprozesse anstoßen und umsetzen können.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Kreatur",
      "public_name": "Kreatur"
    }
  ],
  "links": []
}