{
  "id": 1500,
  "guid": "acc21a3f-de26-47d7-8f8e-c9c40a238159",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Hacking_Licence",
  "logo": null,
  "date": "2019-12-27T11:00:00+01:00",
  "start": "11:00",
  "duration": "1:00",
  "room": "Assembly:Digitalcourage",
  "slug": "36c3-1500-session_hacking_licence",
  "title": "Hacking Licence",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "workshop",
  "language": "de",
  "abstract": "",
  "description": "Your daily basic hacking learning lesson.\n'''---> README: There will be sessions from days 1 to 5. The daily session times will be announced in the evening before. <---'''We offer instructions for \"Damn Vulnerable Web Application\" ( http://www.dvwa.co.uk/ / https://github.com/ethicalhack3r/DVWA ) daily. At least for 2 to 4 people. Join us if you would like to learn about security gaps in web programming (e.g. bad passwords, SQL injection, cross-site requests forgery). You will learn how to hack systems and how to reset them afterwards. It's recommended to bring your own device (laptop) with an working ethernet port. We have a single Ethernet-to-USB adapter available for devices lacking an Ethernet port such as Apple Macbooks.'''-->LIESMICH: Es wird jeden Tag Sessions geben. Wann die täglichen Sessions genau starten, wird immer am Vorabend eingetragen. <---'''Wir bieten täglich „Damn Vulnerable Web Application“ ( http://www.dvwa.co.uk/ / https://github.com/ethicalhack3r/DVWA ) unter Anleitung an, für mindestens 2 bis 4 Personen. Inhaltlich geht es dabei um klassische Sicherheitslücken der Webprogrammierung (z.B. schlechte Passwörter, SQL-Injection, Cross-Site-Request-Forgery). Hier lernst du Systeme zu hacken und wiederherzustellen. Bringt am besten euren eigenen Computer mit einem funktionierenden Ethernet-Port mit. Wir haben einen Ethernet-zu-USB-Adapter, damit ihr auch Geräte ohne integrierten Ethernet-Anschluss (wie z.B. Apple Macbooks) nutzen könnt.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Chpietsch",
      "public_name": "Chpietsch"
    },
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:CryptGoat",
      "public_name": "CryptGoat"
    }
  ],
  "links": [
    "https://digitalcourage.de/"
  ]
}