{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10760.html",
  "id": 10760,
  "guid": "af7b586c-8221-4371-91d2-3641497710a9",
  "logo": null,
  "date": "2019-12-27T16:10:00+01:00",
  "start": "16:10",
  "duration": "01:00",
  "room": "Clarke",
  "slug": "36c3-10760-the_large_hadron_collider_infrastructure_talk",
  "title": "The Large Hadron Collider Infrastructure Talk",
  "subtitle": "",
  "track": "Science",
  "type": "lecture",
  "language": "en",
  "abstract": "The Large Hadron Collider (LHC) is the biggest particle accelerator on Earth. It was built to study matter in more detail than ever before and prove physical theories like the Standard Model of Particle Physics. This talk will focus on the engineering aspects of LHC. How was it built? What makes it tick? Which technologies are needed to create a such powerful machine? This talk will take you on a journey to explore how the most complex machine ever built by humans works.",
  "description": "During previous CCCs, several talks described what kind of data the experiments of LHC look out for, how the data is stored, how physicists are analysing data and how they extract their huge discoveries. Often times though, the presence of the particle accelerator itself is taken for granted in light of these findings. \r\nThat's why this talk will give an in-depth engineering summary about that 'particle accelerator'. We'll shed light on the big technology and engineering problems that had to be solved before being able to build a machine that we take for granted these days. Among other things, we will describe how to cool down several thousand tons of magnets to -271.25°C, how to safely dissipate ~500 MegaJoule of energy in just a fraction of a second, or how to bend a beam of particles around a corner while it's moving along with ~99,9999991% of the speed of light. Of course, we'll also touch on the bits that make collecting the data gathered in all the physics detectors possible in the first place.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 6347,
      "public_name": "sev"
    },
    {
      "id": 9270,
      "public_name": "thasti"
    }
  ],
  "links": [],
  "attachments": []
}