{
  "id": 600,
  "guid": "b124cc16-7ff5-55da-8235-a07732fb1ec1",
  "logo": "",
  "date": "2019-12-29T16:45:00+01:00",
  "start": "16:45",
  "duration": "00:15",
  "room": "WikiPaka WG: Bibliothek",
  "slug": "BRADWK",
  "url": "https://cfp.verschwoerhaus.de/36c3/talk/BRADWK/",
  "title": "RFID-Karten für E-Autos sind unsicher, und man 1001 Sharing-Karten. Geht das mit SmartCards / OpenSC besser?",
  "subtitle": "",
  "track": "Security",
  "type": "Workshop",
  "language": "de",
  "abstract": "Ladesäulen basieren immernoch auf Mifare Classic / RFID UIDs. Bei Sharing-Mobilität gibt es für jeden Anbieter eine eigene Karte. Könnte offene SmartCard Infrastruktur auf Basis von OpenSC die Lösung sein? Oder was gibt es noch?",
  "description": "Hinweis vorweg: der Workshop ist so für 60 Minuten geplant, da es aber Raumbelegungskonflikte gibt, suchen wir uns dann einfach einen Platz in der WikipakaWG.\r\n\r\nDas Sicherheits-Problem von Ladeinfrastruktur ist wohlbekannt und war Thema auf dem 34C3: https://www.ccc.de/de/updates/2017/e-motor . Auf der anderen Seite gibt es immer mehr Sharing-Mobilität, und wenn diese RFID-Karten einsetzen, dann verschickt jeder Dienst seine eigene Karte. In beiden Fällen liegt es daran, dass die zumeist eingesetzten sicheren Karten auf symmetrischer Kryptografie basieren, was einen zur Karte passenden Key im Leser voraussetzt - und das funktioniert bei vielen Beteiligten nun einmal schlecht.\r\n\r\nIn diesem Workshop wollen wir recht offen darüber diskutieren, ob Karten auf Basis asymmetrischer Kryptografie eine Lösung sein können, also Karten mit geschützten private Key, die aktiv Daten signieren können. Mit OpenSC gäbe es eine offene Lösung, die eine Basis sein könnte. Ich habe ein bisschen Hardware zum Spielen mit und fänd es spannend, wenn der Workshop in eine technische lösungsorientierte Richtung ginge - rumranten ist zwar spaßig, ist mir aber zu wenig.\r\n\r\nIhr werdet von mir keine perfekte Übersicht / Lösung bekommen, da ich dafür nicht genug Marktübersicht habe, wohl aber einen kleinen Einblick. Aber die oben genannten Beispiele zeigen, dass auch der meist geschlossene Weg \"da draußen\" keine so richtig gut brauchbare Lösungen bringt, und wo sollte eine sinnvolle Lösung entstehen wenn nicht hier?",
  "recording_license": "",
  "do_not_record": true,
  "persons": [
    {
      "id": 38,
      "code": "8GKMBN",
      "public_name": "Ernesto",
      "biography": "",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}