{
  "id": 1605,
  "guid": "b1868129-918f-4ed8-8bac-fffa4c2c9140",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:%27Natur_und_Nachhaltigkeit%27",
  "logo": null,
  "date": "2019-12-28T12:00:00+01:00",
  "start": "12:00",
  "duration": "0:45",
  "room": "Roter Salon",
  "slug": "36c3-1605-session_natur_und_nachhaltigkeit_",
  "title": "'Natur und Nachhaltigkeit'",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "talk",
  "language": "de",
  "abstract": "",
  "description": "Nachhaltigkeit gehört auf unsere Agenda. Von der Forschung in die Praxis #actionsforfuture\nAnja Henckel engagiert sich für mehr interdisziplinären Austausch und ist in diversen Thinktanks aktiv und setzt sich für die Förderung von Austausch ein. Erfahren in der internationalen Tourismus-, Medien-, Kultur- und Umweltdienstleistungsbranche. Sie betrachtet Themen durch die Linse historischer, geopolitischer, kreativer und kritischer Praktiken. Die Wurzeln ihrer Aktivitäten sind mit den 17 Zielen der nachhaltigen Entwicklung (Sustainable Development Goals, SDG) verbunden. www.projekt-n.org Nachhaltigkeit gehört auf unsere Agenda.Von der Forschung in die Praxis #actionsforfuture Globales RCE NetzwerkDie regionalen Kompetenzzentren der Universität der Vereinten Nationen sind ein Netzwerk für Bildung für Nachhaltige Entwicklung (BNE). Durch BNE erlernen die Menschen sowohl ihre eigene Lebens- und Wirtschaftsweise nachhaltig zu verändern, als auch ihren Lebensraum nachhaltig zu nutzen. Nach dem Motto Global denken – lokal handeln tragen RCEs dazu bei, diese Aufgabe auf lokaler Ebene mit Kindergärten, Schulen, beruflicher Ausbildung, Erwachsenenbildung, Hochschulen, außerschulischen Weiterbildungseinrichtungen und Akteuren informellen Lernens umzusetzen.2000 m²Wir sind jetzt gut 7,5 Milliarden Menschen auf diesem Planeten. Unsere Zahl wächst weiter, die Erde aber nicht. Kann sie uns noch ernähren? Wenn wir die globale Ackerfläche von 1,5 Milliarden Hektar durch die Zahl der Erdenbürger teilen, ergibt das 2000 m² pro Nase. Darauf muss also alles wachsen, womit Mutter Erde uns nährt und versorgt: Brot, Reis, Kartoffeln, Obst, Gemüse, Öl, Zucker… aber auch all das Futter für die Tiere. Zudem die Baumwolle für Jeans, der Tabak für Raucher und obendrein noch Bio-Gas oder Bio-Diesel und nachwachsende Rohstoffe für die Industrie.ResidenZ - Zeit für die Zukunft Pilot für das Stipendienprogramm sucht Einzelakteure oder Gruppen, die sich gemeinsam den wirtschaftlichen und gesellschaftlichen Herausforderungen stellen. Das Projekt ist eingebettet in ein interdisziplinäres Netzwerk mit Verantwortlichen aus Politik, Wirtschaft, Kultur, Verwaltung und Zivilgesellschaft. Drei Personen erhalten die Möglichkeit, die Ernährung und Landwirtschaft von morgen interdisziplinär, kreativ und forschungsorientiert zu überdenken und auszuprobieren. Jardim do MiraEin gemeinnütziger Verein, der mit den Methoden der Permakultur und der syntropischen Landwirtschaft arbeitet und Bildungsprogramme entwickelt. Das Bestreben ist die Revitalisierung von Land, die Arbeit mit gefährdeten Arten und der Aufbau von Biodiversität. Wir glauben an den Austausch von Wissen und die Steigerung durch Teilen. Natur steht an erster Stelle und das Projekt soll ein Beispiel für den Transfer und die Verbreitung von Know-how geben können. Wichtig ist, dass man keine Immobilie kaufen, man besitzt also nicht einen Teil des Landes, sondern als TeilhaberIn einen Anteil an dem Projekt besitzen.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Kreatur",
      "public_name": "Kreatur"
    }
  ],
  "links": []
}