{
  "id": 850,
  "guid": "b198ae81-7e63-56ce-b73c-26f6e1279cbf",
  "logo": "/media/36c3/images/U7TW7Y/Emp%C3%B6rt-euch-Profilbild.jpg",
  "date": "2019-12-28T21:25:00+01:00",
  "start": "21:25",
  "duration": "01:00",
  "room": "headnut",
  "slug": "U7TW7Y",
  "url": "https://talks.komona.org/36c3/talk/U7TW7Y/",
  "title": "Empört Euch! - Kampagne zum Schutz des Demonstrationsrechts",
  "subtitle": "",
  "track": null,
  "type": "Session",
  "language": "de",
  "abstract": "Amnesty Deutschland registrierte 2018 mindestens drei Tötungsdelikte nach unsachgemäßen Einsatz von Pfefferspray durch die Polizei. Auch Erblindung und Augenreizungen sind mögliche Folgen. Um sich davor zu schützen, tragen viele Demonstrant*innen eine transparente Folie über den Augen. So geschah es auch bei den #blockupy Protesten 2015. Nun steht Benjamin Ruß, damaliger #stopG7 Sprecher, genau deswegen vor dem Bundesverfassungsgericht. \"Empört Euch!\" ist die zugehörige Kampagne zum Fall, die sich gegen den Abbau unserer demokratischen Rechte und für den Schutz unseres Demonstrationsrechts einsetzt. Nach Vorstellung der Kampagne wird in der anschließenden Diskussion über die aktuelle politische Lage und Formen der Partizipation diskutiert werden.",
  "description": "",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 47,
      "code": "FYGD9A",
      "public_name": "@penel_pe",
      "biography": "Mitglied von #panyrosas einer der größten internationalen Frauenorganisationen* weltweit sowie Mitbegründerin von Gender Equality Media, einer Organisation, die sich gegen sexistische Berichterstattung in Deutschland einsetzt. Mit Kampagnen wie #unfollowpatriarchy setzt sich die Gruppe konkret gegen patriarchale Strukturen in der Medienlandschaft ein.",
      "answers": []
    },
    {
      "id": 49,
      "code": "WDATU7",
      "public_name": "Benjamin Ruß",
      "biography": "Arbeiter, Aktivist, Autor.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}