{
  "id": 1211,
  "guid": "b1ea5cb7-0b8e-42f6-9ace-8a34ad000fbc",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Surface_mount_electronics_assembly_for_terrified_beginners",
  "logo": null,
  "date": "2019-12-27T17:30:00+01:00",
  "start": "17:30",
  "duration": "2:00",
  "room": "Assembly:Hardware Hacking Area",
  "slug": "36c3-1211-session_surface_mount_electronics_assembly_for_terrified_beginners",
  "title": "Surface mount electronics assembly for terrified beginners",
  "subtitle": "Day 1",
  "track": "self organized sessions",
  "type": "workshop",
  "language": "de",
  "abstract": "",
  "description": "Surface mount electronics for terrified beginners. Learn to assemble tiny parts on circuit boards by building an electronic touch-activated purring kitten. Anyone can do it. Yes, even you who never touched anything electronic before. 120mins, 20€/kit, avoid caffeine immediately before. Max 20 participants per session, there is a PAPER!!1! signup list in the hardware hacking area.\nTakes about two hours. Basic workshop. No prior knowledge needed. Materials cost 20€ per kit.We are going to build an electronic kitten using tiny SMD parts. It will purr when you touch it right and hiss when you touch it wrong. It's going to work.For people afraid of surface mount assembly/rework. You know those tiny little components in modern electronic devices? It's both possible and easy to assemble those by hand. You can do it, and I'll teach you how!Think you don't have the tools? Think you can't manually place 0402s? Everything is possible with patience and practice. The equipment is minimal and you probably already have it. We'll learn the answer to THERE'S A SHORT ON A TINY PART OMG WHAT NOW? After this, you'll no longer need to be scared of SMD. Avoid caffeine immediately before the workshop, because shaky hands are a disadvantage.The workshop kit costs 20€. Please SIGN UP ON THE PAPER LIST at the Hardware Hacking Area. PLEASE BE ON TIME!",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Kliment",
      "public_name": "Kliment"
    }
  ],
  "links": []
}