{
  "id": 1055,
  "guid": "b4615df7-595a-413d-8f41-db9584a6f13f",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Freedom_to_go",
  "logo": null,
  "date": "2019-12-28T20:00:00+01:00",
  "start": "20:00",
  "duration": "2:00",
  "room": "Lecture room M2",
  "slug": "36c3-1055-session_freedom_to_go",
  "title": "Freedom to go",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "workshop",
  "language": "en",
  "abstract": "",
  "description": "An interactive workshop to present the Free Software App repository called F-Droid and the outstanding functionalities of its clients called F-Droid and G-Droid. After that we discover the best (imho!) Android-based Free Software apps including methods of anonymization and encryption - and you will have the possibility to present your personal favorite Free Software app as well.\nAfter a short introduction about possible (non-existing) freedoms in Android & its Custom ROMs, we will discover F-Droid, the Free Software app repository and explore the functionalities and possible usage of its client with the same name.This F-Droid client is characterized by an anarchic design, it is resistant to censorship and surveillance and comes with a lot of emancipating features for its users. Unfortunately, it can be also a bit confusing in the beginning. This is where G-Droid comes in, a fork of the F-Droid client that can access the very same repository of Free Software apps while offering completely new qualities information management. Getting to know both of them and their respective benefits is first part of the workshop.In order to further make the first steps of discovering freedom on mobile phones a pleasant experience, some of the best (imho!) Free Software apps from F-Droid (the repository) will be presented in the second part of the workshop - as well as easy possibilities for enhanced anonymization and encryption.This is an interactive session for everyone! You can ask any question at any time and if I cannot help you someone else from the audience usually can. Also during and after the workshop all participants are asked to introduce their personal favorite apps from F-Droid. This way we will all know more in the end.So if you are up for F- and G-Droid or feel like discovering the good side of Free Software on mobile phones then come and join the workshop!",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Dreirik",
      "public_name": "Dreirik"
    }
  ],
  "links": []
}