{
  "id": 226,
  "guid": "b546675d-5ca9-5891-9d63-6de8ad98e637",
  "logo": "",
  "date": "2019-12-30T11:00:00+01:00",
  "start": "11:00",
  "duration": "00:50",
  "room": "Chaos-West Bühne",
  "slug": "CHBLH8",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/CHBLH8/",
  "title": "Datacenter - was wir wissen sollten (und trotzdem oft nicht erfahren)",
  "subtitle": "",
  "track": "The real basic about Bits and Nibbles",
  "type": "Doppelter Slot",
  "language": "de",
  "abstract": null,
  "description": "Eine Reise zu den Fundamenten der digitalen Welt\r\n\r\nWas ist eigentlich ein Rechenzentrum und wie funktioniert es? Welche Bedeutung haben Datacenter für das Internet und den ganzen digitalen Rest?\r\nStrom, Kühlung und Sicherheit im Überblick. Was muss alles passieren, damit Server, Storages und Netzwerke immer laufen können. \r\nWarum werden die Datacenter immer größer, wo doch die Elektronik immer kleiner wird? Welche Konsequenzen ergeben sich daraus?\r\nWieviel Strom verbraucht eine Suchanfrage oder ein Videostream und warum ist das relevant? \r\nIst Deutschland ein guter Standort für (neue) Rechenzentren und warum?\r\nUnd was hat das alles mit Klimawandel und Nachhaltigkeit zu tun? \r\nKann es GreenIT ohne \"grüne\" Datacenter geben? Wie sollten die aussehen? Was muss in den kommenden Jahren geändert werden, damit auch Rechenzentren ihrer Rolle beim globalen CO2-Ausstoß gerecht werden? \r\n\r\nÜberraschende Einblicke in Planung, Bau und Betrieb von großen Rechenzentren.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 172,
      "code": "VYCFKR",
      "public_name": "Günter Eggers",
      "biography": "Schon seit über 25 Jahren bin ich in der IT und Telekommunikation und unterwegs. \r\nSeit 2012 sammle ich firmenübergreifenden Erfahrungen in der Datacenter-Branche. \r\nMeine Themen sind technische, kommerzielle und auch regulatorische Fragen rund um die Planung und den Betrieb von Rechenzentren. Dazu gehören auch KRITIS, Energieversorgung und Nachhaltigkeit.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}