{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10890.html",
  "id": 10890,
  "guid": "b600081b-88f8-41b2-b0d2-f790e3e7d6ea",
  "logo": null,
  "date": "2019-12-29T20:50:00+01:00",
  "start": "20:50",
  "duration": "00:40",
  "room": "Eliza",
  "slug": "36c3-10890-welcome_pattern_-_theorie_und_praxis",
  "title": " Welcome Pattern - Theorie und Praxis ",
  "subtitle": "(Eine Gemeinschaftsproduktion der Haecksen, der tuwat-Gruppe Bildung und Chaos Siegen)",
  "track": "CCC",
  "type": "lecture",
  "language": "de",
  "abstract": "In diesem Beitrag stellen wir die von der tuwat Gruppe Bildung erarbeiteten \"Welcome Pattern\" zum Empfang und Integration von Neuankömmlingen und ihre Anwendung in Siegens Hackspace \"HaSi\"  vor.\r\n\r\n",
  "description": "Das Chaos setzt sich für Informationsfreiheit ein und behandelt die Auswirkungen von Technologie auf die Gesellschaft. Dabei machen wir sie zum Beispiel erfahrbar, testen ihre Grenzen und erklären unseren Mitmenschen und Interessierten, was gut und nicht so gut funktioniert. Zwischenzeitlich kommt da aber auch der Besucher mit dem kaputten Windows Vista, die neue Person, die schon beim ersten Besuch den Lasercutter anschmeißen will oder jemand, der den feinen Unterschied zwischen \"cool\" und \"gar nicht mal so geil\" nicht ganz verstanden hat.\r\nWir versuchen auf der einen Seite offen für neue Mitstreiter*nnen zu sein, müssen aber auch bestimmt auf unsere Regeln und ethischen Grundsätze hinweisen. Die tuwat Gruppe Bildung hat 2018 aus diesem Grund sogenannte 'Welcome Pattern' entwickelt. Schnell zu lesen sollen sie das Chaos unterstützen, sich offen zu zeigen, ohne davon überlastet zu werden. Sie sollen aber auch eine bessere Integration von Neuankömmlingen ermöglichen, ohne die Komplexität hinter der Hackerethik und Informationsfreiheit auszusparen. In diesem Vortrag stellen wir diese Muster vor und besprechen relevante Teile davon anhand ihre Anwendung im Chaos Siegen und seinen assoziierten Hackspaces. Chaos Siegen beschäftigt sich seit Anfang 2019 mit den Mustern. Sie legen sie zum Beispiel als zusätzliches Informationsmaterial aus. Außerdem führen sie einen 'Hodge Podge', eine Kontaktliste verschiedener Gruppen, um Neulinge peu-a-peu ins Chaos zu führen. Die bekannte Diskussion wie viel Ahnung von Technik man im Chaos mitbringen soll wird verkürzt, aber auch schwere Themen, wie die Homogenität in der Gruppe, können addressiert werden. Eure konkreten Fragen könnt ihr am Endes des Vortrags mitbringen. Vielleicht können wir euch in Richtung eines entspannteren Clubleben weiterhelfen.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 3602,
      "public_name": "melzai"
    },
    {
      "id": 9774,
      "public_name": "nanooq"
    }
  ],
  "links": [
    {
      "url": "https://doku.ccc.de/Bildung/WelcomePatterns",
      "title": "Welcome Patterns"
    },
    {
      "url": "https://www.haecksen.org/",
      "title": "Haecksen"
    },
    {
      "url": "https://chaos-siegen.de/",
      "title": "Chaos Siegen"
    }
  ],
  "attachments": [
    {
      "url": "/system/event_attachments/attachments/000/004/093/original/haecksen_welcome_pattern_herzi_2019-12-28.pdf?1577622915",
      "title": "welcome-patterns-36c3"
    }
  ]
}