{
  "id": 255,
  "guid": "b6905252-7db6-5e9a-a2a0-dfc04b2fd6a2",
  "logo": "",
  "date": "2019-12-27T17:30:00+01:00",
  "start": "17:30",
  "duration": "00:20",
  "room": "Chaos-West Bühne",
  "slug": "EARPZB",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/EARPZB/",
  "title": "Emergency VPN: Analyzing mobile network traffic to detect digital threats",
  "subtitle": "",
  "track": "All about computers",
  "type": "Einfacher Slot",
  "language": "en",
  "abstract": null,
  "description": "The access to surveillance technology by governments and other powerful actors has increased in the last decade. Nowadays malicious software is one of the tools to-go when attempting to monitor and surveil victims. In contrast, the target of these attacks, typically journalists, lawyers, and other civil society workers, have very few resources at hand to identify an ongoing infection in their laptops and mobile devices. \r\n\r\n In this presentation we would like to introduce the Emergency VPN, a solution we developed at the Czech Technical University as part of the CivilSphere project. The Emergency VPN is designed to provide a free and high quality security assessment of the network traffic of a mobile device in order to early identify mobile threats that may jeopardize the security of an individual. \r\n\r\n The presentation will cover the design of the Emergency VPN as a free software project, the instructions of how a user can work with it, and some success cases where we could detect different infections on users.\r\n\r\n We expect attendees will leave this session with a more clear overview of what the threat landscape looks like, what are the options for users that suspect their phone is infected, and how the Emergency VPN can help in those cases.\r\n\r\n More information about the Emergency VPN can be found at CivilSphere's website: https://www.civilsphereproject.org",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 209,
      "code": "NYGFUB",
      "public_name": "Sebastian Garcia",
      "biography": "Bitte nachtragen",
      "answers": []
    },
    {
      "id": 208,
      "code": "MZ9Y79",
      "public_name": "Veronica Valeros",
      "biography": "Bitte nachtragen",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}