{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10565.html",
  "id": 10565,
  "guid": "b854982f-d696-40be-a2d2-15dc64a1f421",
  "logo": "/system/events/logos/000/010/565/large/Screen_Shot_2019-11-13_at_12.17.53_PM.png?1573676286",
  "date": "2019-12-27T12:50:00+01:00",
  "start": "12:50",
  "duration": "01:00",
  "room": "Ada",
  "slug": "36c3-10565-what_s_left_for_private_messaging",
  "title": "What's left for private messaging?",
  "subtitle": "",
  "track": "Security",
  "type": "lecture",
  "language": "en",
  "abstract": "It is easier to chat online securely today than it ever has been. Widespread adoption of signal, wire, and the private mode of WhatsApp have led a broader recognition of the importance of end-to-end encryption. There's still plenty of work to be done in finding new designs that balance privacy and usability in online communication.",
  "description": "This introduction to secure messaging will lay out the different risks that are present in communications, and talk about the projects and techniques under development to do better.\r\n\r\nThe talk will begin with a threat modeling exercise to be able to concretely talk about the different actors and potential risks that a secure messaging system can attempt to address. From there, we'll dive into end-to-end encryption, OTR and deniability, and then the axolotl construction used by Signal (and now the noise framework).\r\n\r\nThe bulk of the talk will focus on the rest of the problem which is more in-progress, and in particular consider the various metadata risks around communication. We'll survey the problems that can arise around contact discovery, network surveillance, and server compromise. In doing so, we'll look at the forays into communication systems that attempt to address these issues. Pond offered a novel design point for discovery and a global network adversary. Katzenpost adapts mixnets to limit the power of network adversaries and server compromise in a different way. Private Information Retrieval (PIR) trades off high server costs for a scheme that could more realistically work with mobile clients. Others, for instance Secure Scuttlebutt attempt to remove the need for infrastructural servers entirely with gossip and partial views of the network, a whole other set of tradeoffs.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 4821,
      "public_name": "Will Scott"
    }
  ],
  "links": [],
  "attachments": []
}