{
  "id": 751,
  "guid": "b87c698c-3bb6-5da2-9978-2999bf74e450",
  "logo": "",
  "date": "2019-12-30T11:00:00+01:00",
  "start": "11:00",
  "duration": "04:00",
  "room": "ChaosZone Workshop",
  "slug": "N7AUBH",
  "url": "https://cfp.chaoszone.cz/36c3/talk/N7AUBH/",
  "title": "Technologien für freie Kommunikation",
  "subtitle": "",
  "track": null,
  "type": "Workshop 4h",
  "language": "de",
  "abstract": "Whatsapp, Instagram, Amazon, ... . Die meistgenutzten Plattformen genießen Monopolstatus - es führt kaum ein weg an ihnen vorbei. Dabei sammeln sie unsere Daten und bestimmen den Rahmen in dem wir kommunizieren.\r\n\r\nDas muss nicht sein.\r\nGemeinsam können wir Lösungen und Technologien erarbeiten, die den Weg weg bereiten von Plattformen, dessen Existenzgrund deine Abhängigkeit zu ihnen ist.\r\n\r\nKomm und diskutiere, konzipiere, kreiere!",
  "description": "Digitale Kommunikation und Social Media – ein Herzstück unserer alltäglichen Kommunikation im Netz – zentrieren sich heute auf wenige Plattformen. Dies spielt den Plattformbetreibern große Macht zu.\r\n\r\nTechnisch sind wir auf diese Plattformen nicht angewiesen, praktisch schon.\r\n\r\nWenn ich heute einer Freundin schreiben will, die nur Whatsapp nutzt, ich aber nicht, dann muss ich ihr entweder eine SMS (unverschlüsselt, kostenpflichtig) oder eine Email (unverschlüsselt) schicken. Whatsapp möchte ich nicht benutzen, da ich nicht will, das Facebook meine Daten sammelt. Warum kann ich mir nicht aussuchen nicht bei Facebook zu sein und trotzdem Menschen dort zu schreiben? Ich kann ja auch Mails and xyz@gmail.com verschicken ohne bei Google Nutzer zu sein. Oder jemanden, der bei der Telekom Kunde ist anrufen.\r\nGenauso gut wären offene Protokolle denkbar. Mit denen könnte sich jede\\*r aussuchen über welchen Kanal/Server er\\*sie kommuniziert (fast so wie bei Emails).\r\n\r\nUnd überhaupt - warum bin ich so beschränkt in dem was ich mit Whatsapp tun kann? Keine Umfragen? Kein voting? Keine Untergruppen? Keine Live-Standorte? Warum lässt sich das nicht integrieren?\r\nKein Problem - beispielsweise mit einer Webanwendung problemlos realisierbar.\r\n\r\nUnter anderem scheitern solche Versuche an den geschlossenen Schnittstellen der Plattformbetreiber. Für die untergraben solche Ansätze ihr Plattform-Monopol.\r\n\r\nNichtsdestotrotz führt kein Weg daran vorbei – wenn wir den Rahmen unserer Kommunkikation selber gestalten wollen, brauchen wir Technologien, die vielseitig nutzbar sind und Plattformunabhängigkeit bieten – also dezentraler funktionieren. Sie müssen so gut wie möglich zu vorhandenen Plattformen Schnittstellen bieten und den Weg von dort weg so einfach wie möglich gestalten. Wenn solche Technologien einmal vorhanden sind, erschweren sie neuen klassischen Plattformen das entstehen von Monopolen.\r\n\r\nSolche Technologien müssen für Nutzer aller Kenntnislevel ohne Hürden (intuitiv) nutzbar sein, um Popularität zu erreichen.\r\n\r\nEbenso müssen sie flexibel genug sein um eine Vielzahl an Kommunikationsrahmen abdecken zu können.\r\n\r\nIch würde die (technischen) Anforderungen in vier Kategorien teilen:\r\n- Flexibilität: Gestaltbarkeit der Kommunikationsstruktur (Forendiskussionen, Anzeigen, ...), soziale Strukturen und Diskurse abbilden (in Sicherheits-& Kompatibilitätstechnisch saubere Bahnen leitend)\r\n- Sicherheit: Flexibilität darf Nutzerdaten/Sicherheit nicht kompromittieren; dezentral gespeicherte Daten, Kontrolle über diese\r\n- Kompatibilität: open Interfaces, barrierefreie Interoperabilität mit anderen Diensten\r\n- Nutzerfreundlichkeit: Übersichtlichkeit, Navigierbarkeit, (technisch) transparent, sauber gestaltbar\r\n\r\nDiese müssen alle Hand in Hand miteinander funktionieren, damit sie auch gewährleistet sind. Wenn zum Beispiel die Flexibilität aus dem Ruder läuft, könnten inkompatibele Schnittstellen entstehen. Das würde wiederum die Nutzbarkeit und Sicherheitsprüfungen erschweren.\r\n\r\nIch stelle mir vor so etwas mithilfe von Plugins zu realisieren. Diese werden im Web gehostet (zum beispiel als JavaScript) und greifen auf die in der übertragenen Nachricht gespeicherten (Meta-)Daten zu. Implementierbar wäre so etwas mithilfe von [Solid](https://solidproject.org/).\r\n\r\nIch freue mich auf Anregungen und Diskussionen jeder Art!",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 58,
      "code": "YRULU8",
      "public_name": "Laurin Weger",
      "biography": "",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}