{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Lineup/events/11311.html",
  "id": 11311,
  "guid": "bb51094b-0fab-42b4-8728-090b35110052",
  "logo": "/system/events/logos/000/011/311/large/iron-curtis?1577728654",
  "date": "2019-12-31T00:00:00+01:00",
  "start": "00:00",
  "duration": "02:00",
  "room": "Discotheque Nouveauancien",
  "slug": "36c3-abfahrplan-11311-iron_curtis",
  "title": "Iron Curtis",
  "subtitle": "",
  "track": "Music",
  "type": "djset",
  "language": "en",
  "abstract": "On the continent of electronic music, Johannes Paluka has travelled far and wide, collapsing musical boundaries with enviable ease. Under the moniker of Iron Curtis, the Berlin-based creates his complex, hauntingly beautiful productions from a range of eclectic styles and influences. Be it House, Acid or soulful Techno – his sound moves in the equilibrium of reduced, but never minimal. Flashes of kitsch brighten the dark universe of Iron Curtis, but fail to interfere with the melancholy subtext. As far as leftfield electronic music is concerned and as long as he sees a chance to break a few genre rules here or there, Iron Curtis is brimming with ideas.",
  "description": "Making his debut in 2008 with an EP on Hamburg’s beloved Mirau, he made even more good impressions that year with a contribution to the Deetron’s Fuse. Apart from releasing House on labels like Office, Retreat or Smallville, Paluka runs the project Achterbahn D'Amour with his longtime friend Jool aka Edit Piafra. Here, they focus on Acid infused Techno, electrifying audiences with their shows and releases on L.A based Acid Test imprint. His latest project is called Moon – a collaboration with Johannes Albert from Frank Music, where the two friends exhibit their love for classic Electro and stripped down Techno.\r\n\r\nBut wherever his musical interests take him, Iron Curtis will always be adding a little soul in his compositions. This is the magic thread that runs through all of his productions and it’s what Iron Curtis transfers from his releases to his live gigs as well. As a DJ he is as inspired and versatile as he is a producer, skilfully taking the dancefloor into the deep and diverse corners of modern dance music.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [],
  "links": [
    {
      "url": "https://soundcloud.com/iron-curtis/",
      "title": "Iron Curtis on Soundcloud"
    }
  ],
  "attachments": []
}