{
  "id": 745,
  "guid": "bebb56ed-98ad-5e3c-8d6c-1c7496b8dfe2",
  "logo": "/media/36c3/images/VDMSJN/lonely_chimera_cross_big2.png",
  "date": "2019-12-29T19:00:00+01:00",
  "start": "19:00",
  "duration": "00:30",
  "room": "ChaosZone Bühne",
  "slug": "VDMSJN",
  "url": "https://cfp.chaoszone.cz/36c3/talk/VDMSJN/",
  "title": "Quantum computing @ school?  Läuft!",
  "subtitle": "",
  "track": "Science",
  "type": "Vortrag 30 min (incl. Q&A)",
  "language": "de",
  "abstract": "Man muss ein Genie sein und jahrelang Quantenphysik studiert haben um einen Quantum-Annealer programmieren zu können? Falsch gedacht! Drei Schüler (15, 16 und 17) zeigen in ihrem Vortrag, wie sie ein kniffliges Schachproblem auf einem adiabatischen Quantencomputer (dem D-Wave 2000Q) gelöst und damit bei Jugend forscht den Preis der Bundesforschungsministerin für zukunftsorientierte Technologien abgeräumt haben.",
  "description": "In unserem Vortrag werden wir zunächst auf die Funktionsweise adiabatischer Quantum-Annealer eingehen und anschließend die Herangehensweise an die Lösung eines Optimierungsproblems auf dem Quantencomputer erläutern.\r\n\r\nEs zeigt sich, dass für das Programmieren eines Quanten-Annealers, wie ihn die Firma D-Wave schon heute kommerziell vertreibt, keine vertieften Kenntnisse zum Thema Quantenmechanik vonnöten sind. Man muss lediglich ein gegebenes Problem in die mathematische Form bringen, die der Quanten-Annealer versteht. Wie genau das funktioniert, wollen wir an einem konkreten Beispiel zeigen. \r\n\r\nWir (Jakov, Paul und Jonathan) werden dabei unser Jugend-forscht-Projekt \"Lösung des n-Damenproblems auf einem adiabatischen Quantencomputer\" vorstellen, das uns eine Bundesplatzierung im Fachbereich Mathematik/Informatik eingebracht hat. \r\n\r\nUnser Projekt durften wir bereits bei der Firma Krones, dem Max-Planck-Institut für Quantenoptik und auf dem ISC (International Supercomputing Conference) 2019 in Frankfurt vorstellen.\r\n\r\nUnsere Projekt-Homepage: https://www.domspatzen-quantum.de/  \r\nVortrag beim ISC in Frankfurt: https://www.youtube.com/watch?v=aM_pAA9FdYY",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 54,
      "code": "NMYTRC",
      "public_name": "Jakov David Wallbrecher",
      "biography": "*Jakov ist ein Informatik- und Mathematik-interessierter Schüler am Musikgymnasium der Regensburger Domspatzen.*\r\n\r\nIch bin 15 Jahre alt, aktuell in der zehnten Klasse und ich programmiere seit mittlerweile 3 Jahren. In erster Linie schreibe ich meine Programme, die meist Teil eines mehr oder weniger wissenschaftlichen (Forschungs-)Projekts sind, in Processing, einer Java-basierten Sprache. Im letzten Jahr habe ich mich im Rahmen einer Jugend-forscht-Arbeit viel mit dem Lösen von Optimierungsproblemen auf adiabatischen Quantencomputern beschäftigt. Wenn ich nicht gerade mit Programmieren beschäftigt bin, fotografiere ich gerne und spiele Trompete oder Klavier.",
      "answers": []
    },
    {
      "id": 55,
      "code": "B3CXGW",
      "public_name": "Jonathan Treffler",
      "biography": "Ich bin 17 Jahre alt, in der 11. Klasse und ich interessiere mich sehr für Softwareentwicklung und Hardware.\r\nAm meisten beschäftige ich mich zur Zeit mit Webdevelopment und Quantencomputern.\r\nIch habe mehrmals bei Jugend Forscht teilgenommen und dabei dieses Jahr zusammen mit 2 Freunden den 4. Platz beim Bundesfinale Jugend Forscht erreicht.\r\nMeine Lieblingsprogrammiersprachen sind: JavaScript, Progressing (= Java Wrapper) und PHP.",
      "answers": []
    },
    {
      "id": 65,
      "code": "9RPFBP",
      "public_name": "Paul Schappert",
      "biography": "*Paul ist ein motivierter und neugieriger Schüler, der sich vor allem für Informatik, Mathematik, Rhetorik und Management interessiert. Er besucht derzeit die Qualifikationsstufe des Musikgymnasiums der Regensburger Domspatzen.*\r\n\r\nMein Name ist Paul Schappert und ich bin 16 Jahre alt. Neben meinen zahlreichen musikalischen Interessen faszinieren mich aber vor allem naturwissenschaftliche Themen. Ich programmiere seit mehreren Jahren und habe mich im letzten Jahr im Rahmen einer Jugend-forscht-Arbeit vor allem mit Quantencomputern- bzw. -annealern beschäftigt. Des Weiteren bin ich ein großer Fan von Algorithmik und Rhetorik, Badminton und Chopin sowie Pizza und Fotografie.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}