{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/11247.html",
  "id": 11247,
  "guid": "bfe5b7b4-8b06-4cce-b979-5a6c0b4995f3",
  "logo": null,
  "date": "2019-12-30T12:30:00+01:00",
  "start": "12:30",
  "duration": "01:00",
  "room": "Eliza",
  "slug": "36c3-11247-technical_aspects_of_the_surveillance_in_and_around_the_ecuadorian_embassy_in_london",
  "title": "Technical aspects of the surveillance in and around the Ecuadorian embassy in London",
  "subtitle": "Details about the man hunt for Julian Assange and Wikileaks",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "en",
  "abstract": "The talk explains and illustrates the procedural and technical details of the surveillance in and around the Ecuadorian embassy in London during the time Julian Assange stayed in there from June 2012 until April 2019. ",
  "description": "In the aftermath of Assange's expel from the ecuadorian embassy in London and his arrest based on a US extradition warrant evidence appeared that the \"Security\" measures of the embassy had at some point switched from protecting Assange and the embassy to an extremely detailled surveillance operation both against Assange and his visitors. The Spanish company \"Undercover Global\" that has been in charge of the embassy between 2015 and April 2018 and its owner and CEO is under investigation for spying on behalf of the CIA. Material from the second company that has taken over the embassy \"Security\" in April 2018 has found its way into an attempted extortion and is also subject to a legal investigation.\r\n\r\nThe talk will contain material both documenting the surveillance measures installed as well as audio and video material obtained by the surveillance gear. It will also briefly touch on surveillance measures experienced elsewhere by friends, lawyers, media partners and associates of Assange and Wikileaks in the context of the ongoing man hunt.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 1752,
      "public_name": "andy"
    }
  ],
  "links": [
    {
      "url": "https://osint.info/index.php?title=UNDERCOVER_GLOBAL_S.L.",
      "title": "Undercover Global S.L. - a spanish company - worked both for the ecuadorian Government and other interested parties and did \"security\" in the Embassy from 2015 till 2018"
    },
    {
      "url": "https://osint.info/index.php?title=PROMSECURITY",
      "title": "Prom Security - an ecudorian company - took over the embassy \"security\" from April 2018"
    },
    {
      "url": "https://osint.info/index.php?title=ASSANGE,_JULIAN",
      "title": "Context on Julian Assange"
    },
    {
      "url": "https://osint.info/index.php?title=WIKILEAKS",
      "title": "Context on Wikileaks"
    }
  ],
  "attachments": []
}