{
  "id": 734,
  "guid": "bff0e477-5a80-52d6-8793-0893ee62aad6",
  "logo": "",
  "date": "2019-12-28T21:00:00+01:00",
  "start": "21:00",
  "duration": "01:00",
  "room": "ChaosZone Bühne",
  "slug": "XNFBGR",
  "url": "https://cfp.chaoszone.cz/36c3/talk/XNFBGR/",
  "title": "Kontrolle von unten - IFG und DSGVO beim Verfassungsschutz",
  "subtitle": "",
  "track": null,
  "type": "Vortrag 60min  (inkl. Q&A)",
  "language": "de",
  "abstract": "Der deutsche Inlandsgeheimdienst arbeitet intransparent. Wir zeigen auf, wie jeder Einzelne dennoch Informationen aus dem \"Verfassungsschutz\" erhalten kann - völlig legal.",
  "description": "Die unzähligen Skandale des \"Verfassungsschutz\" (VS) zeigen: Mehr Transparenz ist dringen nötig. Wir präsentieren euch Wege, abseits von zahnlosen parlamentarischen Kommissionen, um Informationen aus den deutschen Geheimdiensten zu bekommen. \r\nDies umfasst, Auskunftsersuchen zu von euch gespeicherten persönlichen Daten. Aber auch Anfragen nach den Informationsfreiheitsgesetzen zu allgemeinen Dingen wie dem Wasserverbrauch. Zudem erlaubt die Analyse des PR-Materials des VS einen kuriosen Einblick in das Innenleben der Behörden. Unser Vortrag ist praxisorientiert: Praktische Beispiele und erfolgreiche Anfragen stehen im Fokus.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 46,
      "code": "LDCSFB",
      "public_name": "Johannes Filter",
      "biography": "Johannes Filter ist ein freiberuflicher Softwareentwickler und Aktivist für Informationsfreiheit, Civic Tech und Open Data. Er studierte Informatik am Hasso-Plattner-Institut in Potsdam und lebte während seined Studiums für einige Zeit in Tallinn, Estland und Madrid, Spanien. Er ist in verschiedenen Projekten der Open Knowledge Foundation Germany (FragDenStaat, OffeneGesetze und CodeForGermany) aktiv, um Regierungs- und Verwaltungstransparenz zu erhöhen und die Zivilgesellschaft zu stärken.",
      "answers": []
    },
    {
      "id": 73,
      "code": "EM78QC",
      "public_name": "akte",
      "biography": null,
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}