{
  "url": "https://frab.riat.at/en/36C3/public/schedule/events/159.html",
  "id": 4359,
  "guid": "c01cafa7-3c90-4621-8779-eb98a8c2dde0",
  "logo": "/system/events/logos/000/000/159/large/__image.png?1577186078",
  "date": "2019-12-28T14:00:00+01:00",
  "start": "14:00",
  "duration": "01:40",
  "room": "CDC - Workshop area",
  "slug": "36C3-159-open_hardware_dialogues_black_crystal_2",
  "title": "Open Hardware Dialogues: Black Crystal #2",
  "subtitle": "Applications of Trezor Crypto Lib",
  "track": "Workshop",
  "type": "workshop",
  "language": "en",
  "abstract": "In the fourth iteration of the workshop \"Black Crystal\", which has been held previously at RIAT in Vienna, RIAT Cyprus and during HCPP19 in Prague - we are again focusing on Trezor Crypto Lib and on creating small applications based on the ESP32 MCU and the Arduino IDE. \r\n\r\nA core focus of this workshop is to understand the constraints and limitations of cryptographic key generation, especially on slow devices. In the context of the workshop, participants will pragmatically explore different workflows, such as key generation, BIP39, entropy sources, shamir secret sharing. Workshop outcomes are shared in the code-repository of the workshop. ",
  "description": "In the fourth iteration of the workshop \"Black Crystal\", which has been held previously at RIAT in Vienna, RIAT Cyprus and during HCPP19 in Prague - we are again focusing on Trezor Crypto Lib and on creating small applications based on the ESP32 MCU and the Arduino IDE. \r\n\r\nA core focus of this workshop is to understand the constraints and limitations of cryptographic key generation, especially on slow devices. In the context of the workshop, participants will pragmatically explore different workflows, such as key generation, BIP39, entropy sources, shamir secret sharing. Workshop outcomes are shared in the code-repository of the workshop. \r\n\r\nRIAT is an independent R+D institute focussing on Open Hardware, Blockchain and Privacy-Enabling technologies. The institute is active in Austria, Cyprus and the US and exists since 2012. The institute is one of the world’s earliest blockchain institutes. The cryptography and hardware division of RIAT exists since 2017 and works on communicating (open) hardware related topics to developers, enthusiasts and the general public.",
  "recording_license": "The talks at Critical Decentralisation Cluster will be live streamed and recorded. I consent to the use by Monero or RIAT of my image, video, and voice. I understand that this consent is perpetual and my image, video, and voice may appear publicly as part of Monero or RIAT website, Twitter account, YouTube channel and/or other marketing materials, which will be licensed under a Creative Commons Attribution-NonCommercial 4.0 International License. If you would like to opt-out and not be recorded, please contact office@riat.at",
  "do_not_record": false,
  "persons": [
    {
      "id": 27,
      "public_name": "parasew"
    }
  ],
  "links": [
    {
      "url": "https://ohm.oshwa.org/event/open-hardware-dialogues-black-crystal/",
      "title": "Open Hardware Dialogues: Black Crystal"
    }
  ],
  "attachments": []
}