{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10968.html",
  "id": 10968,
  "guid": "c0a8c771-f942-41da-bdc8-f031ae53a353",
  "logo": "/system/events/logos/000/010/968/large/mgehemcmlogioomd.png?1572433715",
  "date": "2019-12-29T22:50:00+01:00",
  "start": "22:50",
  "duration": "00:40",
  "room": "Clarke",
  "slug": "36c3-10968-content_take-downs_who_cleans_the_internet",
  "title": "Content take-downs: Who cleans the internet?",
  "subtitle": "EU plans to swipe our freedom of expression under the carpet",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "en",
  "abstract": "The quest towards a “cleaner” internet continues – with “censorship machines” included in the EU Copyright Directive, upload filters proposed in the Terrorist Content Regulation, and numerous other initiatives to push dominant platforms to police online content. This talk will present the next big battles for free speech online at the European level.",
  "description": "The next important battle for our rights and freedoms in the digital sphere is looming on the horizon. Policymakers wage war against “harmful” speech online, relying on the centralisation of the web around few platforms that function as “walled gardens”. Heated debates on upload filters recently took place around the copyright reform and the fight against online terrorist propaganda. \r\n\r\nThe next challenge for our freedom of expression online is a planned update to rules that deal with illegal and “harmful” content: E-Commerce Directive. E-Commerce was adopted two decades ago, but the way the internet looks like has drastically changed since. The amount of user-uploaded content has exploded, and few dominant platforms have an increasing impact on people’s rights and freedoms. \r\nHow does the current online landscape look like? What are the policy options the EU is facing in terms of platform regulation? How can we achieve human rights-compliant content moderation rules?",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9013,
      "public_name": "Chloé Berthélémy"
    },
    {
      "id": 4366,
      "public_name": "Thomas Lohninger"
    }
  ],
  "links": [
    {
      "url": "https://edri.org/",
      "title": "EDRi website"
    }
  ],
  "attachments": []
}