{
  "id": 4125,
  "guid": "c140ffe9-2462-5e39-910e-1a4d18742078",
  "logo": "/media/36c3/images/BEKPLP/AI_in_Artistic_Practice__web_Fn36KML.jpg",
  "date": "2019-12-28T14:00:00+01:00",
  "start": "14:00",
  "duration": "00:45",
  "room": "Art-and-Play Stage",
  "slug": "BEKPLP",
  "url": "https://stage.artesmobiles.art/36c3/talk/BEKPLP/",
  "title": "AI in Artistic Practice: Different strategies how to use AI as a tool and artistic media",
  "subtitle": "",
  "track": "Lecture",
  "type": "Lecture",
  "language": "en",
  "abstract": "\\#artist talk and Q&A 45 min",
  "description": "The lecture locates AI as an artistic tool in art history.\r\n\r\nThe development in technology changed the interaction and role of the artist and the machine within the creative process in painting, music, performance, film, architecture and design. The use of AI in the artistic world is still very new and therefore there is not much history of collaborations between artists and AI systems. This talk gives a brief overview of the use of algorithms in the creative process and an introduction to the functioning of neural networks using the example of the work \"Speculative Artificial Intelligence\". Differences between working with algorithms and AI will be pointed out and general strategies for using AI within the artistic process will be proposed.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 1,
      "code": "7N9STB",
      "public_name": "Birk Schmithüsen",
      "biography": "Birk Schmithüsen is an audio-visual artist based in Leipzig, Germany. His work explores emerging technologies that affect our everyday lives. For his artistic research, he uses non-perceptible, abstract concepts such as Artificial Intelligence, Big Data and Computer Vision as artistic media. He converts his concepts into immersive installations with new media.\r\n\r\nhttp://www.birkschmithuesen.com\r\nhttps://github.com/birkschmithuesen/\r\nhttps://www.facebook.com/birk.schmithusen\r\nhttps://www.instagram.com/birk_schmithuesen/",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}