{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10862.html",
  "id": 10862,
  "guid": "c2619236-c88d-40ee-9d9d-9dfffd5212ef",
  "logo": "/system/events/logos/000/010/862/large/sensebox_logo_neu.png?1576613698",
  "date": "2019-12-28T18:10:00+01:00",
  "start": "18:10",
  "duration": "00:40",
  "room": "Dijkstra",
  "slug": "36c3-10862-offene_sensordaten_fur_jedermann_-_ein_citizen_science_projekt_basierend_auf_open_source_und_open_hardware",
  "title": "Offene Sensordaten für Jedermann - Ein Citizen Science Projekt basierend auf Open Source und Open Hardware",
  "subtitle": "",
  "track": "Resilience & Sustainability",
  "type": "lecture",
  "language": "de",
  "abstract": "Der Talk soll die Geschichte der senseBox von Beginn bis jetzt wiedergeben. Dabei möchte ich vor allem auf unsere Arbeit im Bereich Open Source, Open Data, Open Hardware und Open Educational Resources eingehen. Die Motivation von Teilnehmern des senseBox Projekts möchte ich basierend auf einer Nutzerstudie kurz wiedergeben. Außerdem möchte ich auf aktuelle Probleme sowie technische Hürden und die Genauigkeit der Daten eingehen. Zu guter Letzt gebe ich einen kurzen Ausblick in die Zukunft des Projekts.",
  "description": "Mithilfe der senseBox, einem DIY Citizen Science Baukasten, kann jeder an der Forschung und Wissenschaft teilnehmen. Sei es durch die Messung von Umweltdaten, Analyse und Auswertung dieser Daten oder durch die Teilnahme an Diskussionen einer großen Community. Außerdem können Schülerinnen und Schüler durch die Nutzung von Open Educational Resources und einer visuellen Entwicklungsumgebung das Programmieren spielend erlernen. Dadurch wird nicht nur das Umweltverständnis, sondern auch die digitale Bildung gefördert.\r\nDie Hardware der senseBox basiert auf dem Konzept von Arduino und enthält neben dem Microcontroller noch weitere Umweltsensoren. Jegliche Projekte, von einer einfachen Wetterstation über ein intelligentes Bewässerungssystem für den Garten bis hin zu einer Wasserqualität-Boje in der Nordsee, sind durch die offene Arduino Plattform umsetzbar. Das Rückgrat der senseBox ist die openSenseMap. Das Backend sammelt die gesendeten Daten der senseBoxen aber auch anderer Geräte. Sensoren zur Luftqualität von Luftdaten.info oder HackAIR sowie alle anderen Geräte können ihre Sensordaten zur offenen API der openSenseMap senden. Die Webanwendung ermöglicht Visualisierungen und Analysemöglichkeiten. Die Daten sind über die API für jeden frei verfügbar und können somit unter anderem für die Klimaforschung genutzt werden. \r\nDas Projekt startete vor einigen Jahren als Studienprojekt an der Universität Münster. Nach mehreren Abschlussarbeiten, Projektwochen, Workshops und Förderperioden entstand aus einer einfachen Idee ein umfangreiches Toolkit. Die openSenseMap, auf welcher anfänglich einige Dutzend senseBoxen registriert waren, verzeichnete in den letzten 5 Jahren steigende Nutzerzahlen mit aktuell rund 5300 registrierten senseBoxen. Daraus resultieren Probleme, welche zu Beginn des Projekts nicht absehbar waren: die Webanwendung läuft inzwischen in der Cloud und fordert viel Rechen- und Speicherkapazität. Die Messdaten werden ineffizient in Datenbanken gespeichert, dadurch benötigt die Anwendung starke virtuelle Server.\r\nDer Talk soll die Geschichte der senseBox von Beginn bis jetzt wiedergeben. Dabei möchte ich vor allem auf unsere Arbeit im Bereich Open Source, Open Data, Open Hardware und Open Educational Resources eingehen. Die Motivation von Teilnehmern des senseBox Projekts möchte ich basierend auf einer Nutzerstudie kurz wiedergeben. Außerdem möchte ich auf aktuelle Probleme sowie technische Hürden und die Genauigkeit der Daten eingehen. Zu guter Letzt gebe ich einen kurzen Ausblick in die Zukunft des Projekts.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9635,
      "public_name": "Felix Erdmann"
    }
  ],
  "links": [
    {
      "url": "https://sensebox.de/",
      "title": "senseBox"
    },
    {
      "url": "https://opensensemap.org/",
      "title": "openSenseMap"
    }
  ],
  "attachments": [
    {
      "url": "/system/event_attachments/attachments/000/003/919/original/36c3_senseBox.pdf?1572014737",
      "title": "36c3_senseBox.pdf"
    }
  ]
}