{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10918.html",
  "id": 10918,
  "guid": "c4b8c3d3-6a28-4137-a532-e61a742b9e64",
  "logo": null,
  "date": "2019-12-29T17:30:00+01:00",
  "start": "17:30",
  "duration": "01:00",
  "room": "Clarke",
  "slug": "36c3-10918-thrust_is_not_an_option_how_to_get_to_mars_really_slow",
  "title": "Thrust is not an Option: How to get to Mars really slow",
  "subtitle": "",
  "track": "Science",
  "type": "lecture",
  "language": "en",
  "abstract": "<p>In this talk we will see how chaos can be used to find very peculiar trajectories for space crafts within the Solar System. To understand this, we will also have a short look at the basics of orbital mechanics as well as three-body problems.</p> ",
  "description": "<p>When traveling to Mars in a space craft, you want to find a compromise between flight duration and fuel consumption. One common trajectory for achieving this is the so-called Hohmann transfer which takes about 9 months from Earth and needs two maneuvers, both of which are accelerations!</p>\r\n\r\n<p>Usually, when modeling movement of space crafts, one uses the Kepler model of two massive bodies attracting each other via gravitation. In case you have more time available for a space journey, however, you might consider a third body in your calculations. This introduces a very chaotic behavior, which you can use in turn to find very special trajectories that allow you to get to various places spending a lot less fuel. Unfortunately this will be much slower.</p>\r\n\r\n<p>These special trajectories are called low-energy transfers and form a part of the so-called interplanetary transport network. There have been a handful of missions already using these trajectories, e.g. JAXA’s Hiten probe in 1990 and ESA’s BepiColombo which is en route to Mercury right now.</p>\r\n\r\n<p>In this talk we will have a short introduction to the ever-surprising world of orbital mechanics followed by a discussion of the three-body problem including Lagrangian points. We will then see what the so-called weak stability boundary is and how chaos can help us understand why these strange trajectories exist. No math knowledge required!</p>",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 8640,
      "public_name": "sven"
    }
  ],
  "links": [],
  "attachments": []
}