{
  "id": 883,
  "guid": "c63bc33d-9ddd-5171-8444-a9a0e1030e1b",
  "logo": "",
  "date": "2019-12-28T20:15:00+01:00",
  "start": "20:15",
  "duration": "01:00",
  "room": "dezentrale*",
  "slug": "Y38LJT",
  "url": "https://talks.komona.org/36c3/talk/Y38LJT/",
  "title": "The Healing-Work Quantum",
  "subtitle": "",
  "track": null,
  "type": "Session",
  "language": "en",
  "abstract": "A work of love? How can we allow anarchy complete freedom, while assuring the success of those willing to work for more freedoms. What more freedom could we have than the choice between following logical orders (Nature, Resources, Health, Mathematics) and the more paradoxical, semantically expressed human-result of a successful permaculture (whether ordered, or human-self-derived-power sustainable. Ahimsa argues, these are obligate mutualisms, and explains the order-system we can engage now, so that we can later rest in the peace of our own definition, sharing the necessary element that others have better resources for gaining their own definition, given that that definition is inherently not the definitions we give now (the system). Die Ahnten sind bereite Niederarchistische Netzwerk Operator und \"Aunti Anna-christians\" (ermöglicht eine Antwort auf die wissenschaftliche Frage: geht es Aunti-Anarchistinnen besser ohne ein zu mathematischen Überlegungendie mit auf dem Systemwechsel sich vorbereiten. Erklärt wird Heilung- und Arbeit als Quanta eines sich endgültigen",
  "description": "Die Ahnten sind bereite Niederarchistische Netzwerk Operator und \"Aunti Anna-christians\" (ermöglicht eine Antwort auf die wissenschaftliche Frage: geht es Aunti-Anarkirsttinnen besser ohne ein rech(t?)enförderndes System. Paradoxerweise schlägt Ahimsa die Prüfung vor, mit Gewissheit neben einem Ökosysten unterstutzenden Geniëßerschaft Program zur Genese einer fast-anarchistischen, fast-anonymen, reine-Freiheit ausspückenden  rechnerischen definierbaren Heil-Arbeit,. Wo die pure Anarchie dann nur neben ihrer   . Erklärt wird Heilung- und Arbeit als Quanta eines capture-it-all-ismus erlösendes System.\r\n\r\nAuch erklärt werden \r\n\r\n\r\nA work of love? How can we allow anarchy complete freedom, while assuring the success of those willing to work for more freedoms. What more freedom could we have than the choice between following logical orders (Nature, Resources, Health, Mathematics) and the semantically expressed successful permaculture that results from the proposed internet.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 74,
      "code": "833FE3",
      "public_name": "Ahimsa",
      "biography": "",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}