{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10595.html",
  "id": 10595,
  "guid": "c73debf0-e6be-4bde-84b5-afaddbe0e3fa",
  "logo": "/system/events/logos/000/010/595/large/tresor.png?1571148674",
  "date": "2019-12-27T16:10:00+01:00",
  "start": "16:10",
  "duration": "01:00",
  "room": "Ada",
  "slug": "36c3-10595-hacker_hin_oder_her_die_elektronische_patientenakte_kommt",
  "title": "\"Hacker hin oder her\": Die elektronische Patientenakte kommt!",
  "subtitle": "",
  "track": "Security",
  "type": "lecture",
  "language": "de",
  "abstract": "Herzstück der digitalen Gesundheitsversorgung für 73 Millionen Versicherte ist die hochsichere, kritische Telematik-Infrastruktur mit bereits 115.000 angeschlossenen Arztpraxen. Nur berechtigte Teilnehmer haben über dieses geschlossene Netz Zugang zu unseren medizinischen Daten. Ein \"Höchstmaß an Schutz\" also, wie es das Gesundheitsministerium behauptet? Bewaffnet mit 10.000 Seiten Spezifikation und einem Faxgerät lassen wir Illusionen platzen und stellen fest: Technik allein ist auch keine Lösung. Braucht es einen Neuanfang?",
  "description": "Schon in 12 Monaten können 73 Millionen gesetzlich Versicherte ihre Gesundheitsdaten in einer elektronischen Patientenakte speichern lassen. Dazu werden zurzeit alle Arztpraxen, Krankenhäuser und Apotheken Deutschlands über die neu geschaffene kritische Telematik-Infrastruktur verbunden.\r\n\r\nDieses hochverfügbare Netz genügt \"militärischen Sicherheitsstandards\", bietet ein \"europaweit einzigartiges Sicherheitsniveau\" und verspricht ein \"Höchstmaß an Schutz für die personenbezogenen medizinischen Daten\" wie Arztbriefe, Medikamentenpläne, Blutbilder und Chromosomenanalysen.\r\n\r\n\"Wir tun alles, damit Patientendaten sicher bleiben.\"\r\n\r\n\"Selbst dem Chaos Computer Club ist es nicht gelungen, sich in die Telematik-Infrastruktur einzuhacken.\"\r\n\r\n\"Nach den Lehren aus PC-Wahl, Ladesäulen und dem besonderen elektronischen Anwaltspostfach brauchen wir kein weiteres Exempel.\"",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 7912,
      "public_name": "Martin Tschirsich"
    },
    {
      "id": 9376,
      "public_name": "cbro - Dr. med. Christian Brodowski"
    },
    {
      "id": 9406,
      "public_name": "Dr. André Zilch"
    }
  ],
  "links": [],
  "attachments": []
}