{
  "id": 759,
  "guid": "c8a7c2e7-a24f-5b47-a60e-0dadb819804d",
  "logo": "/media/36c3/images/Q83NB8/classes.jpg",
  "date": "2019-12-28T22:30:00+01:00",
  "start": "22:30",
  "duration": "00:30",
  "room": "ChaosZone Bühne",
  "slug": "Q83NB8",
  "url": "https://cfp.chaoszone.cz/36c3/talk/Q83NB8/",
  "title": "Solidarity with Academics on Exile: Off-University",
  "subtitle": "",
  "track": "Ethics, Society & Politics",
  "type": "Vortrag 60min  (inkl. Q&A)",
  "language": "en",
  "abstract": "Off-University (Organization Für den Frieden-University), a research collaboration which was established for and by persecuted academics from Turkey. It is a space for collaborative research projects. We have an online platform which connects former colleagues, or students and their former supervisors to start projects together. The idea is to establish a concrete solidarity channel with academics all over the world, specifically, the ones who have been purged from their institutions, forced to resign, who are legally and politically persecuted and even imprisoned because of their opinion and research. We offer researchers, lecturers and students the chance to teach, share and produce knowledge away from government surveillance and repression via our safe online platform. Through such civic disobedience, it combines the good old ideal of academic freedom with state of the art digital communication and collaboration opportunities. Off-University’s mission is based on its commitment to peace in the world and to living together in diversity. It therefore seeks to develop emancipatory education-research activities that are less hierarchical and more democratic!",
  "description": "We want to build a worldwide online/offline community that is horizontal and inclusive by using new online teaching methodologies and interactive learning settings. We engage ourselves in online/offline group work activities by developing knowledge on online teaching methods with our lecturers and so on. We also want to create an autonomous community of lecturers and students online and offline as a university thrives on exchange and interaction outside of formal teaching hours. The idea is to establish a digital social place through online discussions and lecture series, and by increasing the visibility and legitimacy of our initiative, encouraging co-learning, student to student feedback and critical thinking.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 71,
      "code": "YTYWWK",
      "public_name": "Havle Guney",
      "biography": "Hi! I'm applying on behalf of Off-University where I'm working as a course assistant and a volunteer. \r\n\r\nMore about us: https://off-university.com/ \r\nOur online platform: https://coworkingsquares.de//de-DE/Login\r\n\r\nCheers!",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}