{
  "id": 814,
  "guid": "c8b27e16-7671-5fdb-9dca-c09b6dc8ce05",
  "logo": "",
  "date": "2019-12-27T16:00:00+00:00",
  "start": "16:00",
  "duration": "01:30",
  "room": "Dome 1",
  "slug": "78GZP7",
  "url": "https://talks.komona.org/36c3/talk/78GZP7/",
  "title": "Balancing idea and reality of no work in 1Komona",
  "subtitle": "",
  "track": null,
  "type": "Workshop",
  "language": "en",
  "abstract": "A session, exchange, release, reflection on different ideas  and the reality of decentralized organisation, recentralized responsibility and the metaphysics of Ideas and their work load.",
  "description": "What happened when komona started to decentralize? Didn't it actually started decentralized and just grew bigger? How long does it take, what did help, what did go wrong. What do you have to share and adress, what have ppl to share that slided into centralized roles again? \r\nHow could these roles be defined to help the goal of decentralized and transparent organisation that allows maximum spontaneity without overwhelimg single points of failure and ppl? \r\nSpontaneity is core and at the same its a mechanic of disabling others to prepare and think before doing, whether they would like to or not. \r\nSo, how to go on. \r\nStarting with the collection of work that was done to establish a shared knowledge base: what was on the table for this years conoma?\r\n\r\n*If you want to make a good talk, you can't only think of what information you really want to talk about, you have to think of what information the people want/need to hear to get into the topic. Otherwise it wouldn't make sense, you can talk alone than.* (anonymous)",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 26,
      "code": "W3ZWBB",
      "public_name": "me? you?",
      "biography": "ppl within komona doing things, this is an account that chosed to be anonymous to be able to enter sessions for other ppl and surprise who will host the workshop.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}