{
  "id": 4137,
  "guid": "c905bda5-6b3c-5a07-84b1-c81982f812c6",
  "logo": "/media/36c3/images/SBPQMP/Hackitat___web_77nF2fz.jpg",
  "date": "2019-12-27T17:30:00+01:00",
  "start": "17:30",
  "duration": "01:10",
  "room": "Art-and-Play Stage",
  "slug": "SBPQMP",
  "url": "https://stage.artesmobiles.art/36c3/talk/SBPQMP/",
  "title": "Hackitat – 9 layers of political hacking",
  "subtitle": "",
  "track": "Screening",
  "type": "Screening",
  "language": "en",
  "abstract": "documentary, 70 min + Q&A, 2019, english language",
  "description": "The documentary takes a look at hacking beyond the computer screens. In the place where technology and activists meet. Where the need to circumvent state surveillance and surveillance capitalism is grave. Where people see an unfair system in society and find a way to hack it. This is the true hacker habitat.\r\n\r\nIn direct opposition to banks, corporations and entrepreneurs using the words 'hack/hackathon', the film aims to fill the words with the subversive and anarchist tradition they have. In a chapter form, this film shows hacker projects and system hacking from Japan, Cuba, occupied Western Sahara, Belgium and Sweden. The chapters are mixed with parts where hackers talk about the ethics behind what they do and the film mirrors the ideas with texts based on Emma Goldman's writings. Filmed in the 2010s it gives an incite to a global political hacker movement.\r\n\r\nAfter the preview screening we would love to hear your comments! We are still in the face where we will edit the final version. People from the film and the production group will talk more about the process and answer questions. The final version of the documentary will be released during the spring of 2020.\r\n\r\nhttp://www.hackitat.com/\r\nhttp://rafilm.se/",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 29,
      "code": "V7RNVV",
      "public_name": "RåFILM filmmakers collective",
      "biography": null,
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}