{
  "id": 755,
  "guid": "c94b2649-3b09-5288-b831-5d1a0f9612b9",
  "logo": "",
  "date": "2019-12-27T19:25:00+01:00",
  "start": "19:25",
  "duration": "00:30",
  "room": "ChaosZone Bühne",
  "slug": "RMLDZA",
  "url": "https://cfp.chaoszone.cz/36c3/talk/RMLDZA/",
  "title": "Orientalism...what? How seemingly harmless narratives perpetuate inequalities",
  "subtitle": "",
  "track": null,
  "type": "Vortrag 30 min (incl. Q&A)",
  "language": "en",
  "abstract": "Orientalism is a concept that reveals how people categorize and discriminate against others by using seemingly positive or harmless attributions and images. In an interactive presentation, we will introduce Edward Said’s concept to the audience by examining selected Twitter and Instagram posts.\r\n#Orientalism #Postcolonialism #Othering #Racism #Sexism",
  "description": "NGOs are doing it, the new film about PJ Harvey is doing it, most of us are doing it: using Orientalist narratives to describe the world around us. This happens consciously and more often unconsciously and perpetuates imperialistic perceptions about the (flexible) “Other”. \r\nWhenever we order an “exotic Asian salad”, bring back “those beautiful indigenous souvenirs” or by having an Orientalist gaze when travelling and taking picture only of the things that seem “exciting and characteristic”, we create an unequal image of “us” and “them”. \r\nAs we can see from these examples, the concept of Orientalism is not limited geographically but uncovers seemingly positive and harmless but deeply discriminating narratives everywhere - one famous example being the discourses about East Germany from a West German perspective. \r\nIn this presentation, we will explain the concept of Orientalism (Edward Said, 1978) by discussing written examples from Twitter and visual examples from Instagram to uncover the traps and temptations of Orientalism. \r\n#Orientalism #Postcolonialism #Othering #Racism #Sexism",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 66,
      "code": "BGST7D",
      "public_name": "Nina Szogs",
      "biography": "Nina Szogs is a gender, migration and sustainability researcher and works in the field of science communication with universities, museums, NGOs and artists. @ninaszogs",
      "answers": []
    },
    {
      "id": 67,
      "code": "T9ZTMY",
      "public_name": "Barbara Kurz",
      "biography": null,
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}