{
  "id": 731,
  "guid": "c959c52f-5414-5105-bb36-8a6fc4d30fb9",
  "logo": "",
  "date": "2019-12-30T13:00:00+01:00",
  "start": "13:00",
  "duration": "00:30",
  "room": "ChaosZone Bühne",
  "slug": "RUWJGT",
  "url": "https://cfp.chaoszone.cz/36c3/talk/RUWJGT/",
  "title": "fli4l – the flexible internet router for linux",
  "subtitle": "",
  "track": null,
  "type": "Vortrag 30 min (incl. Q&A)",
  "language": "de",
  "abstract": "Internet-Router mit Linux, aktueller Software, aber kein OpenWRT oder IPFire? **fli4l** ist eine freie Router-Distribution für diverse Einsatzszenarios, jetzt auch ohne Disketten.",
  "description": "Vergesst Disketten und ISDN! Das fast 20 Jahre alte Linux-Router-Projekt [fli4l](http://www.fli4l.de/) läuft auf modernem Unterbau mit aktuellen Treibern auf (fast) beliebiger x86 Hardware. Ein fli4-Router routet IPv6, baut OpenVPN-Tunnel, kann mit multiplen Uplinks arbeiten, unterstützt Bridges, VLAN und Bonding. Er agiert als DNS- und DHCP-Server und natürlich auch als Paketfilter und Firewall, auch für mehr als ein Netz. Auch Funk mit UMTS, LTE und WLAN ist an Bord. Sogar ISDN wird noch unterstützt.\r\n\r\nIm Vortrag geht es nur am Rande um die Geschichte von fli4l als Diskettenrouter. Gezeigt werden aktuelle Möglichkeiten und Einsatzszenarien, das moderne Buildroot, das flexible Circuit-System, aber auch die Ecken und Kanten an denen man die Geschichte der Distribution ablesen kann und wo sich interessierte Hacker bei der Modernisierung austoben können.\r\n\r\nGut dokumentiert und auf Basis von Linux und Freier Software ist fli4l eine Möglichkeit seine Routerfreiheit zu genießen. Keep it running!",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 42,
      "code": "TBQ7TA",
      "public_name": "Alexander Dahl",
      "biography": "Embedded Linux Developer. 2001 in den Linux-Topf gefallen. Seit 2011 auf Chaos-Events. Mitgründer des Hackerspace Netz39 in Magdeburg. Akzeptiert Cookies.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}