{
  "id": 593,
  "guid": "c95ae46b-dc34-55fd-bff7-026a9d252de9",
  "logo": "/media/36c3/images/EGBN8W/CFG_500x500.jpg",
  "date": "2019-12-27T21:00:00+01:00",
  "start": "21:00",
  "duration": "00:30",
  "room": "WikiPaka WG: Esszimmer",
  "slug": "EGBN8W",
  "url": "https://cfp.verschwoerhaus.de/36c3/talk/EGBN8W/",
  "title": "Code for Germany. Gute Taten mit offenen Daten",
  "subtitle": "",
  "track": "Community",
  "type": "Talk",
  "language": "de",
  "abstract": "Seit fünf Jahren setzen sich innerhalb des Netzwerks [„Code for Germany“](https://codefor.de) in ganz Deutschland rund 300 Ehrenamtliche für offene Daten ein und bauen damit Anwendungen für alle. Auch 2019 ist bei uns einiges passiert, was wir euch hier vorstellen wollen. Wir haben uns beispielsweise mit Daten zu Umwelt, Politik und jeder Menge Kartenmaterial beschäftigt und viele neue Projekte am Start. Manche glänzen schon richtig, andere suchen noch Unterstützung. Im Talk erklären wir, was offene Daten eigentlich sind, was man daraus bauen kann und wie man bei uns mitmachen kann.",
  "description": "[Code for Germany](https://codefor.de) ist ein Netzwerk von Gruppen ehrenamtlich engagierter Freiwilliger. Wir nutzen unsere Fähigkeiten, um unsere Städte und das gesellschaftliche Miteinander positiv zu gestalten. Wir setzen uns für mehr Transparenz, Offene Daten und Partizipation in unseren Städten ein. Wir vermitteln insbesondere zwischen Zivilgesellschaft, Verwaltung und Politik und nutzen unsere Fähigkeiten, um die Kommunikation zwischen diesen zu verbessern und notwendige Impulse zu setzen, damit die Möglichkeiten der offenen und freien Digitalisierung so vielen Menschen wie möglich zugute kommen.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 67,
      "code": "ZYZHQS",
      "public_name": "Julia",
      "biography": "Ich bin Julia und versuche seit 2018 bei Code for Osnabrück zu programmieren, muss aber meistens allen möglichen Menschen erstmal erklären, warum offene Daten so unglaublich wichtig sind. Das mache ich aber sehr gerne. Außerdem bin ich seit Anfang 2019 im Community-Rat von Code for Germany.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}