{
  "id": 1219,
  "guid": "c997a62c-fd35-4c59-99f9-324cd4e62b65",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Ask_the_Electronic_Frontier_Foundation",
  "logo": null,
  "date": "2019-12-29T19:00:00+01:00",
  "start": "19:00",
  "duration": "1:00",
  "room": "Lecture room M1",
  "slug": "36c3-1219-session_ask_the_electronic_frontier_foundation",
  "title": "Ask the Electronic Frontier Foundation",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "discussion",
  "language": "en",
  "abstract": "",
  "description": "\"Ask the EFF\" will be a panel presentation and question-and-answer session with the Electronic Frontier Foundation, featuring Kurt Opsahl, Deputy Executive Director and General Counsel; and Staff Technologists Alexis Hancock and Mona Wang\n\"Ask the EFF\" will be a panel presentation andquestion-and-answer session with the Electronic Frontier Foundation,featuring Kurt Opsahl, Deputy Executive Director and General Counsel;and Staff Technologists Alexis Hancock and Mona Wang. Come for thelatest information about how the law is racing to catch up withtechnological change from staffers at the Electronic FrontierFoundation, the Internet's premiere digital civil liberties groupfighting for freedom and privacy in the computer age. Come with yourquestions about current EFF issues such as the effort to undermineencryption (and add backdoors), discussion of our technology projectslike Certbot (now our of beta!), encrypted DNS, and privacy enhancingsoftware, and much more that are important to you.urt Opsahl is the Deputy Executive Director andGeneral Counsel of the Electronic Frontier Foundation. In addition torepresenting clients on civil liberties, free speech and privacy law,Opsahl counsels on EFF projects and initiatives. Opsahl is the leadattorney on the Coders' Rights Project.Alexis Hancock is a Staff Technologist who works on EFF's HTTPSEverywhere web extension. She's researches ways to expand and advocateconsumer privacy, with a recent focus on mobile and dedicates time toclose the equity gap in tech.Mona Wang is a Staff Technologist working on our initiative to encryptthe entire Internet. She researches and tracks methods of globalInternet censorship for our International working group. She alsodevelops  STARTTLS Everywhere, an initiative to secure email delivery,and our Let's Encrypt client, Certbot, to secure the web with HTTPS.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Dreirik",
      "public_name": "Dreirik"
    }
  ],
  "links": [
    "https://eff.org/"
  ]
}