{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10885.html",
  "id": 10885,
  "guid": "ca958208-abe7-4840-b938-193780eafca0",
  "logo": null,
  "date": "2019-12-30T13:50:00+01:00",
  "start": "13:50",
  "duration": "00:40",
  "room": "Eliza",
  "slug": "36c3-10885-unpacking_the_compromises_of_aadhaar_and_other_digital_identities_inspired_by_it",
  "title": "Unpacking the compromises of Aadhaar, and other digital identities inspired by it",
  "subtitle": "Governments around the world are implementing digital identity programs that don't work",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "en",
  "abstract": "Aadhaar is India's national biometric identity database, with over one billion records comprising fingerprints, iris scans and basic demographic information. It is presented as identity technology, allowing an individual to identify themselves, but also as an identification technology, allowing the state to see an individual, identify fraudulent welfare beneficiaries, and thus realise savings. These claims are not complementary. They are in fact contradictory, compromising each other. If one must be true, the other must somehow be false, and this is the reality of Aadhaar.",
  "description": "This talk will demonstrate how Aadhaar's attempt to be a cure for all kinds of ailments has in fact resulted in large scale exclusion and fraud. We will look at a series of design assumptions in Aadhaar's architecture, the gaps in them, and then examples of how these gaps were exploited, from public news reports.\r\n\r\nAadhaar is often touted as a revolutionary technology that has simultaneously given identity to billions and realised substantial savings from fraud for the government. These utopian visions are finding buyers around the world. Jamaica, Morocco and Kenya have all adopted projects inspired by Aadhaar, and more countries are following suit.\r\n\r\nUnfortunately, Aadhaar is not magic, and there is now an urgent need for a sober understanding to be taken worldwide.\r\n\r\nThe Kaarana project began in 2017 as a collaboration between programmers and lawyers, to document architectural assumptions and their impact on human rights. The project's findings were presented as evidence to the Supreme Court of India in 2018, and are acknowledged in a scathing dissent by Justice Chandrachud (September 2018). This dissent was in turn cited by the Supreme Court of Jamaica to shut down a biometric identity program in that country (April 2019). In September 2019, Kaarana member Anand Venkatanarayanan also appeared as a witness in the Supreme Court of Kenya in a petition against Huduma Namba, the Kenyan biometric identity program.\r\n\r\nWe hope that this presentation at CCC will help public interest technologists from around the world prepare for a critical examination of similar programs in their countries.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9496,
      "public_name": "Kiran Jonnalagadda"
    }
  ],
  "links": [
    {
      "url": "https://medium.com/karana",
      "title": "Kaarana blog (contains works not published in mainstream publications)"
    }
  ],
  "attachments": []
}