{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10711.html",
  "id": 10711,
  "guid": "cbaeb1aa-fb02-465b-b6f7-04106c7245f2",
  "logo": null,
  "date": "2019-12-29T23:50:00+01:00",
  "start": "23:50",
  "duration": "00:40",
  "room": "Clarke",
  "slug": "36c3-10711-5g_net_neutrality",
  "title": "5G & Net Neutrality",
  "subtitle": "Status of the Net Neutrality Reform in Europe",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "en",
  "abstract": "Three and a half years after Europe enshrined net neutrality in law, the protections for the open internet are being renegotiated. Europe finds itself in the middle of an immense lobbying battle about the legality of internet blocking, zero-rating and the internet as a common carrier for everyone. All this while the EU is also the first world region trying to fit the next mobile network standard 5G into the net neutrality framework as we currently know it. This talk will give a brief summary about the past years of regulatory enforcement, how the internet has developed in Europe and what to expect from the ongoing reform. ",
  "description": "The Body of European Regulators for Electronic Communication (BEREC) is currently reforming the net neutrality framework of the EU. The reform started in late 2018 and will come to a conclusion in March 2020. The talk will outline the full reform process and explain the issues the digital rights community is fighting for. A particular focus will be on the challanges that the next mobile network standard 5G brings to the net neutrality debate and what to expect from new technology aspects like network slices and edge computing. \r\n\r\nAdditionally, we will give insights into net neutrality enforcement throughout the European Union in the past three and a half years. This section of the talk is based on a comprehensive study which epicenter.works has conducted in 2019. \r\n\r\nThe Austrian digital rights NGO epicenter.works is a leading net neutrality advocate in the EU. Their campaign www.savetheinternet.eu followed the policy debate to enshrine net neutrality in law in the European Union and lasted from 2013 until 2016. Since then, the organisation has become a public watchdog on the regulatory enforcement of the rules and published extensive legal and technical analysis on net neutrality violations. They try to shape the regulatory and public debate by speaking at annual shareholder meetings of Deutsche Telekom and participate in expert consultations from telecom regulators. \r\n\r\nWith the ongoing reform, the net neutrality debate in Europe is heating up once again, with an uncertain outcome. ",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 4366,
      "public_name": "Thomas Lohninger"
    }
  ],
  "links": [
    {
      "url": "https://en.epicenter.works/",
      "title": "epicenter.works - for digital rights"
    },
    {
      "url": "https://berec.europa.eu/eng/news_consultations/ongoing_public_consultations/5947-public-consultation-on-the-document-on-berec-guidelines-on-the-implementation-of-the-open-internet-regulation",
      "title": "Public consultation on the document on BEREC Guidelines on the Implementation of the Open Internet Regulation (10.10.2019)"
    },
    {
      "url": "https://en.epicenter.works/thema/net-neutrality",
      "title": "Dossier Net Neutrality"
    },
    {
      "url": "https://savetheinternet.eu/",
      "title": "savetheinternet.eu"
    },
    {
      "url": "https://en.epicenter.works/document/1522",
      "title": "Report: The Net Neutrality Situation in the EU"
    },
    {
      "url": "https://edri.org/zero-rating-why-dangerous-for-our-rights-freedoms/",
      "title": "Zero rating: Why it is dangerous for our rights and freedoms (22.06.2016)"
    },
    {
      "url": "https://edri.org/ngos-and-academics-warn-against-deep-packet-inspection/",
      "title": "NGOs and academics warn against Deep Packet Inspection (15.05.2019)"
    },
    {
      "url": "https://edri.org/net-neutrality-vs-5g-what-to-expect-from-the-upcoming-eu-review/",
      "title": "Net Neutrality vs. 5G: What to expect from the upcoming EU review? (05.12.2018)"
    }
  ],
  "attachments": []
}