{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/11030.html",
  "id": 11030,
  "guid": "cc3e9b8a-14e3-425a-b683-4eab463ed1bd",
  "logo": null,
  "date": "2019-12-29T16:10:00+01:00",
  "start": "16:10",
  "duration": "01:00",
  "room": "Eliza",
  "slug": "36c3-11030-degrowth_is_coming_-_be_ready_to_repair",
  "title": "Degrowth is coming - be ready to repair",
  "subtitle": "",
  "track": "Resilience & Sustainability",
  "type": "lecture",
  "language": "de",
  "abstract": "Der Diskurs um die \"Digitalisierung\" kann vor allem eines: Verheißen. Roboter befreien uns von mühsamer Arbeit, Effizienzsteigerungen sorgen von ganz allein für den Schutz von Umwelt und Ressourcen und Algorithmen erleichtern uns den Alltag. Dass diese Verheißungen vor allem Tech-Konzernen in die Tasche spielen und wir dank der datenraff(inier)enden Geschäftsmodelle des digitalen Kapitalismus auf ökologische und soziale Katastrophen zusteuern, soll in dem Vortrag gezeigt werden. \r\nKann die Wirtschaft dank effizienterer Technologien weiter wachsen ohne dabei Ressourcen zu verbrauchen? Oder merken wir bei unseren immer voller werdenden Leben gar nicht, dass uns in Wahrheit die Rohstoffe ausgehen? Wenn wir schon sehr bald kein Material mehr haben, um Technik zu bauen, die alle Verheißungen erfüllt - was machen wir dann? Ist die Antwort dann  reparieren, selber machen, vielleicht sogar kreativ werden?",
  "description": "Der Vortrag zeigt Daten und Grafiken zum aktuellen und prognostizierten Ressourcen- und Energieverbrauch digitaler Technologien. Der Mechanismus des Rebound-Effekts kann dabei helfen, die komplexen Folgen der aktuellen technischen Entwicklung z.B. in Bezug auf Wachstum zu verstehen.\r\nDegrowth ist eine politische Bewegung von Wissenschaftler*innen und Aktivist*innen, die gegen die Steigerungs- und Wachstumszwänge moderner Gesellschaften kämpfen. Mit welchen Argumenten begegnet die Degrowth Bewegung Wachstum aus einer ökologischen Perspektive? Und welche Anknüpfungspunkte für Ressourcenschonung gibt es in der Tech- und Maker-Bewegung?",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 8992,
      "public_name": "Anja"
    }
  ],
  "links": [],
  "attachments": []
}