{
  "id": 1680,
  "guid": "cd391adc-0399-4d4c-a816-f4f9b2ba3afc",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Helfe_foodsharing.de_mit_der_modernisierung_der_Webseite_noch_mehr_gegen_Lebensmittelverschwendung_unternehmen_zu_k%C3%B6nnen",
  "logo": null,
  "date": "2019-12-29T15:30:00+01:00",
  "start": "15:30",
  "duration": "0:30",
  "room": "Assembly:Foodsharing",
  "slug": "36c3-1680-session_helfe_foodsharing_de_mit_der_modernisierung_der_webseite_noch_mehr_gegen_lebensmittelverschwendung_unternehmen_zu_koennen",
  "title": "Helfe foodsharing.de mit der modernisierung der Webseite noch mehr gegen Lebensmittelverschwendung unternehmen zu können",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "meeting",
  "language": "de",
  "abstract": "",
  "description": "Wir von foodsharing sind eine Initiative, mit dem Ziel sich gegen Lebensmittelverschwendung einzusetzen: https://foodsharing.de/ueber-uns Unsere Homepage ist seit vielen Jahren das zentrale Werkzeug unserer Initiative. Die gesamte Vernetzung untereinander, die gemeinsame Arbeit an verschiedensten Themen und zu guter Letzt die Organisation all unserer Lebensmittelrettungen sind dank dieser Plattform möglich.\nWir von foodsharing sind eine Initiative, mit dem Ziel sich gegen Lebensmittelverschwendung einzusetzen: https://foodsharing.de/ueber-unsUnsere Homepage ist seit vielen Jahren das zentrale Werkzeug unserer Initiative. Die gesamte Vernetzung untereinander, die gemeinsame Arbeit an verschiedensten Themen und zu guter Letzt die Organisation all unserer Lebensmittelrettungen sind dank dieser Plattform möglich.Leider ist das IT-Team unserer ehrenamtlichen Bewegung sehr klein. Wenn ihr euch vorstellen könnt uns zu unterstützen, könnt ihr gerne vorbei kommen oder mit uns via DECT: 31831 zu einem späteren Zeitpunkt ein kurzes Treffen vereinbaren. Die Dauer des Treffens ist abhängig von eurem Interesse.Ziel ist es, die Plattform mit euren Skills auf festere Beine zu stellen und uns wenige Programmierer nach einer netten Einarbeitung zu entlasten!Gerne könnt ihr auch in Slack https://slackin.yunity.org im Channel #foodsharing-dev vorbei schauen.Technologien:    PHP (Symfony 4)    JavaScript (Webpack, Vue.js)    HTML (Twig)    CSS (Bootstrap)    MariaDB    RESTful APIs    GitLab    Docker Compose development environment    Codeception für Unit-, API-, and Acceptance testing (mit Selenium)    GitLab CI für Tests und automatisches deployment (mit php deployer)Hier ein paar Details zu den Aufgaben:https://devdocs.foodsharing.network/it-tasks.html",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Jo",
      "public_name": "Jo"
    }
  ],
  "links": [
    "https://beta.foodsharing.de/?page=content&sub=changelog"
  ]
}