{
  "id": 1539,
  "guid": "d0441891-f96d-4518-9e30-2bf25eca48e5",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Zum_Umgang_mit_autorit%C3%A4ren_Weltbildern,_Trollen_und_weiteren_schwierigen_Situationen_auf_Cryptopartys_und_anderen_Veranstaltungen",
  "logo": null,
  "date": "2019-12-28T11:30:00+01:00",
  "start": "11:30",
  "duration": "1:30",
  "room": "Assembly:Dezentrale",
  "slug": "36c3-1539-session_zum_umgang_mit_autoritaeren_weltbildern_trollen_und_weiteren_schwierigen_situationen_auf_cryptopartys_und_anderen_veranstaltungen",
  "title": "Zum Umgang mit autoritären Weltbildern, Trollen und weiteren schwierigen Situationen auf Cryptopartys und anderen Veranstaltungen",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "workshop",
  "language": "de",
  "abstract": "",
  "description": "Zum Umgang mit autoritären Weltbildern, Trollen und weiteren schwierigen Situationen auf Cryptopartys und anderen Veranstaltungen\nWer kennt sie bei Veranstaltungen nicht: Die Leute, die (absichtlich) stören und blockieren, die Leute, die einen mit Meinungen und Aussagen konfrontieren, die offensichtlich falsch oderverwerflich sind, denen dennoch nur sehr schwer zu begegnen ist. Und die Fragen, die man sich dann stellt: Hätte ich anders reagieren oder die Situation gar verhindern können? Dieser Mini Workshop soll euch ein paar Hilfestellungen, Tipps und Tricks geben, wie ihr euch auf eure zukünftigen Veranstaltungen vorbereiten und wie ihr euch rechtlich absichern könnt, solltet ihr bspw. jemandem die Teilnahme verweigern. Auch werden euch hilfreiche Tipps, Tricks undStrategien aus der Praxis verraten, mit denen ihr schwierigen Situationen begegnen könnt.Zunächst werde ich euch grundlegend erörtern, wie ihr autoritäres Gedankengut als solchesidentifizieren könnt und an Beispielen erläutern, was den Unterschied zwischen „Kritik“ und„Ideologie“ ausmacht. Anschließend werde ich euch allgemeine Tipps zur Argumentation und zumUmgang mit schwierigen Aussagen geben. Und zum Schluss noch die Möglichkeiten, die ihr(rechtlich) als Veranstalter habt und was ihr bei der Organisation einer Veranstaltung beachtenkönnt, um einen reibungslosen Ablauf auch bei Störungsfällen zu gewährleisten.Um alles praxisnah zu gestalten, werden wir an von euch konstruierten Fallbeispielen dastheoretisch gelernte anwenden und einem Praxistest unterziehen.[https://cloud.exigen.org/apps/sharingpath/moorhexa/36C6/handout_WS.pdf handout]",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Quarktasche",
      "public_name": "Quarktasche"
    }
  ],
  "links": []
}