{
  "id": 4127,
  "guid": "d069f5c4-ca9c-5945-9961-5077ce313663",
  "logo": "/media/36c3/images/YGQKPZ/Technological_narratives__web_oQlKitv.jpg",
  "date": "2019-12-29T13:30:00+01:00",
  "start": "13:30",
  "duration": "01:00",
  "room": "Art-and-Play Stage",
  "slug": "YGQKPZ",
  "url": "https://stage.artesmobiles.art/36c3/talk/YGQKPZ/",
  "title": "Technological narratives tl;dr solarpunk, cyberpunk and popculture",
  "subtitle": "",
  "track": "Lecture",
  "type": "Lecture",
  "language": "en",
  "abstract": "\\#technology in culture \\#talk and Q&A 60min",
  "description": "The western culture offers a very distilled narrative on what technology is and who builds, owns and profits from it. Most non-technical audiences are unaware of how subjective this perspective is - and how strongly it favours well-marketed multinational corporations over local solutions. How can telling different stories help us democratize technology?\r\n\r\nThe more the technology advances and becomes interconnected and complex, the less the non-technical public understands the changes, their repercussions and the policies that come along with them.\r\n\r\nMost people end up relying on stories present in the popular culture to understand the tech world around them: the well-polished product ads hidden in their favourite films, the lone genius-inventor legends, cyberpunk visions of a world with no privacy, but so much convenience!\r\n\r\nWith the constant changes around, it's hard not to be future shocked and give up on any attempts of understanding the technology yourself. The alternative narratives, especially within the hacker scene, are anything but accessible. They're shrouded with technical terms, full of cryptic references and lacking any clear introduction.\r\n\r\nVery few stories explain why values such as net neutrality are important without speaking code. People need stories with clear explanations appealing to their emotions and remaining in their memories much longer than a dry technical evaluation of pros and cons.\r\n\r\nI believe that with the introduction of Solarpunk, a new art genre widely discussed at the last re:publica, we can start talking about technology differently. We can forego shiny marketing of the Western companies and look at the technology created by the communities and grassroot organizations answering very local problems.\r\n\r\nWe can paint a vision of a world united in diversity of solutions, not owned by a single company.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 21,
      "code": "RAEGAZ",
      "public_name": "Pawel Ngei",
      "biography": "Pawel Ngei is a Polish hacker, free software / free culture activist and cybersecurity educator. For the last few years he has been working on a hackerspace graphic novel project Glider.Ink, making hacker perspectives more comprehensible to the general public.\r\n\r\nBlog: https://alxd.org/\r\nMastodon: https://writing.exchange/@alxd\r\nTwitter: @pawelNgei",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}