{
  "url": "https://frab.riat.at/en/36C3/public/schedule/events/85.html",
  "id": 4285,
  "guid": "d13561ff-3ce8-4dca-a0de-5b9c9353c365",
  "logo": "/system/events/logos/000/000/085/large/Screenshot_2019-12-24_at_12.48.57.jpg?1577188202",
  "date": "2019-12-30T16:15:00+01:00",
  "start": "16:15",
  "duration": "00:15",
  "room": "CDC - Stage",
  "slug": "36C3-85-hackatoshi_s_flying_circuit",
  "title": "Hackatoshi's Flying Circuit",
  "subtitle": "Invitation to a hack-a-ton ",
  "track": "Stage",
  "type": "lightning_talk",
  "language": "en",
  "abstract": "Paralelní Polis' mission is to bring alternatives and tools for preventing authoritarian tendencies in society. Hackatoshi’s Flying Circuit is an intervention of cypherpunks into both virtual and physical public space to concentrate inspiration and knowledge to address sick parts of the system and fix them with solutions resulting from privacy and decentralized principles.",
  "description": "Weekend-long hacking competition focused on privacy, individual freedom, decentralization and viable system exploits. Each track will have three winning teams awarded with prize money (cryptocurrency) & sw from the sponsors. Code submissions have to be open sourced.\r\n\r\nHackers Congress Paralelni Polis (HCPP) has been successful in gathering great minds and thinkers from the Cypherpunk and Cryptoanarchist space. Yet all of the topics and ideas discussed during the congress are only as good as they can be applied, performed or achieved. Hackatoshis's Flying Circuit should motivate hackers, makers and developers to take their tools and skills into practice. The key goal of the hackathon is to prototype new concepts that will help people to protect their digital identity or exploit existing systems that were built to constrain personal freedom.\r\n",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 94,
      "public_name": "JosefJ"
    }
  ],
  "links": [
    {
      "url": "https://flyingcircuit.com",
      "title": "Website"
    }
  ],
  "attachments": []
}