{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/11031.html",
  "id": 11031,
  "guid": "d1d0c29a-a8c3-4c96-b98e-3823b3d27902",
  "logo": "/system/events/logos/000/011/031/large/Logo.jpeg?1577136387",
  "date": "2019-12-27T22:10:00+01:00",
  "start": "22:10",
  "duration": "01:00",
  "room": "Clarke",
  "slug": "36c3-11031-the_kgb_hack_30_years_later",
  "title": "The KGB Hack: 30 Years Later",
  "subtitle": "Looking back at the perhaps most dramatic instance of hacking of the 1980s and the role it had in shaping the public image of the CCC.",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "en",
  "abstract": "This spring marked the 30th anniversary of the public uncovering of the so-called KGB Hack, bringing with it a number of new articles remembering the event and forging bridges to the present.",
  "description": "This spring marked the 30th anniversary of the public uncovering of the so-called KGB Hack, bringing with it a number of new articles remembering the event and forging bridges to the present. \r\nThe 36C3 seems an excellent opportunity to take a look back at the instance of hacking which, even more so than previous events like the BTX and NASA Hacks, brought the CCC into the focus of the (West-)German public – and, additionally, the Federal Office for the Protection of the Constitution (Verfassungsschutz) and the Federal Intelligence Service (Bundesnachrichtendienst). \r\n\r\nThis talk aims to focus on the uncovering of the KGB Hack, which began in 1986 when Clifford Stoll, a systems administrator at the University of California in Berkeley, noticed an intruder in his laboratory’s computer system – and, unlike other admins of the time, decided to do something about it. It took three more years of relentless investigation on Stoll’s part and laborious convincing of the authorities of the United States and the Federal Republic of Germany to trace back the intruder to a group of young men loosely connected to the CCC who worked with the KGB, selling information gained from breaking into US military computers to the Soviet Union.  \r\n\r\nIn March of 1989, the widely watched West-German television news program \"ARD Im Brennpunkt\" informed the public of the “biggest instance of espionage since the Guillaume affair”. It presented a new quality of high tech espionage, undertaken by “computer freaks”, somewhat shady-seeming young men connected to the Chaos Computer Club. \r\n\r\nThe reporting on the KGB Hack had a tremendously negative effect on the public image of hackers in general and the CCC in particular. Now the “computer freaks” were no longer seen as benevolent geeks who pointed out flaws in computer systems - they were criminals, working with the Russians, harming their own country. Sounds familiar? It’s an image which has been lingering until today. ",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 4221,
      "public_name": "Anja Drephal"
    }
  ],
  "links": [
    {
      "url": "https://www.youtube.com/watch?v=rS4VXwFHuUk",
      "title": "ARD im Brennpunkt, 02/03/89"
    },
    {
      "url": "https://www.youtube.com/watch?v=EcKxaq1FTac",
      "title": "\"The KGB, The Computer, and Me\" (1990 documentary on Clifford Stoll)"
    },
    {
      "url": "https://www.heise.de/newsticker/meldung/Vor-30-Jahren-der-KGB-Hack-fliegt-auf-4324110.html",
      "title": "\"Vor 30 Jahren – der KGB-Hack fliegt auf\" (German news article)"
    },
    {
      "url": "https://www.deutschlandfunkkultur.de/hacken-im-kalten-krieg-von-den-anfaengen-des-cyberwars.976.de.html?dram:article_id=440916",
      "title": "\"Von den Anfängen des Cyberwars\" (Deutschlandfunk Kultur)"
    },
    {
      "url": "https://www.inventati.org/amprodias/secreto/Karl%20Koch%20Doku.pdf",
      "title": "Obituary for Karl Koch (1990, German, contains contemporary news articles)"
    },
    {
      "url": "http://pdf.textfiles.com/academics/wilyhacker.pdf",
      "title": "\"Stalking the Wily Hacker\" (paper by Clifford Stoll)"
    },
    {
      "url": "https://www.youtube.com/watch?v=1h7rLHNXio8",
      "title": "\"Still Stalking the Wily Hacker\" (CTI Summit Keynote 2017)"
    },
    {
      "url": "https://cre.fm/cre100-das-internet-und-die-hacker",
      "title": "Chaosradio Express 100: Das Internet und die Hacker"
    }
  ],
  "attachments": [
    {
      "url": "/system/event_attachments/attachments/000/004/080/original/KGB_Hack_Slides_.pdf?1577553613",
      "title": "Slides"
    },
    {
      "url": "/system/event_attachments/attachments/000/004/081/original/Intro_Video.mp4?1577553741",
      "title": "Intro Video"
    }
  ]
}