{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10933.html",
  "id": 10933,
  "guid": "d2e0871c-129f-4058-a2c8-d17b236edac1",
  "logo": null,
  "date": "2019-12-27T20:50:00+01:00",
  "start": "20:50",
  "duration": "01:30",
  "room": "Ada",
  "slug": "36c3-10933-what_the_world_can_learn_from_hongkong",
  "title": "What the World can learn from Hongkong",
  "subtitle": "From Unanimity to Anonymity ",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "en",
  "abstract": "The people of Hong Kong have been using unique tactics, novel uses of technology, and a constantly adapting toolset in their fight to maintain their distinctiveness from China since early June. Numerous anonymous interviews with protesters from front liners to middle class supporters and left wing activists reveal a movement that has been unfairly simplified in international reporting. The groundbreaking reality is less visible because it must be - obfuscation and anonymity are key security measures in the face of jail sentences up to ten years. \r\n\r\nInstead of the big political picture, this talk uses interviews with a range of activists to help people understand the practicalities of situation on the ground and how it relates to Hongkong's political situation. It also provides detailed insights into protestors' organisation, tactics and technologies way beyond the current state of reporting. Ultimately, it is the story of how and why Hongkongers have been able to sustain their movement for months, even faced with an overwhelming enemy like China. ",
  "description": "This is the story of how and why Hongkongers have been able to sustain their movement so long, even faced with an overwhelming enemy like China. The protestors have developed a range of tactics that have helped them minimise capture and arrests and helped keep the pressure up for five months: They include enforcing and maintaining anonymity, both in person and online, rapid dissemination of information with the help of the rest of the population, a policy of radical unanimity to maintain unity in the face of an overwhelming enemy and Hongkongers’ famous “be water” techniques, through which many of them escaped arrest. ",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 7638,
      "public_name": "Katharin Tai"
    }
  ],
  "links": [],
  "attachments": []
}