{
  "id": 185,
  "guid": "d59d30e9-5db5-5941-9b23-92bd9cc9f316",
  "logo": "/media/36c3/images/CAVFZP/title.jpg",
  "date": "2019-12-30T12:00:00+01:00",
  "start": "12:00",
  "duration": "00:50",
  "room": "Chaos-West Bühne",
  "slug": "CAVFZP",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/CAVFZP/",
  "title": "Verbrannte Wörter – Sprache des Nationalsozialismus gestern und heute",
  "subtitle": "",
  "track": "Antifaschimus",
  "type": "Doppelter Slot",
  "language": "de",
  "abstract": null,
  "description": "Sprache schafft Bewusstsein. Als ein Gegenpol zum rechten \"Das wird man doch wohl noch sagen dürfen\"-Narrativ soll es in diesem Vortrag um verbrannte Wörter gehen. Wörter, die durch die Nationalsozialisten derart negativ besetzt wurden, dass ihr Gebrauch wohl überlegt sein will. Dieser Vortrag wird den historischen Kontext zu bestimmten Worten oder Wendungen erklären, sei es zum Beispiel die \"Aktion\", \"asozial\", die \"Überfremdung\" oder \"versifft\". \r\nDen Zuhörenden soll hier dabei geholfen werden, bestimmte nationalsozialistische Denkmuster durch ihre Sprache nicht aktiv zu reproduzieren und dabei helfen, eine geschichtsbewusstere Sprache zu etablieren. An einigen Stellen wird die Analyse von Worten oder Wendungen auch einen klaren Bezug zur Sprache der neuen Rechten in Deutschland enthalten.\r\nDer Vortrag ist als Präsentation konzipiert und wird schrittweise verschiedene Worte genauer analysieren, der Vortrag kann dann im Abschluss aber gerne durch einen etwas längeren Fragenteil abgerundet werden.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 129,
      "code": "SFLRAB",
      "public_name": "Bianca Kastl",
      "biography": "@bkastl\r\n\r\nWebdevelopment als Job, <br/>\r\nAccessibility und Datenschutz immer im Sinn,<br/>\r\nqueer als Mensch, <br/>\r\nund in letzter Zeit stets bemüht, verantwortungsvoll mit der deutschen Geschichte umzugehen, speziell der Zeit des Nationalsozialismus.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}