{
  "id": 889,
  "guid": "d67f0ad5-0393-50f6-bfe0-768d537f6d28",
  "logo": "",
  "date": "2019-12-29T18:00:00+01:00",
  "start": "18:00",
  "duration": "01:00",
  "room": "soupworx",
  "slug": "NUDKR3",
  "url": "https://talks.komona.org/36c3/talk/NUDKR3/",
  "title": "Germany stands with Hongkong What is necessary, what can be done to support Hongkong?",
  "subtitle": "",
  "track": null,
  "type": "Session",
  "language": "en",
  "abstract": "We are Hongkongers in Germany and involved in organizing support events. We want to gather to come up with new Ideas for 2020 and find more support in different cities.",
  "description": "What?\r\n\r\nWe would like to give you a quick overview of the current situation in Hongkong and about the work that the loose community of Hongkongers living in Germany have done so far. In the second part we will discuss on how to take part yourself.\r\n\r\nWho are we?\r\n\r\nInspired by the strategy of the protest in Hongkong there is no single structure, no leader for the movement in Germany. We stand for ourselves and so can you!\r\n\r\nTo whom this may concern?\r\n\r\nYou know about the situation in HK and need someone to talk about it, you read the news but don't know how to show your support? Or maybe you have great ideas but you don't know how to get people together? You don't know how to be part of a leaderless movement? Join us - be like water.\r\n\r\nThis session might be repeated later this day if it resonates with people, we encourage you all to go out and start your own things as well, take this as an initial spark.\r\n\r\nFor inquiries joylah@protonmail.com",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 84,
      "code": "P79W3E",
      "public_name": "Mx",
      "biography": "I am German, J0 is from Hongkong, we organize in Berlin and coordinate different cities. We have done more then 30 different events such as rallies, educational programs, art exhibitions, demonstrations and discussion panels.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}