{
  "id": 384,
  "guid": "d7287f76-3369-5017-89f7-35101cc72a18",
  "logo": "",
  "date": "2019-12-29T17:10:00+01:00",
  "start": "17:10",
  "duration": "00:25",
  "room": "OIO Stage",
  "slug": "UYCLAE",
  "url": "https://talks.oio.social/36c3-oio/talk/UYCLAE/",
  "title": "Hacking health",
  "subtitle": "",
  "track": null,
  "type": "Talk 20 minutes + 5 minutes Q&A",
  "language": "en",
  "abstract": "About hacking wheelchairs, building custom bicycles, adapters to use e-scooters as outboard motors: Empowering people with disablitities or healthcare needs through Open Hardware. Presentation on experiences and lessons learned in collecting and co-creating open personalized DIY healthcare solutions for replicability and adaptability in Makerspace worldwide.",
  "description": "Careables are open source solutions that aim to improve the quality of life for people with unmet particular needs or facing physical limitations. Careables are often co-designed, replicable, accessible, adjustable and shareable online using digital technologies.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 96,
      "code": "P3GLDY",
      "public_name": "Sandra GIG",
      "biography": "Sandra Mamitzsch baut seit 2018 das Berliner Büro des Global Innovation Gathering e.V., einem globalen Netzwerk von Makern und Innovatoren, auf und beschäftigt sich daher viel damit, wie dezentrale Zusammenarbeit und offene Organisationsformen funktionieren. Hauptsächlich ist sie im Verein für das Horizon2020-Förderprojekt Careables.org verantwortlich, dass innerhalb von Makerspace-Communities dabei hilft, mit offenen Technologien und Co-Design in Gesundheit und Pflege das Leben von Menschen zu verbessern. Von 2012-2017 war sie Programmdirektorin der re:publica und arbeitet dort weiterhin als freie Beraterin und Kuratorin. Nebenbei ist sie Mitglied bei European Digital Rights (EDRi) und beim Digitale Gesellschaft e.V.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}