{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10902.html",
  "id": 10902,
  "guid": "d8b2af5e-29da-4cc7-9d72-8329df1411b1",
  "logo": "/system/events/logos/000/010/902/large/Bildschirmfoto_2019-12-27_um_14.42.48.png?1577454190",
  "date": "2019-12-28T12:50:00+01:00",
  "start": "12:50",
  "duration": "01:00",
  "room": "Eliza",
  "slug": "36c3-10902-an_ultrashort_history_of_ultrafast_imaging",
  "title": "An ultrashort history of ultrafast imaging",
  "subtitle": "Featuring the shortest movies and the largest lasers",
  "track": "Science",
  "type": "lecture",
  "language": "en",
  "abstract": "Did you ever wonder what happens in the time period it takes light to cross the diameter of your hair? This is the femtosecond, a millionth of a billionth of a second. It is the time scale of electron and nuclear motion, and therefore the most fundamental processes in atomic and molecular physics, chemistry and biology start here. In order to take movies with femtosecond time resolution, we need ultrafast cameras – flashes of light that act faster than any camera shutter ever could. And imaging ultrafast motion is only the first step: We aim to control dynamics on the femtosecond time scale, ultimately driving chemical reactions with light.",
  "description": "Investigating ultrafast processes is challenging. There simply are no cameras that would be fast enough to image a molecule in motion, so we need to rely on indirect measurements, for example by ultrashort light pulses. Such ultrashort pulses have been developed for several years and are widely applied in the study of ultrafast processes by, e.g., spectroscopy and diffraction. Depending on the specific needs of the investigation, they can be generated either in the laboratory or at the most powerful light sources that exist today, the x-ray free-electron lasers.\r\n\r\nWith ultrafast movies, a second idea comes into play: once we understand the dynamics of matter on the femtosecond time scale, we can use this knowledge to control ultrafast motion with tailored light pulses. This is promising as a means to trigger reactions that are otherwise not accessible.\r\n\r\nIn my talk, I will give a brief introduction to the rapidly developing field of ultrafast science. I will summarize main findings, imaging techniques and the generation of ultrashort pulses, both at lab-based light sources and large free-electron laser facilities. Finally, I will give an outlook on controlling ultrafast dynamics with light pulses, with the future goal of hacking chemical reactions.\r\n",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9459,
      "public_name": "Caroline"
    }
  ],
  "links": [],
  "attachments": [
    {
      "url": "/system/event_attachments/attachments/000/004/051/original/UltrafastImaging_Caroline_36C3_v2.pdf?1577454234",
      "title": "Slides"
    }
  ]
}