{
  "id": 1693,
  "guid": "d8cbb296-8601-4f65-b758-3ad0fb55e9fa",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:%E2%80%9EK%C3%A4mpfe_um_und_Strategien_f%C3%BCr_gesellschaftlich_gerechte_Stadtentwicklung%E2%80%9C",
  "logo": null,
  "date": "2019-12-29T16:45:00+01:00",
  "start": "16:45",
  "duration": "1:30",
  "room": "Roter Salon",
  "slug": "36c3-1693-session_kaempfe_um_und_strategien_fuer_gesellschaftlich_gerechte_stadtentwicklung_",
  "title": "„Kämpfe um und Strategien für gesellschaftlich gerechte Stadtentwicklung“",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "talk",
  "language": "de",
  "abstract": "",
  "description": "\nLeon Rosa Reichle – wohnt zur Miete in Leipzig, promoviert am Centre for Urban Research on Austerity zu Mieter:innenbeziehungen im Leipziger Osten, organisiert sich in der Women’s Strike Assembly in Leicester und hin und wieder in feministischen und stadtpolitischen Initiativen in Leipzig„Kämpfe um und Strategien für gesellschaftlich gerechte Stadtentwicklung“ Auf dem Panel stellen 3 Leipziger:innen und 2 externen Gäste, verschiedene Positionen, Projekte, Alternativen und Ideen für sozialen, günstigen Wohnraum vor um dann miteinander und mit Euch in die Diskussion zu kommen. Dabei sitzen auf dem Panel: Lina Hurlin aus Leipzig, die für das Mietshäusersyndikat (werdende) Hausprojekte berät und uns von dem Projekt berichtet, was deutschlandweit unkommerzielle Wohnprojekte mit ermöglicht; Roman Grabolle, vom Haus und Wagenrat in Leipzig, der unterschiedliche alternative Wohnformen berät, vernetzt und organisiert; Henning Behrens, von der Solidarischen Wohnungsgenossenschaft (SoWo) Leipzig, die seit kurzem auf dem Leipziger Wohnungsmarkt mitmischt; Rita Kohel, aus dem Hamburger Gängeviertel, einem ganzes Quartier soziokulturellen Freiraums, die uns mit einer Perspektive aus einer Stadt mit noch deutlich angespannteren Wohnungsmarkt, aber auch von einem erfolgreichen Projekt in deren Mitte erzähltAndrej Holm, der in Berlin Stadtsoziologe ist und sich viel mit der strukturellen (u.a. bundespolitischen) Ebene der Wohnungspolitik beschäftigt.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Kreatur",
      "public_name": "Kreatur"
    }
  ],
  "links": []
}