{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10990.html",
  "id": 10990,
  "guid": "d9efd4c6-fbd8-45c3-b3cd-74dcd37dc03d",
  "logo": null,
  "date": "2019-12-29T11:30:00+01:00",
  "start": "11:30",
  "duration": "01:00",
  "room": "Dijkstra",
  "slug": "36c3-10990-connected_mobility_hacken_digital_bike_23",
  "title": "Connected Mobility hacken: digital.bike.23",
  "subtitle": " Von E-Bikes in der Connected Mobility zur Entstehung eines nachhaltigen Open-Source-E-Bike-Projekts",
  "track": "Resilience & Sustainability",
  "type": "lecture",
  "language": "de",
  "abstract": "Was haben E-Bikes mit Connected Mobility zu tun? Und ist so was wie LineageOS auch für Bike Computer möglich? Außerdem: wie lassen sich Cradle to Cradle Prinzipien auf E-Bikes anwenden? Der Vortrag gibt einen Einblick in die Rolle von E-Bikes in der Connected Mobility und umreißt ihren Stand der Technik. Zudem berichtet er von den Herausforderungen, ein nachhaltiges Open-Source-E-Bike zu entwickeln. Last but not least möchte er die Idee eines Open-E-Bike-Wiki vorstellen.",
  "description": "Dank Vernetzung auf allen Ebenen soll Mobilität sicherer, umweltfreundlicher, humancentered etc. werden. Fokus ist natürlich der Automotive Bereich. Da wird entwickelt, was das Zeug hält. Aber was ist mit E-Bikes? Sie haben durch ihre On-Board-Komponentenvernetzung perfekte Voraussetzungen für Connected und Smart. Deshalb jagt ein Hardware- und Sofwareupgrade inzwischen das nächste. Detaillierte Userdaten landen auf den Servern der Hersteller, dank proprietärer Software aller relevanten Komponenten. \r\nDer Vortrag beschäftigt sich im ersten Teil mit Connected Mobility und dem Stand der Technik bei E-Bikes - ein Fokus: Ihre Konnektivitätsoptionen und die Sensorvielfalt. Und es geht um Sinn und Unsinn des Technikeinsatzes. \r\nIm zweiten Teil geht es um das eigentliche e-Bike-Projekt. Der Vortrag erzählt von den Eigenheiten der Fahrzeugkonstruktion inspiriert von Cradle to Cradle und den Stand der Dinge der IT – Open Source, Open Embedded und Open IoT - aus der Sicht einer Produktdesignerin, die keine Hackerin ist und gern alles offen und transparent entwickeln würde und anwender*innenfreundliche Applikationen sucht. Und er erzählt von der Idee den IT-Dschungel zu lichten: der Erstellung eines Open-E-Bike-Wikis.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9471,
      "public_name": "Jo Tiffe"
    }
  ],
  "links": [
    {
      "url": "https://blog.formf.de/",
      "title": "digital.bike.23"
    }
  ],
  "attachments": []
}