{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/11114.html",
  "id": 11114,
  "guid": "da4cf268-c340-4f54-9498-19625cae3f03",
  "logo": null,
  "date": "2019-12-29T12:50:00+01:00",
  "start": "12:50",
  "duration": "01:00",
  "room": "Ada",
  "slug": "36c3-11114-die_affare_hannibal",
  "title": "Die Affäre Hannibal",
  "subtitle": "Eine erste Bilanz",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "de",
  "abstract": "Sie sollen den Staat schützen, sind aber selbst eine Gefahr: Soldaten und Polizisten, die sich in Chat-Gruppen organisieren und auf den „Tag X“ vorbereiten. Mit aufwändigen Recherchen hat ein Team der taz ein bundesweites konspiratives Netzwerk aus Preppern und Staatsbediensteten aufgedeckt. Kopf war „Hannibal“, Elitesoldat beim Kommando Spezialkräfte – und Auskunftsperson für den Militärischen Abschirmdienst. Hier geben die ReporterInnen Einblick in die Recherche und zeigen, was aus ihren Berichten folgte. Oder auch nicht.",
  "description": "Ein Elitesoldat des Kommando Spezialkräfte, der bundesweit Chatgruppen und einen Verein namens „Uniter e.V.“ gründet, in dem paramilitärische Trainings abgehalten werden.\r\n\r\nEin SEK-Polizist und Prepper, der knapp 60.000 Schuss Munition hortet, die aus Polizeibeständen entwendet wurden.\r\n\r\nMänner, die Feindeslisten anlegen und offenbar planen, an einem „Tag X“ politische Gegner umzubringen.\r\n\r\nDrei Schlaglichter auf die mehr als zwei Jahre andauernde „Hannibal“-Recherche der taz. Sie führte in viele Felder: Hinein in Verfassungsschutzbehörden und Bundeswehr; hinaus aufs Land zwischen Mecklenburg-Vorpommern und Baden-Württemberg; auf Facebook-Profile philippinischer Politiker und in Telegram-Chats deutscher Verschwörer.\r\n\r\nAuf die Recherchen folgte Bestürzung, aber – zunächst – auch Belächeln. Sind diese Leute wirklich gefährlich oder doch bloß harmlose Spinner? \r\n\r\nIn diesem Talk geben zwei der ReporterInnen des taz-Teams einen Einblick in ihre Arbeit, berichten von Begegnungen mit Preppern mit Umsturzfantasien und Verfassungsschutzmitarbeitern, die im schwarzen Porsche Cayenne vorfahren. Sie berichten von Erfolgen bei der Online-Recherche und warum Hinfahren und an Türen klingeln am Ende doch unerlässlich ist.\r\n\r\nDie Journalisten schildern, was nach ihren Veröffentlichungen passiert ist: Im politischen Raum, in der Justiz – und welche Fragen noch offen sind. Warum etwa wird nicht wegen Bildung einer terroristischen Vereinigung ermittelt?\r\n\r\nVortrag von:\r\nSebastian Erb, Redakteur der taz am Wochenende \r\nDaniel Schulz, Leiter des Ressorts Reportage & Recherche der taz",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9645,
      "public_name": "Sebastian Erb"
    }
  ],
  "links": [
    {
      "url": "www.taz.de/hannibal",
      "title": "Alle taz-Texte der \"Hannibal\"-Recherche"
    }
  ],
  "attachments": []
}