{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10661.html",
  "id": 10661,
  "guid": "da8f10ec-5c27-4b39-9209-191b7d865eca",
  "logo": null,
  "date": "2019-12-28T16:10:00+01:00",
  "start": "16:10",
  "duration": "00:40",
  "room": "Borg",
  "slug": "36c3-10661-psychedelic_medicine_-_hacking_psychiatry",
  "title": "Psychedelic Medicine - Hacking Psychiatry?! ",
  "subtitle": "Psychedelic Therapy as a fundamentally new approach to mental health issues",
  "track": "Science",
  "type": "lecture",
  "language": "en",
  "abstract": "Psychedelic research constitutes a challenge to the current paradigm of  mental healthcare. But what makes it so different? And will it be able to meet the high expectations it is facing? This talk will provide a concise answer.",
  "description": "Psychedelic Therapy is evolving to be a game changer in mental healthcare. Where classical antidepressants and therapies e.g. for Posttraumatic Stress Disorder often have failed to provide relief, substance assisted psychotherapies with Psilocybin, LSD and MDMA show promising results in the ongoing clinical trials worldwide.\r\n\r\nA challenge to the current paradigm: Unlike the conventional approach of medicating patients with antidepressants and other psychotropic drugs on a daily basis for months and years at a time, Psychedelic Therapy offers single applications of psychedelics or emotionally opening substances such as Psilocybin, LSD and MDMA within the course of a limited number of therapeutic sessions. The clinical trials conducted in this kind of setting are currently designed around depression, substance abuse, anxiety and depression due to life threatening illnesses, PTSD, anorexia and social anxiety in Autism.\r\nThough the results look promising, it is important not to take these therapies for a “magic bullet cure” for all and very patient will mental issues. This talk will outline the principles of psychedelic therapy and research and provide a concise overview of what psychedelic therapy can and cannot offer in the future.\r\n",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9462,
      "public_name": "Andrea Jungaberle"
    }
  ],
  "links": [],
  "attachments": []
}