{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/11090.html",
  "id": 11090,
  "guid": "dc142f44-4b82-42da-b2a4-bb7d6775fda6",
  "logo": "/system/events/logos/000/011/090/large/Still_18.jpg?1572123226",
  "date": "2019-12-28T20:50:00+01:00",
  "start": "20:50",
  "duration": "01:00",
  "room": "Clarke",
  "slug": "36c3-11090-the_case_against_wikileaks_a_direct_threat_to_our_community",
  "title": "The Case Against WikiLeaks: a direct threat to our community ",
  "subtitle": "How to understand this historic challenge and what we can do to defend ourselves",
  "track": "Ethics, Society & Politics",
  "type": "lecture",
  "language": "en",
  "abstract": "The unprecedented charges against Julian Assange and WikiLeaks constitute the most significant threat to the First Amendment in the 21st century and a clear and present danger to investigative journalism worldwide. But they also pose significant dangers to the technical community. This panel will explain the legal and political issues we all need to understand in order to respond to this historic challenge. ",
  "description": "<p>We've been warning you about it for years, and now it's here. The talk will dissect the legal and political aspects of the US case against Wikileaks from an international perspective. It will describe the threats this prosecution poses to different groups and the key issues the case will raise. Most importantly, we will explain how we are still in time to act and change the course of history. </p>\r\n\r\n<p>The unprecedented charges against Julian Assange and WikiLeaks constitute the most significant threat to the First Amendment in the 21st century and a clear and present danger to investigative journalism worldwide. But they also pose significant dangers to the technical community, the trans community, to human rights defenders and anti-corruption campaigners everywhere.</p> \r\n\r\n<p>If we don't take action now, the ramifications of this case will be global, tremendously damaging and potentially irreversible in times when the need to hold the powerful to account has never been more obvious. This is a historic moment and we need to rise to its challenge.</p> \r\n\r\n<p>This talk will explain the legal and political aspects of the case against WikiLeaks, the reasons why Chelsea Manning and Jeremy Hammond have been imprisoned again, the governmental interests for and against prosecution, the dynamics of UK/US extradition and what it means to prosecute Assange as Trump runs for re-election.</p> \r\n\r\n<p>This is a case with destructive potential like no other, with profound implications for the future of dissent, transparency, accountability and our ability to do the work we care about.</p> \r\n\r\n<p>The situation is frightening but it isn't hopeless: we will conclude with a guide to an effective strategy against the lawfare the journalist and technical communities are now facing courtesy of Donald Trump's DOJ. </p>\r\n",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 3560,
      "public_name": "renataavila"
    },
    {
      "id": 9752,
      "public_name": "naomi@auerfeld.com"
    },
    {
      "id": 9873,
      "public_name": "Angela Richter"
    }
  ],
  "links": [
    {
      "url": "https://defend.wikileaks.org/",
      "title": "Campaign to Defend Wikileaks "
    },
    {
      "url": "https://www.couragefound.org/",
      "title": "Courage Foundation"
    },
    {
      "url": "https://www.amnesty.org.uk/press-releases/uk-extradition-julian-assange-usa-must-not-go-ahead",
      "title": "Statement from Amnesty International "
    }
  ],
  "attachments": [
    {
      "url": "/attachments/original/missing.png",
      "title": "Briefing about the case"
    },
    {
      "url": "/system/event_attachments/attachments/000/003/985/original/The-Assange-Precedent.-March-2019.pdf?1572123226",
      "title": "The Assange precedent "
    }
  ]
}