{
  "id": 240,
  "guid": "dd49cd68-a630-5565-8e82-e397d89f900d",
  "logo": "",
  "date": "2019-12-28T18:00:00+01:00",
  "start": "18:00",
  "duration": "00:20",
  "room": "Chaos-West Bühne",
  "slug": "YDMJLP",
  "url": "https://fahrplan.chaos-west.de/36c3/talk/YDMJLP/",
  "title": "DevelopersForFuture",
  "subtitle": "",
  "track": "Klimakatastrophe",
  "type": "Einfacher Slot",
  "language": "de",
  "abstract": null,
  "description": "### Code für den Aktivismus\r\n\r\nAls wir im Frühjahr diese Gruppe gegründet haben, konnten wir nicht ahnen, dass wir derart viele Anfragen zu bearbeiten geben könnte. Von Wissenschaftlern bis Förstern – jeder mit anderen Bedürfnissen. Dazu stehen wir in engem Kontakt mit den Entwicklern der diversen Friday For Future Projekte, sodass wir hier inzwischen auch als fester Bestandteil der Bewegung gelten\r\n\r\nDurch die Fülle an Organisationen und kleinen Projekten, können fast auf ein Jahr Coding zurückblicken. An diesen Beispielen möchte ich euch teilhaben lassen und so auch das Projekt Developers For Future vorstellen und es vor allem in den Kontext der Klima-Protest-Bewegung einordnen. Es geht los bei einem kleinen Einschreibeformular und endet bei ganzen Applikationen, die dabei helfen sollen die Anliegen der Bewegung zu transportiern.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 183,
      "code": "XUUZAD",
      "public_name": "Maximilian Berghoff",
      "biography": "Max ist bereits seit den 90ern als Softwareentwickler aktiv. Zunächst setzte er sich noch mit kleineren Webprojekten auf Grundlage von PHP und MySQL auseinander. Nachdem ihn Studium und Job in einer Agentur zunächst ein wenig vom Web abbrachten, gelang ihm als Quereinsteiger dann auch professionell der Einstieg ins Development. Über das SymfonyCMF fand Max Geschmack an der Open-Source-Entwicklung und ist dort inzwischen im Core Team aktiv.\r\n\r\n\r\n\r\nMit seinem Interesse an der Softwareentwicklung ist er letztlich auf Mayflower aufmerksam geworden und dort als versierter Trainer in Workshops und als Speaker auf Konferenzen und Meetups gefragt.\r\n\r\n\r\n\r\nIm Rahmen der Mayflower Slacktime setzt Max sich dabei auch gerne mal mit Projekten anderer Sprachen wie Go auseinander, oder experimentiert mit Konzepten wie Artificial Intelligence (AI) oder Natural Language Understanding (NLU).\r\n\r\nSeit März 2019 hat mich nun das Klima-Fieber erwischt. Mit der Gründung der DevelopersForFuture und der Zusammenarbeite mit den restlichen ForFuture-Gruppen versuche ich nicht nur die Bewegung zu unterstützen, vielemehr gilt es die Verantwortung einer ganzen Branche herauszustellen.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}