{
  "id": 984,
  "guid": "dd6a2fc4-e175-5f73-8387-8ebc3f85e603",
  "logo": "/media/36c3/images/UXVNEN/zk018.jpg",
  "date": "2019-12-28T18:00:00+01:00",
  "start": "18:00",
  "duration": "01:00",
  "room": "DLF- und Podcast-Bühne",
  "slug": "UXVNEN",
  "url": "https://fahrplan.das-sendezentrum.de/36c3/talk/UXVNEN/",
  "title": "ZellKultur",
  "subtitle": "",
  "track": "DLF- und Podcast-Bühne",
  "type": "Normale Länge",
  "language": "de",
  "abstract": "Claudia und Anna sprechen über Biologie! Stellt uns eure Fragen zu allem was ihr aus dem Bereich der Biologie schon immer wissen wolltet. CRISPR? Proteinbiosynthese? Chromosomen? Krebs? Ihr würdet gerne wissen was sich wirklich hinter diesen Begriffen verbirgt? Dann kommt und fragt uns! Zur Belohnung für's fragen gibt es auch wieder Kekse.",
  "description": "ZellKultur ist ein Wissenschaftspodcast im Bereich Biologie. Zwischen aktuellen Themen und Grundlagen versuchen wir, die Welt der Zellen, Bakterien und Wirkstoffe euch etwas näher zu bringen. Und zwar verständlich für alle!\r\nWir freuen uns vor allem über konkrete Fragen aus dem Publikum.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 83,
      "code": "F93S98",
      "public_name": "Anna Müllner",
      "biography": "Ich habe Biologie studiert und an der Universität Heidelberg promoviert. Meine Doktorarbeit habe ich zum Thema “DNA Schaden und Zellalterung” am Deutschen Krebsforschungszentrum angefertigt. Schon länger widme ich mich der Wissenschaftskommunikation. Ich habe bereits Vorträge an Schulen gehalten sowie an Science Slams teilgenommen. Seit sechs Jahren blogge ich auf scilogs.de von Spektrum der Wissenschaft.  Gemeinsam mit Claudia veröffentliche ich den Podcast ZellKultur, rund um die Biologie.\r\nMein Wunsch ist es, Grundlagenwissen zu vermitteln, damit man nicht auf Scharlatanerie und Humbug hereinfällt.\r\nWeiteres unter zellmedien.de",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}