{
  "id": 1228,
  "guid": "defe2738-b07a-4c89-b623-949482a8a4fd",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Multigeiger_bauen",
  "logo": null,
  "date": "2019-12-29T14:00:00+01:00",
  "start": "14:00",
  "duration": "3:00",
  "room": "Assembly:Hardware Hacking Area",
  "slug": "36c3-1228-session_multigeiger_bauen",
  "title": "Multigeiger bauen",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "workshop",
  "language": "de",
  "abstract": "",
  "description": "Geigerzähler– Hardwarebasteln mit LoRaWAN & WiFi  Wir sind die Ecocurious-Initiative und haben einen LoRaWAN- und WiFi-fähigen Geigerzähler entwickelt. Diesen Low-Cost-Multigeiger mit gutem Zählrohr kannst Du bei uns löten, im Tausch gegen Materialkosten von 75 Euro mitnehmen und damit Teil unseres wunderbaren Messnetzes werden, das wir gerade aufbauen. Die Bauteile und unsere selbstentwickelte Platine bringen wir für Dich mit. Du findest uns in der Hardware Hacking Area, im Hamsterspace.  Wir bieten 2 Workshop-Zeiten an: Am 29.12. von 14-17 Uhr und am 30.12. von 10-13 Uhr.  Wir freuen uns auf Dich, mach mit!\nGeigerzähler– Hardwarebasteln mit LoRaWAN & WiFiWir sind die Ecocurious-Initiative und haben einen LoRaWAN- und WiFi-fähigen Geigerzähler entwickelt. Diesen Low-Cost-Multigeiger mit gutem Zählrohr kannst Du bei uns löten, im Tausch gegen Materialkosten von 75 Euro mitnehmen und damit Teil unseres wunderbaren Messnetzes werden, das wir gerade aufbauen. Das Gerät ist die ultimative Beta-Version, Änderungswünsche und Ideen sind sehr willkommen.Wir bringen die Bauteile und unsere selbstentwickelte Platine für Dich mit. Du findest uns in der Hardware Hacking Area, im Hamsterspace.Wir bieten 2 Workshop-Zeiten an: Am 29.12. von 14-17 Uhr und am 30.12. von 10-13 Uhr.Wir freuen uns auf Dich, mach mit!",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Ecocurious",
      "public_name": "Ecocurious"
    }
  ],
  "links": [
    "https://ecocurious.de/projekte/multigeiger/"
  ]
}