{
  "id": 4141,
  "guid": "df5973ed-eb5e-5def-8658-2320262658d5",
  "logo": "",
  "date": "2019-12-29T16:00:00+01:00",
  "start": "16:00",
  "duration": "01:30",
  "room": "Art-and-Play Stage",
  "slug": "FFK37X",
  "url": "https://stage.artesmobiles.art/36c3/talk/FFK37X/",
  "title": "FENCE SHARPENING – Art in the age of digital disruption",
  "subtitle": "",
  "track": "Screening",
  "type": "Screening",
  "language": "en",
  "abstract": "This program presents a series of artistic strategies on redundant technologies, repressive structures and populist movements supported by Werkleitz Centre for Media Art in Halle residencies or professional media master class programs.",
  "description": "The program will be presented by Werkleitz founder Peter Zorn & Marcie Jost and the artists Juliane Jaschnow, Stefanie Schröder and Mathias Jud.\r\n\r\n**TELH78**\r\nSuper 8 on Digital\r\n6 min\r\nD 2011\r\nAlina Cyranek & Eike Goretzka\r\n\r\nIt has almost vanished from our urban horizons, that rotting dinosaur, the German post office’s yellow telephone booth. There were times when such a booth was a vital place. We searched for – and found – the last of this dying breed, and had them divulge stories now threatened by oblivion.\r\n\r\nhttp://pmmc.werkleitz.de/telh78\r\n\r\n**Artificial Intelligence _ Interaractive Film Kiosk**\r\nDoku\r\n4:30 min\r\nDouglas Fishbone\r\nWerkleitz/Filmische Initiative Leipzig (FILZ)\r\n\r\nArtificial Intelligence (2018) is a machine that dispenses wisdom in return for a 10-cent investment. A short meditation on time, impermanence and loss, it was originally installed in the Marktplatz in Halle, Germany, the city’s main square, where it was commissioned by the werkleitz Festival with funding from the European Union. Spanning from the theft of the Mona Lisa in 1911 to the shortages of sausages in the German Democratic Republic to the Mahabharata, it offers an unusual perspective on the rise and fall of human civilization through the prism of the chaos of 20th-century Europe.\r\n\r\nhttp://emare.eu/artist/doug-fishbone\r\n\r\n**Fence Sharpening _ Performance Intervention**\r\nDocumentation\r\n4 min\r\nAU/D 2010\r\nLeopold Kessler\r\n\r\nSharpened edges of iron fences poke the sky in the city of Halle. They reflect the summer sun like shimmering, but dangerous, treasures. They make the fictitious intruder shake with fear, and the innocent passersby’s heart freeze, as they imagine those passive weapons harming the human body.\r\n\r\nhttp://werkleitz.de/en/fence-sharpening\r\n\r\n**Beyond the forest**\r\nFilm\r\n9 min\r\nD 2014\r\nFrancesca Bertin & Leonhard Kaufmann\r\n\r\nBeyond the forest is the city of tomorrow, before the forest the villages of yesterday.\r\n\r\nhttp://pmmc.werkleitz.de/hinter-dem-wald\r\n\r\n**The Effect of Cannonery on Thunderclouds**\r\nFilm\r\n30 min\r\nD 2017\r\nJuliane Jaschnow & Stefanie Schröder\r\n\r\n2016 saw the highest number of potential tornadoes ever since the beginning of weather recordkeeping in Germany. At the same time, there is a deluge of weather tropes on the internet, on television and in the news. Shit storms, data flood, refugee waves. Language, metaphors and images are instruments of control. They are used to dispel – and instill – fear.  How does the image function as a document, as fiction, trophy, counterattack? How close are manipulation and prediction? And is the weather still real?\r\n\r\nhttp://pmmc.werkleitz.de/die-wirkung-des-geschuetzes-auf-gewitterwolken",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 31,
      "code": "STGE8X",
      "public_name": "Werkleitz Centre for Media Art",
      "biography": null,
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}