{
  "id": 1163,
  "guid": "e16f568c-2006-47b9-b83e-ece52eb74b54",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Wondrous_mathematics:_A_gentle_introduction_to_P_vs._NP,_the_biggest_open_question_in_computer_science",
  "logo": null,
  "date": "2019-12-27T21:50:00+01:00",
  "start": "21:50",
  "duration": "1:00",
  "room": "Lecture room M1",
  "slug": "36c3-1163-session_wondrous_mathematics_a_gentle_introduction_to_p_vs_np_the_biggest_open_question_in_computer_science",
  "title": "Wondrous mathematics: A gentle introduction to P vs. NP, the biggest open question in computer science",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "talk",
  "language": "en",
  "abstract": "",
  "description": "Very roughly, P is the class of efficiently solvable problems and NP is the class of non-efficiently solvable problems. A basic fact of life is P ≠ NP. However, for the last fifty years, this observation has stubbornly resisted every attempt of a proof. The talk will carefully explain ... (see long description)\nThe talk will carefully explain:* what the precise statement of the conjecture P ≠ NP is* how the world would look like if P = NP* whether it might be that it's provable that the conjecture is unprovable (that the conjecture exceeds the boundaries of logic)* what's known about hypothetical proofs of P ≠ NPThis talk requires no mathematical prerequisites. Indeed, people who took classes on computability theory in university will be bored to hell and should only attend if they plan to support the session by offering interesting remarks. :-) To enjoy and follow the talk, you should know that we use algorithms to solve computational problems and that some are more efficient than others. You'll be extra prepared if at some point in your life you've implemented some algorithms. That said, you will only enjoy the talk if you enjoy mathematical thinking and a certain amount of mathematical precision. This is not a light-and-fun talk, to the small extent that it's fun it's only thanks to the interesting theoretical relationships discussed in the talk.'''[https://rawgit.com/iblech/mathezirkel-kurs/master/mathecamp-2019/p-vs-np/slides-36c3.pdf Slides]''''''[https://rawgit.com/iblech/mathezirkel-kurs/master/mathecamp-2019/p-vs-np/ablauf.txt Some details]''' (in German)'''[https://www.scottaaronson.com/papers/pnp.pdf Survey paper by Scott Aaronson]''' (very much recommended)'''Thanks''' are due to Anna Rubeck who prepared an earlier version of this talk and who inspired me to give this talk.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Iblech",
      "public_name": "Iblech"
    }
  ],
  "links": []
}