{
  "id": 1526,
  "guid": "e302015a-61fd-4f1a-bccb-79ca8c5e184b",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:SYSTEM_ERROR_-_Dokumentarfilm_2018",
  "logo": null,
  "date": "2019-12-27T16:30:00+01:00",
  "start": "16:30",
  "duration": "1:30",
  "room": "Roter Salon",
  "slug": "36c3-1526-session_system_error_dokumentarfilm_2018",
  "title": "SYSTEM ERROR - Dokumentarfilm 2018",
  "subtitle": "Wie endet der Kapitalismus?",
  "track": "self organized sessions",
  "type": "other",
  "language": "de",
  "abstract": "",
  "description": "Ewiges Wachstum - Wie endet der Kapitalismus?\nSYSTEM ERRORWie endet der Kapitalismus?Es ist verrückt: Wir sehen die schwindenden Regenwälder und Gletscher, wissen um die Endlichkeit der Natur und sind dennoch wie besessen vom Wirtschaftswachstum. Warum treiben wir das Wachstum immer weiter, obwohl wir wissen, dass man auf unserem endlichen Planeten nicht unendlich wachsen kann? SYSTEM ERROR sucht Antworten auf diesen großen Widerspruch unserer Zeit und macht begreifbar, warum trotzdem alles so weiter geht wie gehabt. Der Film zeigt die Welt aus der Perspektive von Menschen, die von den Möglichkeiten des Kapitalismus fasziniert sind. Ob europäische Finanzstrategen, amerikanische Hedgefondsmanager oder brasilianische Fleischproduzenten: Eine Welt ohne eine expandierende Wirtschaft können, dürfen oder wollen sie sich gar nicht erst vorstellen.SYSTEM ERROR beleuchtet bisher häufig verborgen gebliebene Zusammenhänge und legt die selbstzerstörerischen Zwänge des Systems offen - einem System, an dem wir alle teilhaben, als Beschäftigte, Anleger oder Konsumenten. Denn der Kapitalismus durchdringt unaufhörlich immer mehr Lebensbereiche, verschlingt die Natur und gräbt sich am Ende selbst das Wasser ab – so wie es Karl Marx schon vor 150 Jahren prophezeit hat. Die Frage ist: Sind wir tatsächlich bereit für den Kapitalismus alles zu opfern?",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Kreatur",
      "public_name": "Kreatur"
    }
  ],
  "links": []
}