{
  "id": 1343,
  "guid": "e4fcda8b-2708-46ca-a831-99381bf843eb",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Was_kann_ich_tun,_um_umweltbewusster_und_klimaneutraler_zu_leben%3F",
  "logo": null,
  "date": "2019-12-28T15:30:00+01:00",
  "start": "15:30",
  "duration": "1:00",
  "room": "Assembly:C-base / CCC-B / xHain",
  "slug": "36c3-1343-session_was_kann_ich_tun_um_umweltbewusster_und_klimaneutraler_zu_leben_",
  "title": "Was kann ich tun, um umweltbewusster und klimaneutraler zu leben?",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "talk",
  "language": "de",
  "abstract": "",
  "description": "Wie kann ich meine Welt verbessern?! – Niederschwellige Handlungsanweisungen\nEs gibt viele kompetente Äußerungen zum Thema \"Handeln gegen den Klimawandel\", doch mir ist aufgefallen, dass es kaum kompakt zusammengefasste, einfach umzusetzende Beispiele aus der Praxis gibt. Internetportale bieten selbstverständlich viele Informationen, die mit Zeitaufwand und Ausprobieren sehr hilfreich sein können. Doch mensch kann sich leicht verzetteln oder auf Grund der Fülle und dem vorausgesetzten Wissen, schnell die Motivation verlieren. Deswegen möchte ich Möglichkeiten aufzeigen, die einfach umzusetzen sind.Diese Praxisbeispiele sind aus fast allen Lebensbereichen, so nimmt z.B. unsere Nutzung von elektronischen Geräten großen Raum ein. Hier fällt uns der Verzicht und die Veränderung des Verhaltens schwer – verständlicherweise. Unser Konsumverhalten ist nicht nur an dieser Stelle der Knackpunkt. Ernährung, Reisen, Körperpflege etc. können ressourcenschonender gelebt werden. Das lässt sich allerdings nicht ohne einen teilweisen Verzicht auf unsere bisherige Bequemlichkeit umsetzen. Dabei stellt sich die Frage nach der Reflexion unserer bisherigen Gewohnheiten, des Willens zur Veränderung und eines wirklichen Anfangs. Hier möchte ich mit der Vorstellung niederschwelliger Beispiele aus der Praxis Einstiege bieten.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Atoll",
      "public_name": "Atoll"
    }
  ],
  "links": []
}