{
  "id": 830,
  "guid": "e60c710a-09f8-54f0-af5a-b884b289d748",
  "logo": "",
  "date": "2019-12-29T19:00:00+00:00",
  "start": "19:00",
  "duration": "00:45",
  "room": "nokingdome",
  "slug": "9PCNBC",
  "url": "https://talks.komona.org/36c3/talk/9PCNBC/",
  "title": "Would you live in a floating city in the sky? Künstlerische Forschung als kritische und emanzipatorische Praxis für Hexen und Pirat*innen",
  "subtitle": "",
  "track": null,
  "type": "Talk",
  "language": "de",
  "abstract": "Der Talk soll dazu beitragen, die eigene forschende oder künstlerische Praxis auch als künstlerische Forschung zu konzipieren, um sich weitere Räume und Ressourcen dafür erschließen zu können. Durch die vielen Beispiele zeitgenössischer technoaffiner Kunst und den einführenden Charakter kann man auch prima zum Bilder gucken kommen.",
  "description": "Artistic Research ist ein neueres Schlagwort auf dem Kunstfeld, unter dem dissidente Wissensproduktion mit künstlerischen Methoden gefasst und inzwischen institutionalisiert wird. In diesem Vortrag gebe ich eine Einführung, was künstlerische Forschung von Wissenschaft und Kunstproduktion unterscheidet und auch, wo sich beides verbindet. Einfach gesprochen eröffnet sich hier ein Forschungsfeld, in dem, anders als im reglementierten universitären Kontext, andere Personengruppen in anderen Räumen mit interdisziplinären und künstlerischen Methoden Wissen produzieren und in anderen Formaten als einem sprachlichen Text vermitteln. Akteure sind hier nicht nur Künstler* innen, sondern um in einer emanzipatorischen Praxis dem männlichen Genie der Kunsttradition etwas entgegen zu setzen, auch Hexen oder Pirat*innen. Wir schauen uns viele Beispiele aus der Archäologie, dem Transhumanismus sowie aus queerfeministischen und postkolonialen Kontexten genauer an.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 34,
      "code": "L9Y3RW",
      "public_name": "Sophie Elle",
      "biography": "artist writer piratessa\r\nmatrix: so-elle@matrix.org",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}