{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Lineup/events/11287.html",
  "id": 11287,
  "guid": "e6dddd44-9727-4b1d-9709-2f4bc287aef8",
  "logo": "/system/events/logos/000/011/287/large/danaruh.jpg?1577207888",
  "date": "2019-12-31T00:00:00+01:00",
  "start": "00:00",
  "duration": "02:00",
  "room": "Discotheque Nouveauancien",
  "slug": "36c3-abfahrplan-11287-dana_ruh",
  "title": "Dana Ruh",
  "subtitle": "Techno / House",
  "track": "Music",
  "type": "djset",
  "language": "en",
  "abstract": "",
  "description": "Born and raised in Gera in Germany, Dana Ruh soon found her way to the capital city of Berlin. Since then, she ha been on a constantly evolving musical journey. In the early years, her sound was rooted in techno and landed most often on the label Brouqade Records, which she established in 2007. The label is still running too, and celebrated its 10th Year Birthday Celebration entitled 'Past/Present/Future' that emphatically encapsulated all that's great about the label.\r\nAside from Brouqade, Dana's music has also featured on the liked of Autoreply, Work Them Records, Howl and Underground Quality. It was Jus Ed's label where she released her stunning debut album. 'Naturally' in 2014, an LP that introduced Dana to a whole new audience and showcased her pure house sound with some distinctions. In 2017 she started her new Label 'Cave Recordings' that showcased her wide musical range mainly rooted in House with old school flavor.\r\nWhen she isn't busy in the studio crafting textured tracks, Dana is a fine DJ who holds down resident duties at top Berlin space, Club der Visionaere. It is there that she lays down seductive tracks from the worlds of house and techno as well as gems in between. Aside from her beloved CDV, Dana has played in some of the globe's foremost house and techno nightclubs, often alongside some of the scene's prime movers and shakers.\r\nDespite working in such an over saturated and competitive field, Dana Ruh manages to speak louder and more coherently that most, and for that reason she deserves all the love she gets.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [],
  "links": [
    {
      "url": "https://soundcloud.com/danaruh",
      "title": "Dana Ruh on Soundcloud"
    },
    {
      "url": "https://danaruh.com/",
      "title": "Dana Ruh's Website"
    }
  ],
  "attachments": []
}