{
  "id": 1016,
  "guid": "e82ff951-9420-54a2-afd1-3596d9cfed4e",
  "logo": "/media/36c3/images/P3M9YV/fish_Kopie.jpg",
  "date": "2019-12-28T00:40:00+01:00",
  "start": "00:40",
  "duration": "01:00",
  "room": "Bühne",
  "slug": "P3M9YV",
  "url": "https://fahrplan.das-sendezentrum.de/36c3/talk/P3M9YV/",
  "title": "Die #36c3 Wisskomm-Gala",
  "subtitle": "",
  "track": "Bühne",
  "type": "Normale Länge",
  "language": "de",
  "abstract": "Das Wissenschaftskommunikations-Assembly trifft sich auf dem 36c3 um über Wissenschaftskommunikation zu sprechen. Und über andere Themen die ihnen am Herzen liegen.",
  "description": "Wir kommunizieren über den einen oder anderen Weg Wissenschaft. Physik, Chemie, Biologie, Pharmazie... Doch schauen wir uns das viele Unwissen in der Welt an, dann scheint das noch nicht auszureichen. Wie können wir Wissenschaft noch besser an die Frau oder den Mann bringen? Wie können wir überhaupt das Interesse dafür wecken?\r\nIn der Politik gibt es zwar bereits Pläne, die Kommunikation zu verbessern, das Grundsatzpapier des Bundesministeriums für Bildung und Forschung (BMBF) über Wissenschaftskommunikation ist nur ein Beispiel dafür. Nur wirft dies auch die Befürchtung auf, dass Kommunikation dann von eh schon überlasteten, drittmittelfinanziert-prekären Doktorandinnen aufgeladen wird. Oder, dass sie als Freizeitvergnügung betrachtet wird. Oder, dass die hohen Anforderungen für gute Kommunikation unterschätzt werden. Oder, dass Wissenschaftskommunikation als Instrument der Akzeptanzbeschaffung verwendet wird. \r\nRichtig ist aber, dass alle von Wissenschaftskommunikation profitieren könnten.\r\nWir möchten uns darüber austauschen, wie Wissenschaft unserer Meinung nach kommuniziert werden sollte. Und auch, welche Themen gerade jetzt mehr Aufmerksamkeit finden sollten. Eine Betrachtung von Wissenschaftler*innen, die gleichzeitig Wissenschaftskommunikator*innen sind - eine Kombination die immer noch recht selten ist.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 83,
      "code": "F93S98",
      "public_name": "Anna Müllner",
      "biography": "Ich habe Biologie studiert und an der Universität Heidelberg promoviert. Meine Doktorarbeit habe ich zum Thema “DNA Schaden und Zellalterung” am Deutschen Krebsforschungszentrum angefertigt. Schon länger widme ich mich der Wissenschaftskommunikation. Ich habe bereits Vorträge an Schulen gehalten sowie an Science Slams teilgenommen. Seit sechs Jahren blogge ich auf scilogs.de von Spektrum der Wissenschaft.  Gemeinsam mit Claudia veröffentliche ich den Podcast ZellKultur, rund um die Biologie.\r\nMein Wunsch ist es, Grundlagenwissen zu vermitteln, damit man nicht auf Scharlatanerie und Humbug hereinfällt.\r\nWeiteres unter zellmedien.de",
      "answers": []
    },
    {
      "id": 113,
      "code": "TPSJDZ",
      "public_name": "André Lampe",
      "biography": "Ich bin Wissenschafter, Moderator und Wissenschaftskommunikator. Studiert habe ich Physik, meinen Dr. habe ich im Bereich Hochauflösungsmikroskopie in der Biochemie gemacht. Ich mag Mikroskope ganz gerne. Ich schreibe für die ScienceBlogs.de, mache mit zwei wundervollen Kolleginnen das Projekt \"Plötzlich Wissen!\" zusammen, mache den Podcast \"mal ganz grundsätzlich (mgg) und den Podcast Wirkstoffradio mit Bernd Rupp zusammen.",
      "answers": []
    },
    {
      "id": 114,
      "code": "JT9GCR",
      "public_name": "Nicolas",
      "biography": "Scienceprenerd",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}