{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Lineup/events/11272.html",
  "id": 11272,
  "guid": "ebcd2fe3-7ff7-4323-9949-e82345dbc5bf",
  "logo": "/system/events/logos/000/011/272/large/danielleariellikittiecatflash-1.600x400.jpg?1577204601",
  "date": "2019-12-29T21:00:00+01:00",
  "start": "21:00",
  "duration": "02:00",
  "room": "Discotheque Nouveauancien",
  "slug": "36c3-abfahrplan-11272-danielle_arielli",
  "title": "Danielle Arielli",
  "subtitle": "Acid House",
  "track": "Music",
  "type": "djset",
  "language": "en",
  "abstract": "",
  "description": "Danielle was always surrounded by music. Her mother teaching\r\nmusic was just the first introduction to singing, guitar and piano at\r\na young age. At 12 Danielle was already determined to make\r\nmusic, whether it be on machines or playing bass in the school\r\nband, she realised that music was her passion very early. Whether\r\nits a disco inspired set on the beach in summertime or a dirty acid\r\nhouse rave in a big dark room, you always know its Danielle on the decks. Her tight mixing techniques and attentive track selection of\r\nthe best house music make for a hell of a party.\r\nSince moving to Berlin from Tel Aviv in 2015 to pursue her love for\r\nmusic, she has played on festivals like Garbicz, Feel, 3000Grad,\r\nWaha (Romania), Sa Terza Metari (Sardinia) and clubs like Kater\r\nBlau, Mensch Meier, Wilden Renata and Institüt Für Zukunft. Not to\r\nmentioned in her own home town, Tel Aviv, playing in some of the\r\nbest clubs like Alphabet. If she’s not playing her firey sets\r\nsomewhere, you can find Danielle working in her Berlin studio.\r\nWith top hit releases on renown labels like Plastik People [US],\r\nKeno Records [DE], Guesthouse Music [US], Hungarian Hot Wax\r\n[UK], Refuge [AUS] and of course on her own imprint, Tooflez\r\nMuzik. In 2016 she started Tooflez Muzik as a party label, holding\r\nwild weekend long parties in off locations in Berlin. Since then\r\nTooflez Muzik has grown to be a monthly mixtape series\r\nshowcasing some of the best and hidden talents from around the\r\nworld, and releasing high quality house music and all its sub\r\ngenres, with a lot in the works for 2019 including a vinyl release in\r\nFebruary from Danielle herself.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [],
  "links": [
    {
      "url": "https://soundcloud.com/danielle-arielli",
      "title": "Danielle Arielli on Soundcloud"
    }
  ],
  "attachments": []
}