{
  "id": 1156,
  "guid": "ed5b00c6-4312-4dd5-b44b-d56a20bf86cf",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Bin%C3%A4re_Zahlen_mit_Montessori_%E2%80%93_Mathe_kann_jeder!",
  "logo": null,
  "date": "2019-12-27T17:30:00+01:00",
  "start": "17:30",
  "duration": "1:00",
  "room": "Seminar room 13",
  "slug": "36c3-1156-session_binaere_zahlen_mit_montessori_mathe_kann_jeder_",
  "title": "Binäre Zahlen mit Montessori – Mathe kann jeder!",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "talk",
  "language": "de",
  "abstract": "",
  "description": "Ich stelle am Beispiel von binären Zahlen vor, wie Montessorimaterial funktioniert.\nIch stelle am Beispiel von binären Zahlen vor, wie Montessorimaterial funktioniert. Mit  Dienesmaterial (das sind im Prinzip kleine Klötzchen, Stangen und Platten)  rechne ich dezimale in binäre Zahlen um, erkläre Zahlensysteme im Allgemeinen, und kann auch binäre Zahlen z.B. multiplizieren oder dividieren.Wieso ist das interessant und wem nützt das? Mathematik polarisiert sehr. Entweder man kann Mathe (=klug) oder man kann es eben nicht (=dumm). Darüber wird viel Bewertung und Wissenshierarchie verbreitet. In folge dessen machen Menschen, die eher sozial und politisch interessiert sind oft einen großen Bogen um Mathe und Naturwissenschaften („kann ich eh nicht“) und viele mathematisch und naturwissenschaftlich versierte Menschen halten sich für klüger als den Rest und entziehen sich aber sozialen und gesellschaftlichen Fragen. Beides nicht gut. Und wir können uns diesen Graben in der Gesellschaft gerade heute nicht mehr leisten, wo wir vor großen Problemen wie z.B. Klimawandel stehen, die Lösungen auf sozialen, politischen, technischen und naturwissenschaftlichen Ebenen erfordern. Wir müssen also alles ins Boot holen und das fängt bei den Grundlagen an. Mir geht es darum, die Philosphie und den Ansatz von Montessori zu zeigen, und die Idee zu vermitteln, dass Mathe nicht unverständlich oder unanschaulich sein muss. Falls dich interessiert, worum es bei Montessori geht oder dich Mathematik überhaupt interessiert oder du ernsthafte Probleme mit Mathematik hast, bist du bei diesem Vortrag richtig.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Schnuppi",
      "public_name": "Schnuppi"
    }
  ],
  "links": [
    "http://www.schrottschnuppe.de"
  ]
}