{
  "id": 758,
  "guid": "ed99a7b8-2ef8-56ee-8292-782864150f58",
  "logo": "/media/36c3/images/J839PV/Google_Women_Cloud_293_neu.jpg",
  "date": "2019-12-29T14:00:00+01:00",
  "start": "14:00",
  "duration": "01:00",
  "room": "ChaosZone Bühne",
  "slug": "J839PV",
  "url": "https://cfp.chaoszone.cz/36c3/talk/J839PV/",
  "title": "Google’s ‘quantum supremacy’ - is Google about to break cryptocurrency?",
  "subtitle": "",
  "track": "Security",
  "type": "Vortrag 60min  (inkl. Q&A)",
  "language": "en",
  "abstract": "This talk will teach you what Google’s official claim of supremacy means and how quantum computing will practically change the world of cryptocurrency. You will understand why Google and any other quantum computer could be about to beak blockchain-based cryptocurrency, see what new ways are in place to save blockchain from quantum, and learn why crypto is a potential application for ‘quantum supremacy’.",
  "description": "Google announced that it has built and tested a 54-qubit quantum processor. ‘Quantum supremacy’ means that Google has been able to perform a calculation that is impossible to perform on traditional supercomputers. But what does ‘quantum supremacy’ mean for cryptocurrency and crypto mining, where having a highly efficient machine gives you an edge over everyone else?\r\nIn this talk, I will explain quantum computing, ‘quantum supremacy’, and cryptocurrencies like Bitcoin and Ethereum in an understandable and entertaining way. I will also introduce the biggest danger to blockchain from ‘quantum supremacy’. With this milestone, a long-anticipated step toward useful quantum computers, understanding what new ways are in place to save crypto from ‘quantum supremacy’ and how crypto should prepare for ‘quantum supremacy’ is key to evaluate the facts.\r\nA surprising potential application for Google’s ‘quantum supremacy’ is cryptocurrency. Applying ‘quantum supremacy’ to generate certifiable random numbers for blockchain helps to understand the advantages and disadvantages of quantum computing. As a cryptocurrency expert, I will give you insights into these as well as further real-world applications.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 70,
      "code": "H9TDUP",
      "public_name": "Victoria Riess",
      "biography": "6+years of experience in strategy consulting and corporate strategy. Delivered strategy consulting projects across EMEA in 2+ industries (e.g., information technology & (financial) services, transportation & logistics). Twinned with experience in IoT, AI, machine learning, cloud computing, big data, predictive analytics and a passion for cybersecurity.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}