{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10704.html",
  "id": 10704,
  "guid": "ee8463d4-e930-445e-ab84-0bd02e777e5b",
  "logo": null,
  "date": "2019-12-29T16:10:00+01:00",
  "start": "16:10",
  "duration": "01:00",
  "room": "Dijkstra",
  "slug": "36c3-10704-mensch_-_kunst_maschine",
  "title": "Mensch - Kunst – Maschine",
  "subtitle": "Mit künstlicher Intelligenz zu neuer Kunst zum kybernetischen Verstand",
  "track": "Art & Culture",
  "type": "lecture",
  "language": "de",
  "abstract": "Simon: Kann künstliche Intelligenz Kunst erzeugen? \r\nFlorina: Können Menschen von künstlich intelligenten Systemen erzeugte Kunst verstehen?\r\nSimon: Ist Kunst ein Weg zu neuen Stufen eines kybernetischen Verstandes? \r\nFlorina: Wie können Mensch und Maschine sich in künstlerischen Prozessen einander verstehen lernen? \r\nSimon: Derr Stand der KI-Kunst ist keine Kunst oder keine KI.\r\nFlorina: Ein schwer zu bestimmender Standpunkt, da das Verständnis was Kunst ist von unserer Fähigkeit abhängt sie als solche anzunehmen.\r\nSimon: Was ist zu erwarten?\r\nFlorina: Wir werden mit unserer menschlichen Eitelkeit konfrontiert werden, nicht die Einzigen zu sein, die schöpferisch und auch künstlerische Relevanz in Betrachtern auslösen. Dies liegt mitunter an unseren bisherigen Kunstbegriffen und -verständnissen, die oftmals mit Intentionalität assoziiert sind.\r\nEliza: Warum?\r\nFlorina Speth und Simon Hegelich widmen sich diesen Fragen in einem dialogischen Gespräch, wobei sie ihre großen Leidenschaften;- Kunst, maschinelles Lernen, Hegelsche Dialektik, Zukunftsforschung, Science Fiction, Kybernetik und Transhumanismus- der Erweiterung durch Diskurs unterziehen.",
  "description": "Künstlich intelligente Systeme werden seit den 70er Jahren zunehmend  in künstlerischen Schaffensprozesse einbezogen. Ob Computer auch autonom Kunst generieren können, ist keine Frage der Leistungsfähigkeit solcher Systeme, es wirft vielmehr die Frage auf, inwieweit tradierte Kunstbegriffe neu gedacht werden können. Die Beschäftigung mit KI und Kunst birgt im Vergleich zu laufenden KI-Debatten eine Reihe zusätzlicher Denkfreiheitsgrade: Sie ist erfahrbar! Gerade weil Kunst als Konzept schwierig zu fassen ist, uns gleichzeitig Künstlerisches inspiriert, zum Spekulieren, Träumen und Empfinden anregt, lässt sich vor diesem Hintergrund ganz anders über KIs und ihre Potentiale diskutieren. Unter Einbezug des technischen Standes derzeitiger Deep Learning Systeme und der eigenen künstlerischen Erfahrung fächern wir diese Potentiale auf.\r\nWir stellen den Diskurs um Grundfragen zum Verhältnis Mensch-KI-Kunst neue Fragen diametral gegenüber: \r\nKann künstliche Intelligenz Kunst erzeugen?\r\nWie können wir Kunst von künstlich intelligenten Systemen verstehen?\r\nKann Kunst KI erzeugen und versteht das noch jemand?\r\n\r\nFlorina Speth (Zukunftsforscherin, Multiinstrumentalistin, Cellistin, Komponistin experimenteller Musik) und Simon Hegelich (KI-Entwickler, Philosoph, Professor für Political Data Science, Videoartist und Synthinerd) widmen sich einem dialogischen Diskurs und schmeißen ihre großen Leidenschaften zusammen: Kunst, maschinelles Lernen, Hegelsche Dialektik, Zukunftsforschung, Science Fiction, Kybernetik und Transhumanismus. Es könnte explosiv werden.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9298,
      "public_name": "Simon Hegelich"
    },
    {
      "id": 9519,
      "public_name": "Florina Speth"
    }
  ],
  "links": [
    {
      "url": "https://soundcloud.com/florinaspeth",
      "title": "Soundcloud Florina"
    },
    {
      "url": "https://www.youtube.com/watch?v=mgSQv0IsVvM",
      "title": "TEDx Talk Artificial Spirits"
    },
    {
      "url": "http://politicaldatascience.blogspot.com/p/blog-page.html",
      "title": "Bilder TensorFloys Projekt"
    }
  ],
  "attachments": []
}