{
  "id": 1093,
  "guid": "ef30e718-5095-408f-aeee-bc14be571b91",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Introduction_to_Natural_Language_Processing",
  "logo": null,
  "date": "2019-12-29T11:00:00+01:00",
  "start": "11:00",
  "duration": "2:00",
  "room": "Seminar room 14-15",
  "slug": "36c3-1093-session_introduction_to_natural_language_processing",
  "title": "Introduction to Natural Language Processing",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "workshop",
  "language": "de",
  "abstract": "",
  "description": "This workshop will introduce you to the basics of natural language processing in Python.\n''(While this abstract is in English, this workshop will be held either in English or German; depending on who wants to participate!)''Language is not just everywhere, but also essential to what makes us human. The rapidly growing field of Natural Language Processing (NLP) and/or computational linguistics, essentially, is trying to make computers 'understand' and produce natural language. The results of this endeavor are already omnipresent. Just to name a few, think about voice assistants and interfaces, chatbots, automated customer service agents, or the large scale analysis of, for example, social media data.This two-hour workshop, targeted towards interested beginners, will be a gentle introduction to NLP. In the first half an hour, we will be discussing some fundamentals of linguistics. Afterward, we will use Python to practically explore a linguistic dataset (a language corpus) and get to know some fundamental methods of NLP. If time allows for it, we will also briefly address state-of-the-art machine and deep learning approaches to understanding, analyzing, and generating natural language.'''About Me'''<br>My name is Ingo, and I'm currently working at Heidelberg University as a computational/corpus linguist and teacher educator. I'm particularly involved with teacher education/training and foreign language teaching.'''Required Previous Knowledge'''<br>* You are not required to have any previous knowledge about linguistics or NLP* Basic knowledge of Python (or similar) is recommended if you want to follow along with the technical section of the workshop'''Technical Requirements'''<br>If you want to participate actively (i.e., code along), you should bring a device that is capable of running a modern browser and has Internet access. Being able to type comfortably is also recommended ;). Alternatively, any device capable of running Python 3.6+ (ideally in a Jupyter Notebook) will do just fine!'''Material'''<br>All material (e.g., slides) will be provided on this page after the workshop. Please also check back here a day before the workshop because I will provide some additional material useful for active participation.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Ingo",
      "public_name": "Ingo"
    }
  ],
  "links": []
}