{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10571.html",
  "id": 10571,
  "guid": "f01cfe55-1ef7-4c9f-84be-276730cdbef8",
  "logo": "/system/events/logos/000/010/571/large/streifen.png?1577045110",
  "date": "2019-12-29T21:50:00+01:00",
  "start": "21:50",
  "duration": "00:40",
  "room": "Borg",
  "slug": "36c3-10571-nutzung_offentlicher_klimadaten",
  "title": "Nutzung öffentlicher Klimadaten",
  "subtitle": "Früher war mehr Schnee",
  "track": "Science",
  "type": "lecture",
  "language": "de",
  "abstract": "'In meiner Jugend war mehr Schnee!' oder 'Früher war es auch schon heiß!' könnte man so glauben, je nach Vehemenz des Ausrufs, oder man schaut halt nach. <insert old man jells at cloud meme>",
  "description": "Moderne Klimamodelle werden aus den lokalen Beobachtungen des Wetters gespeist. Durch die Verwendung historischer Daten vergangener Jahrzehnte werden aktuelle Modelle auch auf diesen Zeitraum ausgedehnt. Wir können also nachsehen, wie heiß es war oder wie tief der Schnee auf dem Weg zur Schule denn wirklich war. Dies ist auch dann möglich wenn die lokalen Aufzeichnungen selbst nicht immer online verfügbar sind. Zahlreiche staatliche und überstaatliche Organisationen stellen inzwischen die Produkte ihrer Klimamodelle, mit Einstiegshürden unterschiedlicher Höhe, für die Öffentlichkeit bereit. Der Verbreitungsweg dieser Daten variiert irgendwo zwischen csv Dateien auf öffentlichen FTP Servern, API Schnittstellen zum maßgeschneiderten Datenabruf (auch gerne mal von Magnetband) und thematisch fertig aufbereiteten Visualisierungen. \r\n\r\nDieser Beitrag zeigt eine kleine Auswahl an Diensten (z.B. Opendata des Deutschen Wetterdienstes, Land Data Assimilation System der NASA), die den Zugang zu globalen Klimadaten ermöglichen. Am Beispiel des European Centre for Medium-Range Weather Forecasts (ECMWF) und des Copernicus Climate Change Service werden sowohl API Zugriff zum Download der Daten als auch die Möglichkeit der Onlineberechung über ein Webinterface dargestellt.\r\n\r\nSchauen wir mal, was wir so finden.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 7606,
      "public_name": "manuel"
    }
  ],
  "links": [],
  "attachments": []
}