{
  "id": 1019,
  "guid": "f08d3915-e3e2-5ffe-a0a7-f8358c74aada",
  "logo": "/media/36c3/images/AAYM3Q/icon.jpg",
  "date": "2019-12-29T21:45:00+01:00",
  "start": "21:45",
  "duration": "01:00",
  "room": "Bühne",
  "slug": "AAYM3Q",
  "url": "https://fahrplan.das-sendezentrum.de/36c3/talk/AAYM3Q/",
  "title": "Fernostwärts: Digitale Widerstandsstrategien in Hongkong [Bühne]",
  "subtitle": "",
  "track": "Bühne Sendezentrum",
  "type": "Normale Länge",
  "language": "de",
  "abstract": "Deutschlands bester Asienpodcast präsentiert einen Überblick über sechs Monate Protest in Hongkong mit Fokus auf die strategische Nutzung von digitalen Tools und Memes.",
  "description": "Wir berichten seit Beginn der Proteste in Hongkong im Juni immer wieder mit Gästen oder aus unserer eigenen Berichterstattung über die politischen Entwicklungen in der Stadt. Beim Sendezentrum wollen wir auf sechs Monate Protest zurückblicken - mit besonderem Fokus auf die digitalen Strategien der Protestierenden und die politische und strategische Rolle von Memes und Protestart: Warum ist Telegram so wichtig, dass es einem Hackerangriff des chinesischen Staates ausgesetzt war? Wie entkommen viele Demonstrierende immer wieder Festnahmen der Polizei? Wo kommt die ganze Protestkunst her, die ununterbrochen weltweit und in der Hongkonger U-Bahn verteilt wird? Und welche neuen chinesischen Zeichen haben die Demonstrierenden kreiert, um ihre politischen Forderungen zu vermitteln?\r\n\r\nEine unserer Moderator*innen, Katharin, wird direkt von ihren Recherchen für journalistische Berichterstattung und ihren Talk auf dem 36C3 zu Hongkong berichten. Gegen Ende des Podcasts planen wir, Gäste mit Expertise zu Protesten in anderen Teilen der Welt (voraussichtlich Irak und Libanon, eventuell Indonesien oder Chile) mit an den Tisch zu holen, um uns über darüber auszutauschen, welche Strategien Demonstrierende international voneinander kopieren und wie Demonstrierende in aller Welt sich miteinander identifizieren und versuchen, transnationale Solidarität aufzubauen.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 118,
      "code": "TYQJ8N",
      "public_name": "Katharin Tai",
      "biography": "Katharin promoviert am MIT zu chinesischer Netzpolitik und arbeitet seit 2013 als Journalistin mit Fokus Ostasien. Seit 2014 betreibt sie mit Ningwie Fernostwärts, Deutschlands besten Asienpodcast, und seit Mitte 2019 den Fernostwärts-Newsletter.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}