{
  "id": 584,
  "guid": "f3131c0f-4d45-536b-b106-e822d2abe188",
  "logo": "/media/36c3/images/GVAD3D/bild2.png",
  "date": "2019-12-29T15:00:00+00:00",
  "start": "15:00",
  "duration": "01:00",
  "room": "WikiPaka WG: Bibliothek",
  "slug": "GVAD3D",
  "url": "https://cfp.verschwoerhaus.de/36c3/talk/GVAD3D/",
  "title": "Verwaltungsdigitalisierer aller föderalen Ebenen, versammelt euch!",
  "subtitle": "",
  "track": null,
  "type": "Meetup",
  "language": "de",
  "abstract": "Ein Meeting für alle, die (trotz allem) an der Digitalisierung der Verwaltung mitarbeiten. \r\nKommt, tauscht euch aus und bildet Banden!",
  "description": "Calling alle Menschen, die in und um die Verwaltung herum an der Digitalisierung der öffentlichen Hand arbeiten - in Kommunen, Ländern, im Bund, bei Selbstverwaltungen, und ja, auch bei Beratungsfirmen.\r\n\r\nWir wissen, dass euch (und uns) gibt, und wir wissen, dass wir zusammenkommen müssen wenn das noch was werden soll mit dem souveränen, bürgerrechtsorientierten, datensparsamen und verdammt noch mal nutzerfreundlichen digitalen Staat. In dem man nicht für Papier zum Amt laufen, aber auch keine Panik vor algorithmischem Profiling haben muss.\r\n\r\nLasst uns zusammenkommen und fernab vom üblichen Bullshitbingo über Verwaltungsdigitalisierung reden – Onlinezugangsgesetz und (sehr wichtig) beyond!\r\n\r\nKennenlernen, vernetzen, aktiv(er) werden - vielleicht schreiben wir revolutionäre Lieder (OZG, mit freundlichen Grüßen), vielleicht hecken wir Gegenentwürfe aus, vielleicht finden wir Möglichkeiten für eine bessere Beteiligung der Zivilgesellschaft - in jedem Fall gibt es Kaffee und wir freuen wir uns auf euch!",
  "recording_license": "",
  "do_not_record": true,
  "persons": [
    {
      "id": 79,
      "code": "QVT9YN",
      "public_name": "Spyr_0",
      "biography": "Ich interessiere mich dafür, wie Deutschland seine Verwaltung digitalisieren kann.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}