{
  "id": 385,
  "guid": "f3e731fa-1a62-5238-969a-7f28e5812334",
  "logo": "",
  "date": "2019-12-29T20:50:00+01:00",
  "start": "20:50",
  "duration": "01:00",
  "room": "OIO workshop dome",
  "slug": "8PGUXK",
  "url": "https://talks.oio.social/36c3-oio/talk/8PGUXK/",
  "title": "Global Innovation Gathering meetup",
  "subtitle": "",
  "track": "Hardware & Making",
  "type": "Workshop 1 hour",
  "language": "en",
  "abstract": "The Global Innovation Gathering (GIG) is a diverse community of innovation hubs, makerspaces, hackerspaces and other grassroot innovation community spaces and initiatives as well as individual innovators, makers, technologists and changemakers.\r\n\r\nWith strong roots in the global south, we share, collaborate and work together globally. GIG provides a platform for meaningful exchange by fostering knowledge exchange and collaboration between its members. We have a non-profit organisation registered in Germany.\r\n\r\nGIG is pursuing a new vision for global cooperation based on equality, openness and sharing. We aim to enable more diversity in the production of technology, and global innovation processes and support open and sustainable solutions developed by grassroot innovators.\r\n\r\nWhat can we create together?",
  "description": "",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 96,
      "code": "P3GLDY",
      "public_name": "Sandra GIG",
      "biography": "Sandra Mamitzsch baut seit 2018 das Berliner Büro des Global Innovation Gathering e.V., einem globalen Netzwerk von Makern und Innovatoren, auf und beschäftigt sich daher viel damit, wie dezentrale Zusammenarbeit und offene Organisationsformen funktionieren. Hauptsächlich ist sie im Verein für das Horizon2020-Förderprojekt Careables.org verantwortlich, dass innerhalb von Makerspace-Communities dabei hilft, mit offenen Technologien und Co-Design in Gesundheit und Pflege das Leben von Menschen zu verbessern. Von 2012-2017 war sie Programmdirektorin der re:publica und arbeitet dort weiterhin als freie Beraterin und Kuratorin. Nebenbei ist sie Mitglied bei European Digital Rights (EDRi) und beim Digitale Gesellschaft e.V.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}