{
  "id": 747,
  "guid": "f4c71fc1-0569-5924-b2e8-2e539aa26186",
  "logo": "/media/36c3/images/CUVNKQ/Gartensia_logo.png",
  "date": "2019-12-29T21:45:00+01:00",
  "start": "21:45",
  "duration": "01:00",
  "room": "ChaosZone Bühne",
  "slug": "CUVNKQ",
  "url": "https://cfp.chaoszone.cz/36c3/talk/CUVNKQ/",
  "title": "Den Wohnungsmarkt hacken: Wie geht das?",
  "subtitle": "",
  "track": null,
  "type": "Vortrag 60min  (inkl. Q&A)",
  "language": "de",
  "abstract": "Ein Haus das zwanzig Jahre lang leer steht, eine gravierende Wohnungsnot und ein paar Aktivisti reichen um Leerstand zu beenden. \r\nIm Juli wurde die Gartenstraße 7 in Tübingen Leerstand besetzt und ist es bis heute. Der Talk soll davon handeln, warum es zu einer solchen Besetzung kommt, wie so etwas im Alltag aussieht, wie die Besetzung sich von anderen unterscheidet und wie die Zukunft aussehen wird.",
  "description": "In Tübingen herrscht wie in vielen anderen Städten Wohnungsnot. Das Problem wird insbesondere durch Leerstand und einen eklatanten Mangel an sozialem Wohungsbau verschärft. Es gibt verschiedene Gesetzte, Verordnungen und Handlunkgsmöglichkeiten die der Kommune helfen dem Problem zu begegnen. Trotz aller Bemühungen der Stadt stehen Gebäude wie die Gartenstraße 7 *20 Jahre* lang leer.\r\n\r\nDie Besetzung durch Aktivisti im Juli hat diesen Leerstand beendet. Seitdem leben in diesem Haus Menschen, es ist ein täglich geöffnetes Cafè eingerichtet, es finden Konzerte, Lesungen und Workshops statt. Ich würde gerne zeigen wie es zur Schaffung dieses Freiraums kam, wie der Alltag und aber auch die Zukunft des Projekts aussieht. Große Rolle wird dabei die \"Tübinger Linie\" spielen - eine Position der Stadt die Verhandlungen einer Räumung vorzieht.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 57,
      "code": "TZBDGG",
      "public_name": "Moanos",
      "biography": "I studied Medical Engineering and are currently working in a research lab in neuroscience. We there \"hack\" the brain with electric and magnetic stimulation. For me this means a lot of programming, mostly in Python and C.\r\nI also created an online platform for home training of stroke patients.\r\n\r\nMy biggest Open-Source Project so far is ILMO, a tool for the management of a library.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}