{
  "url": "https://frab.riat.at/en/36C3/public/schedule/events/94.html",
  "id": 4294,
  "guid": "f4faef07-d73e-4dbe-9a26-56a9b0ba5ac6",
  "logo": null,
  "date": "2019-12-29T13:20:00+01:00",
  "start": "13:20",
  "duration": "00:30",
  "room": "CDC - Stage",
  "slug": "36C3-94-almonit_project_decentralized_websites",
  "title": "Almonit project: Decentralized Websites",
  "subtitle": "",
  "track": "Stage",
  "type": "lecture",
  "language": "en",
  "abstract": "Almonit is a project for decentralized websites and web services.\r\n\r\nDecentralized websites and web services are an alternative to the way the web functions today. They combine decentralized storage (like IPFS), decentralized name services (like ENS) and P2P networks in order to replace the server-based model of the web.\r\n\r\nThis lecture describes the Almonit project, its architecture, the technical details of the technology and the ecosphere in which it is created. \r\n\r\nCome discover the state-of-the-art of this up-and-coming area!",
  "description": "How does the web function? Generally speaking, it uses servers to provide content or services, and DNS to provide access to those servers.\r\n\r\nThe Almonit project provides an alternative to the traditional server-DNS model. Instead of a server, we use decentralized storage (like IPFS), and instead of DNS, we use a decentralized name service (like ENS). We provide tools, methods and a portal for creating and accessing the decentralized web.\r\n\r\nThe decentralized websites and web services scene is very new. In its current form, it was developed mostly in 2019. So far, it contains around a 100 websites experimenting with the technology, but its potential is promising. We envision it being used to create community-driven websites which would be made, moderated and maintained by a community instead of a central entity.\r\n\r\nThis lecture describes the Almonit project, its architecture and technical details. We also present the ecosphere of decentralized websites and web services in which the project is created, and survey the past, present and also possible future use-cases of this technology, including its limitations.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 98,
      "public_name": "neiman"
    }
  ],
  "links": [
    {
      "url": "https://almonit.eth.link/",
      "title": "Almonit"
    },
    {
      "url": "https://twitter.com/GoAlmonit/status/1179633247745171456",
      "title": "Almonit browser extension"
    },
    {
      "url": "https://twitter.com/GoAlmonit",
      "title": "Almonit Twitter"
    },
    {
      "url": "https://medium.com/the-ethereum-name-service/almonit-a-directory-of-the-new-decentralized-web-ens-spotlight-8f40f35e5350",
      "title": "Article about Almonit"
    }
  ],
  "attachments": []
}