{
  "id": 350,
  "guid": "f5910185-f9b5-5d5a-b2df-fdfce6b8a8b9",
  "logo": "/media/36c3-oio/images/CJFWMY/PleskPahil_portrait_400x400_mVnE9V5.jpg",
  "date": "2019-12-29T18:30:00+01:00",
  "start": "18:30",
  "duration": "00:25",
  "room": "OIO Stage",
  "slug": "CJFWMY",
  "url": "https://talks.oio.social/36c3-oio/talk/CJFWMY/",
  "title": "Episode VIII - Die letzten Freifunker?",
  "subtitle": "",
  "track": "Ethics, Society & Politics",
  "type": "Talk 20 minutes + 5 minutes Q&A",
  "language": "de",
  "abstract": "Freifunk steht für freie Kommunikation in digitalen Datennetzen. Reicht dieser Slogan aus, um die Communities wachsen und die Marke Freifunk bei den Menschen in unserem Land bekannt zu machen? Was können wir tun, um nicht bald die letzten Freifunker zu sein und insbesondere eine engagierte junge Generation anzusprechen, die Informationen ganz anders filtert und verarbeitet als GenX oder Baby Boomers? In diesem interaktiven Talk mit einer Marketingexpertin aus der IT Branche, geht es um die Identität von Freifunk und warum 8 Sekunden entscheidend sind.",
  "description": "Freie Kommunikation in digitalen Datennetzen - ein wichtiges Gut, für das Freifunk steht. Aber wie steht es um die Marke Freifunk in Städten, Gemeinden, Kommunen und der Bevölkerung? Gibt es Nachwuchssorgen in den Communities und könnten wir nicht schon viel weiter sein mit unserem 'Netzausbau'? In diesem Talk möchte ich mit Euch gemeinsam einen kritischen Blick auf Freifunk von der Marketingseite her werfen und Ideen entwickeln, wie wir viele Menschen einladen können mitzumachen sodass Freifunk zu einem wichtigen Bestandteil ihres digitalen Lebens wird. Je mehr aktive Mitglieder unsere communities haben, desto eher können wir das umsetzen, worüber Politik und etablierte Wirtschaft primär nur reden: Digitalisierung und digitale Transformation vorantreiben - in Stadt und Land.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 124,
      "code": "JTAJLK",
      "public_name": "Glitzi",
      "biography": "Marketing- und Biz Dev Expertin mit mehr als 30 Jahren Erfahrung in der IT und Cloud Branche aber immer noch im Kopf jung geblieben dank der ständigen Veränderungen in digitalen Welt. Die Art und Weise, wie Marken wahrgenommen, Informationen geholt, transportiert und verarbeitet werden verändert sich rasant und und ist hoch spannend. Selbst in einem sehr technischen Umfeld ist Marketing heutzutage unerlaesslich. Denn es ist wichtiger denn je unterschiedliche Zielgruppen und ihre Bedürfnisse so gut wie möglich zu verstehen, um gesteckte Ziele zu erreichen. Seit vielen Jahren bin ich im internationalen Umfeld zuhause und darauf spezialisiert, unterschiedlichste Gruppen zusammenzubringen und deren jeweilige Ziele und Bedürfnisse in eine Sprache zu übersetzen, die alle verstehen.",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}