{
  "id": 1182,
  "guid": "f5da4ae5-d1f2-4768-98e0-8db20483dc6d",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Learn_To_Solder",
  "logo": null,
  "date": "2019-12-30T11:00:00+01:00",
  "start": "11:00",
  "duration": "5:59",
  "room": "Assembly:Hardware Hacking Area",
  "slug": "36c3-1182-session_learn_to_solder",
  "title": "Learn To Solder",
  "subtitle": "Day 4",
  "track": "self organized sessions",
  "type": "workshop",
  "language": "en",
  "abstract": "",
  "description": "Learn to Solder!  A large variety of way cool kits are available, all designed for total beginners to complete successfully -- and intriguing enough for the total hardware geek.<br> <br> <span style=\"color:orange\">'''''This ongoing workshop will be happening concurrently with lots of other way cool workshops at the Hardware Hacking Area!  Throughout all of 36C3.'''''</span><br> <span style=\"color:red\">'''''Please come by any time to learn to solder!'''''</span>\n[[File:LearnToSolder.jpg|center|500px|Room full of happy hardware hackers at the Hardware Hacking Area at 30C3]]<br>'''What''': A place to get together to solder stuff!<br>       Learn to Solder!<br>       You can easily learn all of the skills you need in a short time.<br>       Make a project, and take it home with you!<br>       If you have your own project (advanced or simple),<br>       bring it by, and if you would like help, you can get it!<br>'''When''':<span style=\"color:red\"> '''''Any time!'''''</span> All day and all night -- Every day of 36C3<br>       Most projects take about 1.5 to 2 hours<br>       <span style=\"color:orange\">'''''This ongoing workshop will be happening concurrently with lots of other way cool workshops at the Hardware Hacking Area!'''''</span><br>       <span style=\"color:red\">'''''Please come by any time to learn to solder!'''''</span><br>     '''Where''': The '''Hardware Hacking Area''' -- West side of Exhibition Hall 2 -- [https://events.ccc.de/congress/2019/wiki/images/c/ce/HHA_map.png map]<br>'''Who''': You! All ages, all skill levels -- It is fun to make things in the<br>       friendly community of the Hardware Hacking Area.<br>       ''Come join us. Everyone is welcome.''<br>'''Cost''': Instruction is free! We ask that people pay only for the cost of<br>       the parts used -- kit prices range from €10 to €30.<br>          <span style=\"color:orange\">''' -- No need to register -- just come on by,</span> <span style=\"color:red\">any time!'''</span><br>Learn to solder! [[User:Maltman23|Mitch Altman]] and others will bring kits to make cool, practical, intriguing, hackable things that you can bring home after you make it. Of course, you can also bring your own projects to hack. And if you have anything to fix, bring it by!Plenty of cool kits are available to make, including:<br>* TV-B-Gone (turn off TVs in public places!)<br>* ArduTouch Music Synthesizer (make cool noise and music with this Arduino-comaptible kit!)<br>* Brain Machine (Meditate, Hallucinate, and Trip Out!)<br>* Trippy RGB Waves (interactive art blinky lights!)<br>* MiniPOV (write your message in the air!)<br>* MintyBoost (charge your USB enabled gadgets!)<br>* Hello My Name Is... badge (Geeky, blinky version of the sticker!)<br>* microcontroller programmers (program all your AVR family chips!)<br>* Arduino clones (make just about anything!)<br>* And many, more!<br>More info on these projects is available at:<br>[http://www.CornfieldElectronics.com Cornfield Electronics] (click on the \"projects\" tab)<br>[http://www.adafruit.com/ Adafruit]<br>[http://www.evilmadscientist.com/ Evil Mad Scientist]<br>[http://analogmachines.com Analog Machines]<br>Anyone can learn to solder!  Even if you have never made anything in your life, you can learn this very useful and enjoyable skill. It really is fun!  [[User:Maltman23|Mitch]] and has taught tens of thousands of people to solder all around the world, and he can teach you, too!  Add yourself to the ever increasing community!<br><br><br>",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Maltman23",
      "public_name": "Maltman23"
    }
  ],
  "links": []
}