{
  "id": 990,
  "guid": "f614c0b7-ba66-574d-aa9b-c90596ee5fc3",
  "logo": "",
  "date": "2019-12-27T23:00:00+01:00",
  "start": "23:00",
  "duration": "01:00",
  "room": "Sendetisch",
  "slug": "DEBQLR",
  "url": "https://fahrplan.das-sendezentrum.de/36c3/talk/DEBQLR/",
  "title": "The InSnider feat. Kultpess - A Star Wars Episode 9 Crossover",
  "subtitle": "",
  "track": "Sendetisch",
  "type": "Normale Länge",
  "language": "de",
  "abstract": "Der jährliche Crossoverpodcast der Kulturpessimist*innen, The InSnider und Special Guest Ralf Stockmann über den neusten Film aus den Star Wars Universum.",
  "description": "Nachden die letzten beiden Specials vom 35c3 und vom Day of the Podcast 2019 etwas abseits des Star Wars Universum das MCU erforscht haben, geht es in dieser Ausgabe wieder zurück an den Ursprung. Episode 9 ist in den Kinos und das ist für uns ein Grund, den Film, seine Bedeutung für die aktuelle Trilogie und als Abschluss der Skywalker Saga unter die Lupe zu nehmen.",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 6,
      "code": "WRLGYE",
      "public_name": "Ralf Stockmann",
      "biography": null,
      "answers": []
    },
    {
      "id": 66,
      "code": "ZBJHRG",
      "public_name": "Christopher van der Meyden",
      "biography": "Host vom Countdown Podcast",
      "answers": []
    },
    {
      "id": 81,
      "code": "NDZTFY",
      "public_name": "Eric S.",
      "biography": "Podcastet bei den Kulturpessimist*innen und den Filmklassikern",
      "answers": []
    },
    {
      "id": 85,
      "code": "3VCEJK",
      "public_name": "MacSnider",
      "biography": "Podcaster seit 2011, Ultraschall Ultra, König vom Stimmenreich",
      "answers": []
    },
    {
      "id": 109,
      "code": "VYP9NR",
      "public_name": "Becci (@genderbeitrag)",
      "biography": "Ihr könnt mich sonst noch bei FRÜF – Frauen reden über Fußball (ein Fußball-Frauen-Kollektiv), bei den Filmlöwinnen (feministische Filmanalyse), bei den Kulturpessimist:innen und den Klassikern der Filmgeschichte (aktuelle und alte Filme und Serien aus emanzipatorischer Perspektive betrachtet) oder bei einem meiner vielen Cameoauftritte in der deutschsprachigen Podcastwelt hören. Ich mache beruflich was mit Öffentlichkeitsarbeit, zelebriere Kaffee, lebe und liebe intersektionalen Feminismus, singe, vermisse Israel (wo ich mal 1 Jahr gelebt habe), bingewatche Serien, lebe in diesem Internet (und manchmal auch in Brandenburg), esse Hummus, mache gerne Quatsch, mag Nerdkram und Fußball (besonders VfL Wolfsburg und Turbine Potsdam).",
      "answers": []
    }
  ],
  "links": [],
  "attachments": [],
  "answers": []
}