{
  "id": 1513,
  "guid": "f89e3745-a382-571b-8087-8ad227f49478",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Hacking_Licence",
  "logo": null,
  "date": "2019-12-27T20:00:00+01:00",
  "start": "20:00",
  "duration": "1:00",
  "room": "Assembly:Digitalcourage",
  "slug": "36c3-1513-session_hacking_licence",
  "title": "Hacking Licence",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "workshop",
  "language": "de",
  "abstract": "",
  "description": "Your daily basic hacking learning lesson.\nWe offer instructions for \"Damn Vulnerable Web Application\" daily. At least for 2 to 4 people. Join us if you would like to learn about security gaps in web programming (e.g. bad passwords, SQL injection, cross-site requests forgery). You will learn how to hack systems and how to reset them afterwards. At the end you'll get a driver's ... we mean ... hacking licence! It's recommended to bring your own device (laptop) with an working ethernet port. We have a single Ethernet-to-USB adapter available for devices lacking an Ethernet port such as Apple Macbooks.Wir bieten täglich „Damn Vulnerable Web Application“ ( http://www.dvwa.co.uk/ bzw. https://github.com/ethicalhack3r/DVWA ) unter Anleitung an, für mindestens 2 bis 4 Personen. Inhaltlich geht es dabei um klassische Sicherheitslücken der Webprogrammierung (z.B. schlechte Passwörter, SQL-Injection, Cross-Site-Request-Forgery). Hier lernst du Systeme zu hacken und wiederherzustellen und erhältst am Ende einen Hacking-Führerschein! Bringt am besten euren eigenen Computer mit einem funktionierenden Ethernet-Port mit. Wir haben einen Ethernet-zu-USB-Adapter, damit ihr auch Geräte ohne integrierten Ethernet-Anschluss (wie z.B. Apple Macbooks) nutzen könnt.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Chpietsch",
      "public_name": "Chpietsch"
    },
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:CryptGoat",
      "public_name": "CryptGoat"
    }
  ],
  "links": [
    "https://digitalcourage.de/"
  ]
}