{
  "id": 1098,
  "guid": "f8a7bdb6-2009-482a-a17f-1b93b4c7d190",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:KinkyGeeks_-_Bondage_f%C3%BCr_Anf%C3%A4nger_Workshop",
  "logo": null,
  "date": "2019-12-27T17:30:00+01:00",
  "start": "17:30",
  "duration": "2:00",
  "room": "Lecture room M3",
  "slug": "36c3-1098-session_kinkygeeks_bondage_fuer_anfaenger_workshop",
  "title": "KinkyGeeks - Bondage für Anfänger Workshop",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "workshop",
  "language": "de",
  "abstract": "",
  "description": "Bondage and Safety lesson for beginner\nIf you are interested in learning the first steps towards bondage / techniques for playful restraint, this workshop is for you. If you have never touched a piece of rope before, this workshop will give you the basics to get started. We will cover the following topics:* Risk-awareness and consent (intro). How to negotiate a bondage session and how to deal with risk.* Safety and materials. Many materials are suitable for bondage, and there are various cheap or free options. Each material comes with its own safety implications to be aware of. Of course, there is also material that is just ill-suited for most use cases. (aka. Why are furry handcuffs just horrible, what's a \"good\" piece of rope, and funny stories from mishaps)* \u007fSafety and anatomy. Humans are semi-stable objects. While some areas of the human body are pretty resistant to reasonable force (e.g., pressure from rope), others are not. We'll discuss where to be careful with rope, what can happen if things go wrong, and how to tie with safety in mind.* Practice: The square knot. We'll learn a simple, yet effective knot as a building block for all ties in this workshop* Practice: Single column tie. How to tie a rope to a single limb (hand, foot), with the possibility of tying the free side of the rope to objects* Practice: Double column tie. How to tie two limbs together (hands, feet)* Practice: Spaced double column tie. How to tie hands together, but with a rope-bar in between* Practice: Rope organization. How to coil up rope for storage to not end up in a mess the next time you take it back out* Practice: Bonus tie. We'll see. This is a placeholder for leftover time.The workshop is divided into two parts. After the theory parts, we will demonstrate the ties and give you the chance to practice. Each tie is demonstrated and explained in front, afterwards you can give it a try. We have a team of people around to answer questions and help you out if you need assistance. This workshop is designed specifically for beginners, so there are no \"stupid\" questions. We all started out at some point, and asked the same or similar things back then. The team also has safety scissors at hand ;)You do not necessarily need to bring a partner. Before the practice session, you will have the chance to pair up for practice. While it's always up to you with whom (or even if at all) you want to practice, the experience from the past years has shown us that it somehow always worked out for people to find someone to practice with.While this workshop mostly focuses on rope and rope bondage, we'll also talk about other materials (proper vs. crappy handcuffs, etc.) in the seminar-style theory part.If you have own rope, please do bring it along. We will have some rope you can borrow on a first-come-first-serve basis. Still, the more we have, the better. In case you are unsure whether the rope you have is suitable or not, just bring it along and ask. If you have any further questions you would like to ask us beforehand, feel free to drop by the KinkyGeeks assembly.This workshop is western-style bondage. We want to make bondage accessible to humans of all sizes, shapes, and weights. We therefore place fun and safety above faithfulness to traditional Shibari in this workshop. We'll talk about why a tie works and get the principles right (e.g. the basics of preventing self-tightening ties), rather than minimize or prettify a tie.'''Important:''' In the previous years, we regularly had way too many people trying to get in (rooms are objects of finite size), with waiting lines all across the hallway. This year, we want to avoid the crowd control issues that come with such scenarios. That's why you now need to pre-register for the workshop at https://ticket.kinkygeeks.de. Our website will give you a free ticket, which you need to provide at the workshop door to gain access.The small print: Participation in the practical parts is at your own risk. You must be at least 18 years old to participate in the practical part.",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Lil-Missy",
      "public_name": "Lil-Missy"
    }
  ],
  "links": [
    "https://kinkygeeks.de"
  ]
}