{
  "id": 1704,
  "guid": "f9e9fabe-5854-4eb8-bc0e-668ce060f508",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Protestformen_im_Gespr%C3%A4ch_-_ein_offener_Erfahrungsaustausch",
  "logo": null,
  "date": "2019-12-29T13:00:00+01:00",
  "start": "13:00",
  "duration": "1:30",
  "room": "Roter Salon",
  "slug": "36c3-1704-session_protestformen_im_gespraech_ein_offener_erfahrungsaustausch",
  "title": "Protestformen im Gespräch - ein offener Erfahrungsaustausch",
  "subtitle": "",
  "track": "self organized sessions",
  "type": "talk",
  "language": "de",
  "abstract": "",
  "description": "\nProtesformen im Gespräch - ein offener ErfahrungsaustauschMit einer gemeinsamen Gesprächsmoderation Die eingeladenen Panelteilnehmer für das anschliessende Gespräch zum Thema Ziele, Vor- und Nachteile der verschiedenen Protestformen - Rita für Alles Allen - Johannes für 1000 Gestalten - Lale für die Volksbühnenbesetzung - Marius für die Zentrum für das Zentrum politische Schönheit - Jule Torhorst für Künstler mit Herz Brandenburg- Jan als Pastor Leumund, Bergpartei, Deserteur Label- Micha für das Quartiersmanagement Grunewald Zum Inhalt des Gespräches Alle Teilnehmer des Gesprächpanels sind bewusst nicht als Sprecher und Repräsentanten der jeweiligen Gruppen und Aktionen eingeladen. Uns interessiert die persönliche Sichtweise, was sie zum Protest gebracht hat und die Erfahrung mit der gewählten Protestform. Dabei wird das offene Gespräch und der Austausch über die verschiedenen für und wider der verschiedenen Protestformen gesucht.Idee und UmsetzungWas war die Intention? Wie war die Umsetzung? Seid ihr zufrieden? Was ist gut und was schief gelaufen? Was habt ihr gelernt? Was würdet ihr ändern und was wieder tun?",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:Kreatur",
      "public_name": "Kreatur"
    }
  ],
  "links": []
}