{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/11010.html",
  "id": 11010,
  "guid": "fbfe920f-c312-4829-893b-1f68bddc80d9",
  "logo": null,
  "date": "2019-12-29T11:30:00+01:00",
  "start": "11:30",
  "duration": "01:00",
  "room": "Eliza",
  "slug": "36c3-11010-protecting_the_wild",
  "title": "Protecting the Wild",
  "subtitle": "Conservation Genomics between Taxonomy, Big Data, Statistics and IT-Security",
  "track": "Science",
  "type": "lecture",
  "language": "en",
  "abstract": "Conservation genomic approaches are crucial for establishing long-term sustainable conservation and management strategies for the protection of biodiversity and natural ecosystems. In this talk, the diverse and disparate fields of expertise and activism are presented, which are involved in building effective conservation genomic reference datasets and their infrastructures, analytical inference/prediction environments and operational tools for practical application. ",
  "description": "Natural ecosystems and biodiversity are lost at an alarming and accelerating rate due to anthropogenic (over-) exploitation, habitat destruction and climate change.\r\n\r\nConservation genomics promises to provide reliable and detailed insights into the current state of species and their interactions, as well as, the processes shaping their reactions to change. Such knowledge is urgently needed for forecasts of species’ responses under quickly and potentially unpredictably changing climatic and environmental conditions, as well as, sociopolitical changes and shifting patterns of economic (over-) exploitation. Conservation genomic insights will allow societies in dynamic contexts to come to adequate decisions and effective action in time.\r\n\r\nReliable, decisive and useful practical tools that are robust under real-world operational conditions are, for example, needed for genetic inventory and monitoring campaigns, by certification initiatives, for example in fisheries or forestry, and in forensic genetic case work enforcing legal protection. \r\n\r\nThe development and implementation of the building blocks for conservation genetic tools will involve the cooperation of experts, activists and citizen enthusiasts from many and, so far, often unconnected backgrounds and communities. These extensive projects will bring together experts from biodiversity science, bioinformatics, statistical genetics, machine learning and IT-security, as well as, citizen scientists and volunteers, conservation activists, stewards and managers of natural “resources”, and local communities.\r\n",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9629,
      "public_name": "Jutta Buschbom"
    }
  ],
  "links": [],
  "attachments": []
}