{
  "id": 1073,
  "guid": "fed8f61d-3e84-4371-bd72-0a4d05151763",
  "url": "https://events.ccc.de/congress/2019/wiki/index.php/Session:Exploring_sustainability_in_a_playful_way_with_improv",
  "logo": null,
  "date": "2019-12-28T13:00:00+01:00",
  "start": "13:00",
  "duration": "1:30",
  "room": "Seminar room 14-15",
  "slug": "36c3-1073-session_exploring_sustainability_in_a_playful_way_with_improv",
  "title": "Exploring sustainability in a playful way with improv",
  "subtitle": "Sustainable Improv",
  "track": "self organized sessions",
  "type": "workshop",
  "language": "en",
  "abstract": "",
  "description": "Get to know a workshop design that uses improvisational theater methods to explore the topic of sustainability, called 'Sustainable Improv'. The idea is to deal with serious topics like the climate crisis in a playful way and share knowledge and ideas for change in the process.\nGet to know a workshop design that uses improvisational theater methods to explore the topic of sustainability, called 'Sustainable Improv'. The idea is to deal with serious topics like the climate crisis in a playful way and share knowledge and ideas for change in the process. Maybe this contains some ideas that might inspire you. How the session will work: We will play and reflect on several improv exercises and games that link to sustainability. - Improv theater is basically theater without a script, with characters and stories created in teamwork between the actors.- You do not need to know anything about improv to attend, and we will try to make everyone feel safe and welcome.- Everyone can do this, you do not need to be particularly brave, spontaneous or creative :-)Here is a summary of what we did: \t\t○ Intro, reasoning behind workshop design\t\t○ Shake hands and discuss (pairs)\t\t\t§ Why did I come here?\t\t\t§ What does the term 'sustainability' mean to me?\t\t○ Rant about something regarding sustainability (in pairs)\t\t\t§ Person A rants on an issue on micro or macro level\t\t\t§ Person B listens, silently\t\t\t§ Person B then describes patterns she heard in what A said and names potential solutions\t\t\t§ Switch roles and repeat\t\t○ \"Superheroes I have a problem\" (in groups of 4)\t\t\t§ A) Multiple solutions, the person who gave the problem votes for the best solution\t\t\t§ B) Scene painting, co-create solutions\t\t\t§ C) Scene painting, additionally with \"new choice\" keyword\t\t○ Exchange facts \t\t\t§ In pairs: People share interesting facts regarding sustainability with each other\t\t\t§ Then groups of 4: select the most interesting of the 4 facts\t\t\t§ Then meet another group of 4 (--> 8 people), pick the most interesting fact of the two; then design a short art performance in 5 min\t\t\t§ Demonstrate the performance to the other groups and then explain briefly, 1 or 2 questions, then move on to next group\t\t○ Debrief: reflection on and conclusions from workshop (in pairs)\t\t○ Bonus (we skipped this part):\t\t\t§ Scene painting, with sustainability related images (\"I am a tree etc.\") (in groups of 6)\t\t\t§ Play an institution context (e.g. a cafe) in 3 variants (in groups of 6)\t\t\t\t□ A) horrible\t\t\t\t□ B) ok\t\t\t\t□ C) awesome",
  "persons": [
    {
      "id": 0,
      "url": "https://events.ccc.de/congress/2019/wiki/index.php/User:IChr",
      "public_name": "IChr"
    }
  ],
  "links": []
}