{
  "url": "https://fahrplan.events.ccc.de/congress/2019/Fahrplan/events/10703.html",
  "id": 10703,
  "guid": "ffe32913-e2ff-4331-b3e6-7f8f180cbd72",
  "logo": "/system/events/logos/000/010/703/large/archimedes-switcher.png?1571782840",
  "date": "2019-12-27T12:50:00+01:00",
  "start": "12:50",
  "duration": "01:00",
  "room": "Dijkstra",
  "slug": "36c3-10703-the_ultimate_acorn_archimedes_talk",
  "title": "The Ultimate Acorn Archimedes talk",
  "subtitle": "Everything about the Archimedes computer (with zero 'Eureka!' jokes)",
  "track": "Hardware & Making",
  "type": "lecture",
  "language": "en",
  "abstract": "This talk will cover everything about the Acorn Archimedes, a British computer first released in 1987 and (slightly) famous for being the genesis of the original ARM processor.\r\n",
  "description": "The Archimedes was designed by Acorn in the UK in the mid-1980s, and was released in late 1987 with massive performance for its medium price (and, with the first OS, a hangover-coloured GUI).  The machine isn't widely known outside Europe.  Even in the UK, it was released just as the IBM PC was taking over, so remained niche.  It was built from scratch with four purpose-designed chips, the ARM, the VIDC, the MEMC and the IOC.  Looking at each chip, we'll take a hardware and software tour through what is one of the most influential yet little-known modern computers.  The talk will detail the video, sound, IO and memory management hardware, alongside the original ARM processor which is quite different to what we have today.  The Arc was a pleasure to program, both simple and fast, and we'll look at its software including the quirky operating systems that made the Arc tick, from Arthur to RISC OS and Acorn's mysterious BSD4.3 UNIX, RISCiX.  The first models were followed by the lower-end A3000 in 1989, which looked similar to the the Amiga 500 or Atari STE but had around eight times the CPU performance:  no sprites, no blitter, no Copper, no problem! ;-)  This talk will also share insights from the original chipset designers, with a tour of prototype hardware and unreleased Archimedes models.\r\n\r\nThe audience will get an appreciation for the Arc's elegant design, the mid-1980s birth of RISC processors, and the humble origins of the now-omnipresent ARM architecture.\r\n",
  "recording_license": "",
  "do_not_record": false,
  "persons": [
    {
      "id": 9492,
      "public_name": "Matt Evans"
    }
  ],
  "links": [],
  "attachments": []
}